{"title":"3-tier Bar Unit Matte Brass and White Oak","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182528_1.jpg","description":"Elegant lines of electroplated brass add alluring elegance to this stunning, modern bar unit. Crafted with durable steel and other high-quality materials, it adds glamorous dimension wherever you choose to place it. The spacious upper and lower shelf feature curved corners and a crisp, white oak finish. The smaller, matching center shelf is equipped with a guardrail to secure delicate bottles. Hang valuable stemware from the convenient rack attached for a complete setup that's perfect for entertainment."}
{"title":"Bar Unit with Stemware Rack Antique Nutmeg","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/130071_1.jpg","description":"Visually striking, this industrial bar unit transforms modern spaces. With a sleek front, the antique nutmeg finish features an exposed wood grain and distressing that adds texture. A smooth panel in a deep hue matches the open edges of the frame for a cohesive feel. Host guests or play bartender with the one-sided shelves and clean front, complete with a foot rail. Great on its own or with a set of bar stools, this bar unit is perfect for the contemporary entertainer."}
{"title":"2-tier Bar Unit Glossy Black and White","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/130076_1.jpg","description":"Celebrate art deco-inspired design with the interesting pattern on this modern bar unit. Featuring a geometric rectangular center in glossy black and chrome, this bar dazzles with retro bliss. The metal construction provides sturdy storage for libation bottles and glassware. Display stemmed glasses with the built-in display rack. Two elongated shelves and a sleek table top offer ample room to prepare and display drinks."}
{"title":"3-tier Bar Unit Black Nickel and Black Oak","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182527_1.jpg","description":"Perfect for entertaining, this elegant, modern bar unit is a step above the rest.A built-in stemware rack offers safe, secure storage for delicate glassware.The middle shelf is equipped with a guardrail to keep bottles neatly in one place.The sleek, metal frame is electroplated in polished black nickel for a bold, contemporary look.The storage shelves are finished in deep black oak with subtle wood grains to add classic appeal to its modern design."}
{"title":"Wall Unit with Wine Rack Merlot","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/3080-1_1.jpg","description":"Entertain in style. This traditional bar wall unit makes it easy to serve guests as well as schedule regular happy hours. Beautiful construction features shelving and drawers to store and organize wine and implements. Enjoy a classic cherry finish that offers a deep, rich hue. This bar wall unit becomes a central focus in a main living space."}
{"title":"Bar Unit with Wine Bottle Storage Walnut","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100439_1.jpg","description":"Complete a modern minimalist motif with the sleek lines from this walnut bar unit. Display your favorite glass stemware on the wine glass holders or on the six side shelves. In a warm hue, the open silhouette looks elegant with a shiny metallic guardrail that helps to secure belongings. A built-in eighteen bottle wine rack is great for the social entertainer. Enjoy a freshly poured libation around the bar, perfect for a transitional space or versatile living room."}
{"title":"2-shelf Bar Unit Silver and Frosted Glass","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100135_1.jpg","description":"From fancy dinner parties to laid-back barbecues, this magnificent metal bar unit is the perfect upgrade to any room where guests may gather. Its versatile design provides a variety of convenient options for your entertaining needs. The contemporary curves of its metal frame add a sleek, sophisticated aesthetic, while transparent smoked acrylic panels put your glassware collection on proud display. A frosted, tempered glass top finishes off its bold, modern look. Featuring a handy metal rack for stemware and multiple shelves, this unit easily accommodates a wide variety of bar accessories."}
{"title":"3-Bottle Wine Rack Bar Unit Smoked and Black","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182135_1.jpg","description":"Heavy on the modern elegance scale, the design of this elegant bar unit turns heads as it provides comprehensive serving and entertaining functions. Enjoy a lovely smoked acrylic with black tempered glass and black metal frame, combining to offer a sophisticated ambiance. With two-tier black tempered glass tops and two identical shelves, storage and service are easy. A stemware rack and wine rack holding three bottles creates a perfect setup for intimate gatherings. Entertain in a modern space with the confidence and utility of this exceptional bar unit."}
{"title":"2-drawer Bar Unit with Marble Top Warm Brown","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100678_1.jpg","description":"With a timeless design, this classic bar unit elegantly accentuates a traditionally-decorated home. Its base sports an appealing, warm brown finish with striking carved embellishments adorning its sides. A smooth, grey marble top gives it a touch of posh sophistication. Its spacious storage area provides plenty of room for bottles, mixing supplies, and anything else you may need to craft your favorite cocktails. It also features a metal wrap-around foot rest with a beautiful bronze finish, helping your guests relax in comfort."}
{"title":"3-piece Bar Set Grey and Satin Nickel","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/183143-S3_21.jpg","description":"Perfect for compact dining spaces and home bars, this three-piece bar set comes with a round table and two bar stools. The round table features an hourglass-like wire frame, crafted in a heavy gauge steel that is electroplated. On top of the frame is a clear tempered glass tabletop that offers an open, airy look. Each bar stool has a cozy padded seat cushion wrapped in a leatherette and is supported by the same wire steel construction as the bar table. Each of the barstools also feature a rounded grid backrest and footrest for extra support."}
{"title":"3-piece Bar Set White and Matte Brass","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/183147-S3_21.jpg","description":"Perfect for compact dining spaces and home bars, this three-piece bar set comes with a round table and two bar stools. The round table features an hourglass-like wire frame, crafted in a heavy gauge steel that is electroplated. On top of the frame is a clear tempered glass tabletop that offers an open, airy look. Each bar stool has a cozy padded seat cushion wrapped in a leatherette and is supported by the same wire steel construction as the bar table. Each of the barstools also feature a rounded grid backrest and footrest for extra support."}
{"title":"2-door Bar Unit with Adjustable Shelves Cappuccino","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100218_1a.jpg","description":"The classic design of this bar unit lends a touch of stately sophistication to a traditionally decorated home. Constructed from solid hardwood in a cappuccino finish, it's both durable and pleasing to the eye. It comes complete with a handy stemware rack and large storage area for wine bottles. Two additional side cabinets provide extra space to accommodate a wide range of bar accessories. With its elegant appearance and convenient versatility, it provides endless options for entertaining guests in style."}
{"title":"5-shelf Bar Unit Aged Oak","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182071_1.jpg","description":"Serve up smile after smile at your next gathering of guests. This handsome, wooden bar unit boasts a bold, rustic design to enliven your space. Five roomy shelves with stemware racks provide plenty of space for your party essentials. A metal footrest is attached to the front, keeping guests comfortable as you show off your mixology skills. Top-quality craftsmanship ensures maximum durability for years of lasting enjoyment."}
{"title":"1-shelf Bar Unit Glossy Black and White","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100654_4.jpg","description":"You'll be the life of the party when you step behind this sleek, contemporary bar unit. Its tempered glass top provides plenty of space to show off your mixology skills. Striking panels of black and white acrylic adorn its base, giving it a bold appearance. A sturdy metal foot rest allows guests to rest their feet comfortably. This unit offers lots of space to store your bar accessories and looks fabulous in a parlor or recreation room."}
{"title":"2-shelf Bar Unit with Footrest Dark Oak","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182304_1.jpg","description":"Treat your decor to the bold, modern luxury of this beautiful, dark oak bar unit. Tastefully traced with lines of gleaming chrome, it's an elegant choice for anyone who likes to entertain. This stunning piece features clear tempered glass shelves to organize barware and party essentials. Stemware racks and wine bottle racks provide even more options for organization. This metal and glass bar unit is especially ideal for a rec room, game room, or dining nook."}
{"title":"3-tier Bar Unit Glossy White","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/180239_6.jpg","description":"Infuse any entertainment room with sleek, contemporary glamour. This bar unit boasts a chic, trendy aesthetic that makes any space look a bit more upscale. Its white, high-gloss finish is brilliantly accented by decorative lines of chrome embellishments. With built-in shelving and ample storage space, you'll never have to worry about running back to the kitchen for more glasses. Cool and creative, this bar is also highly functional."}
{"title":"2-tier Bar Unit Black and Chrome","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/101065_2.jpg","description":"Beautifully crafted with high-quality acrylic panels and a clear glass top, this contemporary bar unit lets you entertain in style. Its smooth, curved silhouette gives it an elegant appearance. With a spacious storage area, it leaves plenty of room for all of your bartending needs. A convenient stemware rack completes its convenient appeal. Whether you're hosting a swanky soiree or a casual cocktail hour, this bar unit is ideal for any occasion."}
{"title":"2-tier Bar Unit White and Chrome","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/101066_4.jpg","description":"Upgrade your home entertainment options with this gorgeous, contemporary bar unit. With a convenient wine glass rack and ample storage space, it easily accommodates a wide variety of stemware, bar accessories, and cocktail ingredients. Graceful and glamorous, its curved silhouette is beautifully accentuated with gleaming chrome accents. A large, tempered glass top gives you plenty of prep space to mix delicious drinks for your guests. Complete with clear acrylic panels, this stylish unit allows you to show off your collection of fine wines and spirits in style."}
{"title":"1-drawer Bar Unit Rustic Oak","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182875_1.jpg","description":"This bar unit, made of warm, chocolatey rustic oak, adds heightened elegance to and advanced versatility to answer your storage needs. At its center is a three-tiered wine rack, hosting a total of 18 bottles of your favorite vintage. Topping the wine rack is an open surface for placing upright bottles or glasses, or other practical or special-occasion items. The rack is flanked by two three-compartment storage areas for glasses, dishes or any other objects for use or display. The full effect is high-end art along with charm and utmost functionality."}
{"title":"Glass Top Bar Unit Black","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100139_1.jpg","description":"Bring your next cocktail party to life with a stunning statement of glamour. This marvelously modern chrome bar unit lets you show off your mixology skills in style. Place contemporary bar stools of your choice in front of its metal foot rest to give your guests a comfy front row seat as you lavish them with tasty libations. Two separate glass tops provide plenty of space to mix and serve. With striking panels of black and white acrylic and a pleasingly curved silhouette, this charming bar unit looks fabulous in an elegant parlor or lounge."}
{"title":"Marble Top 3-drawer Bar Unit Warm Brown","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/100173_20.jpg","description":"Whether you're a cocktail connoisseur or an amateur mixologist, this attractive bar unit helps you take your skills to the next level. A large preparation area allows plenty of room for experimentation. This unit boasts a stunning marble countertop and graceful lines etched into classic wood construction. Three drawers and two wine racks provide lots of storage space to accommodate a wide variety of tasty libations. This traditional bar lends an air of tasteful elegance anywhere you choose to place it."}
{"title":"2-door Bar Unit Black and Clear","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/100175_1.jpg","description":"You'll be the center of attention when you step behind this gorgeous, contemporary bar unit. Its sleek silhouette gracefully highlights your refined sense of style as you show off your favorite mixology techniques. Its clear, tempered glass panels blend appealingly with a bold, black finish and elegant, curved design. With multiple storage compartments, a convenient stemware rack, and additional storage for wine bottles, it's is ideal for gatherings of all sizes and occasions. With versatile functionality and a pleasingly modern design, this stylish unit makes a delightful addition to any home."}
{"title":"5-piece Bar Set White High Gloss and Chrome","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/182525_1.jpg","description":"Ultra-modern with a clean lined silhouette, this five-piece bar set comes complete with a rectangular shaped bar table and four bar stools. Perfect for more contemporary home, the table comes with sleek and square legs made and a steel frame in an electroplated and polished chrome finish that lends a luxurious gleam to any room. The tabletop features a high gloss white lacquer finish and seats four people comfortable. Each stool also features a matching lustrous high gloss white seat and matching legs. One the stools are also footrests for extra support and stability."}
{"title":"5-piece Bar Set Weathered Chestnut and Black","Tags":"Bars & Bar Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/182002.jpg","description":"Sleek in style, this five-piece bar set offers instant elevation to any small space. Smooth metal legs feature a dark hue and clean lines. Resting on top of the open base are smooth seats and a top in weathered chestnut. Create elevated dimension with the subtly exposed wood grain. Make a beautiful statement with the industrial-inspired details from this stylishly modern set."}
