{"title":"Woodmont 5-piece Queen Platform Bedroom Set Rustic Golden Brown","Tags":"Bedroom Set","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/222631Q-S5_21.jpg","description":"Warmth and tranquility are the hallmarks of the style and design of this impressive transitional 5-piece bedroom set featuring storage bed, nightstand, dresser, mirror, and chest that brings a blend of classic style and modern conveniences. All pieces are fashioned with a full matte rustic golden brown finish that includes beautiful wire brushed wood grain details. The platform-style bed features a two-drawer storage footboard and imposing headboard. The drawers in the footboard and on each case piece are outfitted with handsome wooden pull handles. Except for the mirror, each piece of the set features solid block legs for the final detail of this visually appealing and cozy storage bedroom set."}
{"title":"Woodmont 4-piece Queen Platform Bedroom Set Rustic Golden Brown","Tags":"Bedroom Set","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/222631Q-S4_21.jpg","description":"Upgrade the warmth and tranquility of your bedroom with this impressive transitional 4-piece bedroom set featuring storage bed, nightstand, dresser, and mirror that brings a blend of classic style and modern conveniences. Each piece is crafted with a full matte rustic golden brown finish that includes beautiful wire brushed wood grain detail. The platform-style bed features an imposing headboard and two-drawer storage footboard. The drawers in the footboard and on each case piece are crafted with wooden pull handles. Solid block legs on each of the pieces, save for the mirror, add the final detail to this magnificent bedroom set."}
{"title":"Woodmont 5-piece Eastern King Platform Bedroom Set Rustic Golden Brown","Tags":"Bedroom Set","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/222631KE-S5_21.jpg","description":"Warmth and tranquility are the hallmarks of the style and design of this impressive transitional 5-piece bedroom set featuring storage bed, nightstand, dresser, mirror, and chest that brings a blend of classic style and modern conveniences. All pieces are fashioned with a full matte rustic golden brown finish that includes beautiful wire brushed wood grain details. The platform-style bed features a two-drawer storage footboard and imposing headboard. The drawers in the footboard and on each case piece are outfitted with handsome wooden pull handles. Except for the mirror, each piece of the set features solid block legs for the final detail of this visually appealing and cozy storage bedroom set."}
