{"title":"3-piece Counter Height Set Nut Brown","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/130004.jpg","description":"Perfect for small spaces, this counter height bar table set includes two bar stools. In a warm nut brown hue, the sleek lines are given texture. Featuring a slightly exposed wood grain, create a beautiful visual in any kitchen nook or transitional area. The bar stools feature an upholstered and plush seat made of black leatherette fabric. Sophisticated and elegant, the seats feature a stylish button tufting."}
{"title":"Beckham 5-piece Round Dining Set Chrome and White","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/106440-S5_21.jpg","description":"You'll love the comfort and aesthetics of this contemporary five-piece dining set featuring chrome and glass. The set includes a round glass table and four Z-shaped padded chairs for a visually stunning element. The extra thick tempered glass tabletop sits on a chrome finish asterisk metal base that draws the eye. Each funky chair is crafted with alluring contours and white leatherette for stunning style. The base and legs come in shiny chrome finish that imparts glam and panache."}
{"title":"3-piece Dining Set with Drop Leaf Cappuccino and Tan","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/130005ii_1.jpg","description":"Elevate the tasteful look and feel of a dining nook or parlor with this chic, stylish dinette set. Its compact size and sleek design blend effortlessly into rooms of all shapes, sizes, and decor styles. Soft, cream colored upholstery covers the plush, padded seats of its two comfortable chairs. The classic glamour of its round, wooden table is enhanced by the versatile functionality of a convenient folding leaf. A deep, rich cappuccino finish and sleek, graceful lines complete the glamorous look of this elegant three-piece set."}
{"title":"Calandra 7-piece Dining Set with Extension Leaf Vintage Java","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192951-S7_21.jpg","description":"This seven-piece dining set includes a spacious rectangular table, four side chairs, and two armchairs with distinctive Mission style flair.This elegant set offers a sturdy mahogany wood frame in a rich vintage java finish with notch-like accents.Have guests over and create more space with two 18-inch extension leaves, capable of accommodating everyone comfortably.In addition, the side chair chairs offer a carved, saddle seat and a curved Arts and Crafts slat back.Place this furniture set in a modern farmhouse dining space for a classic, rustic touch."}
{"title":"5-piece Dining Set Ark Brown and Matte Black","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/150505.jpg","description":"Keep it simple and modern with this five piece dining set. The look of wood tops on a metal frame is characteristic of a modern industrial design theme, popular in loft spaces and modern homes. The finishes bring added protection against the activity of daily life with a PVC coating on MDF surfaces and a scratch-resistant powder coat on the metal frames. The contrast of brown surfaces with a black frame evokes a masculine feel for this industrial dining set. This aesthetic with clean lines is perfect for a loft space or modern condo."}
{"title":"Beaufort 6-piece Dining Set Dark Grey and Chrome","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109451-S6_21.jpg","description":"With an Art Deco flair, this six-piece dining set comes complete with a spacious table, four chairs, and a bench.The table features an angular, geometric base in a shiny chrome finish as well as a thick tempered glass tabletop with a softly beveled edge.Each of the four chairs offer a channel tufted, rolled back and the bench offers a padded, button tufted seat.These upholstered pieces are wrapped in a soft dark grey velvet with sleek flared legs that mimic the table base finish.This stunning table makes the perfect addition to a modern dining with a fun Hollywood glam vibe."}
{"title":"5-piece Drop Leaf Dining Set Natural Brown and White","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/4241-S5_21.jpg","description":"Bring your dining space a light, airy ambiance with this two-tone five-piece dining set. The set includes a round table with drop-down leaves that either save space or extend for unexpected company and four spindle back chairs with wood seats. The table also comes with a prominent pedestal base that's both stylish and supportive. Each chair has angled legs that give it a more assertive appearance. The tabletop and seats are crafted with a natural brown finish while the table base, legs, and seat backs all come in a brilliant white finish."}
{"title":"3-piece Dining Set with Drop Leaf Natural and Tan","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/130006_1.jpg","description":"This lovely dining set lends an elegant touch of simple sophistication to a kitchen or breakfast nook. It comes complete with a lovely, round dining table and two comfy chairs upholstered in soft, light brown, padded fabric. The table is enhanced by a versatile drop-down extension which can be raised to accommodate an elaborate dining setup. Lowering it allows you to cozy up closely with a special someone over a leisurely breakfast or romantic, candlelit meal. A smooth, polished, natural wood finish gracefully complements the sleek, stylish silhouette of this beautiful three-piece set."}
{"title":"Coleman 5-piece Counter Height Dining Set Rustic Golden Brown","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/192028-S5_1.jpg","description":"Share a homecooked meal together around this charmingly simple 5-piece counter height dining set from the Coleman collection. A rustic golden brown finish brings out the rich grains of the solid hardwood construction. Farmhouse chic is a trending look right now, characteristically displayed with timeless craftsmanship and bold clean lines. The construction of the plank-style tabletop and ladderback chairs makes this dining group feel handcrafted. The counter height design of this set brings its primitive looks into the twenty-first century."}
{"title":"5-piece Rectangular Dining Set Dark Bronze","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/100033.jpg","description":"This stunning five-piece dinette set is as fashionable as it is functional. With seating for up to four, it's perfect for an eat-in kitchen or breakfast nook. Its beautiful dark bronze finish is enhanced by an eye-catching crisscross design and artistic circular accents. A vinyl-topped table and seats allow for easy cleaning, while a base of metal tubing provides strength and durability. This lovely dining set is ideal for grabbing a quick bite before heading to work, or for sitting down to enjoy a leisurely meal with the whole family."}
{"title":"5-piece Rectangular Dining Set Brushed Silver","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/100035.jpg","description":"Gather loved ones for a toast around this stylish dining set and create cherished memories to last a lifetime. Constructed from strong metal tubing and high-quality vinyl, it includes four comfortable dining chairs and a rectangular table with smooth, beveled edges. With its compact size, this set works perfectly as a main dining table in a small apartment, or as an additional seating area in a large, well-furnished home. Its transitional design features a crisscross design enhanced by pleasing circular accents. Sleek, graceful lines and a gorgeous, brushed silver finish round out its elegant appearance."}
{"title":"Calandra 6-piece Dining Set with Bench Vintage Java","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192951-S6_21.jpg","description":"Featuring distinctive Mission flair, this six-piece dining set includes a spacious rectangular table, four side chairs, and a long bench.This set offers a sturdy mahogany wood frame in a rich vintage java finish with notch-like accents.Have guests over and create more space with two 18-inch extension leaves, capable of accommodating everyone comfortably.In addition, the side chair chairs offer a carved, saddle seat and a curved Arts and Crafts slat back.Place this furniture set in a modern farmhouse dining space for a classic, rustic touch."}
{"title":"5-piece Counter Height Dining Set Red Brown and Tan","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/150154.jpg","description":"This simple yet striking counter height dining set will have guests impressed at first sight. The square, faux marble table top exudes a classy, yet functional style. Four ladder back chairs enhance the clean, tapered table legs, adding a glamorous look with excellent support. The tan seat cushions provide the comfort and quality that you would expect. This is a perfect dining set to enjoy a quiet meal or a cup of coffee with friends and loved ones."}
{"title":"Abby 5-piece Dining Set White and Light Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/110321-S5_21.jpg","description":"Ultra-modern with a striking design, this contemporary dining set comes complete with a round table and four matching dining chairs made of mixed materials. The dining table features a sturdy boomerang-shaped metal base in a chrome finish, topped by a high gloss white tabletop. On the tabletop is also a convenient lazy susan that can be removed for formal occasions. Each of the four dining chairs feature a Mid Century modern style bucket seat design, wrapped entirely in a light grey fabric with a honeycomb quilted exterior. Each bucket seat also rests on a 360-degree swivel base in a shiny chrome finish, allowing you to easily grab seconds and refill refreshments."}
{"title":"Calandra 5-piece Dining Set with Extension Leaf Vintage Java","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192951-S5_21.jpg","description":"With a Mission style flair, this five-piece dining set includes a spacious rectangular table and four side chairs.This set offers a gorgeous mahogany wood frame in a vintage java finish with notch-like accents.Host a party and create more space with two 18-inch extension leaves, capable of stretching the table to accommodate ten guests comfortably.In addition, each chair offers a carved, saddle seat and a curved Arts and Crafts slat back.Place this dining table in a rustic lakeside retreat or a mountain cabin."}
{"title":"Carmelo 5-piece Rectangular Dining Set Chrome and Black","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/107931-S5_21.jpg","description":"This contemporary five-piece dining set showcasing chrome and glass makes the perfect showpiece in a modern home. The set includes a rectangular glass table and four shapely chairs that are visually stunning. The rectangular extra thick tempered glass of the tabletop virtually “floats\" on a chrome finish asterisk metal base that steals the show. The four chairs feature shapely lines and channel stitching in contrasting black and white leatherette for a stunning contrast. The base and legs are crafted with a lustrous chrome finish that imbues your dining space with glam and pizzazz."}
{"title":"Beverly 5-piece Round Dining Set Dark Cocoa and Dark Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109530-S5_21.jpg","description":"This Mid-Century Modern five-piece dining set is the perfect place for an intimate gathering of friends and family. This functional and stylish set includes four side chairs and a round table. The tabletop features an elevated lazy Susan and solid cone-style base for support and style. Each chair comes in a shapely, spacious curved demi-arm design contoured to fit your back for the ultimate comfort. The dark grey fabric upholstery is a handsome match for the table, which features wood construction in a handsome dark cocoa finish, and adds an element of warmth and style."}
{"title":"5-piece Counter Height Dining Set Black and Brown","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/150097.jpg","description":"Establish a contemporary aesthetic in your dining space with this five-piece table set. This counter height ensemble marries utility and beauty in a unique architectural design. A birch veneer table top in a light oak finish sits elegantly upon a matte black and gold metal frame. The four wood and metal framed stools fit perfectly under the table, allowing for greater room in any space. This table set will have you trying out that new recipe in modern style."}
{"title":"5-piece Dining Set with Bench Cappuccino and Dark Brown","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/150232_1.jpg","description":"Be it everyday meals with the family or casually catching up with friends over wine in the dining room, this five-piece set is the perfect fit for your home. Crafted from Asian tropical hardwood and Okume veneer, the rectangular table boasts straight clean lines and bold tapered legs. Three chairs with comfy padded brown leatherette seats bolster the table, while the leatherette bench adds functionality. The classic details also add an element of tradition to any occasion. This ensemble is sure to be a foundation of fond memories."}
{"title":"5-piece Dining Set Chestnut and Tan","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/150430.jpg","description":"Gather your loved ones round to experience the luxurious comfort and elegant style of this five-piece dining set. This sleek, classically designed set comes complete with one table and four chairs. Clean and subtly curved lines create a minimalistic rectangular dining table. A handsome slatted wood backrest adds flair and dimension to its chairs. Cushy, comfy padded seats are covered in soft, beige fabric that feels exquisite to the touch."}
{"title":"Beaufort 5-piece Dining Set Dark Grey and Chrome","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109451-S5_21.jpg","description":"This glamorous five-piece dining set comes complete with a long table and four chairs.A stainless steel base is polished to a lustrous chrome finish, topped by a thick tempered glass tabletop with a timeless beveled edge.Each chair features a rolled back with channel tufting for an Art Deco vibe.In addition, each retro style chair is wrapped in a soft dark grey velvet with chrome finish legs that match the table base.Place this gorgeous table set in a contemporary dining room for an elegant dining experience."}
{"title":"5-piece Dining Set Cappuccino","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/150152.jpg","description":"Go all-in on a classic motif with this five-piece dining set. Full of clean lines, the table features a rectangular silhouette with straight edges and square tapered legs. Elegant in style, the side chairs are complete with vertical slat backs that honor timeless design. Contoured wooden seats help to create comfort. Rich and warm, the cappuccino finish puts the finishing touch on a traditional dining room."}
{"title":"Aviano 5-piece Dining Set Gunmetal and Matte Black","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/108291-S5_1.jpg","description":"Celebrate eye-catching style in your dining room with this 5-piece dining set from the Aviano collection. A round tempered glass tabletop makes the most of available space, while highlighting the sculptural appeal of the table base. The table base displays an exquisite design of curves meeting around center rings all in a rich gunmetal finish. Cushioned barrel shape chairs are plushily upholstered in supple anthracite leatherette for the ultimate comfortable dining experience. This set is the perfect space-saving solution for a casual contemporary dining room."}
{"title":"5-piece Dining Set with Upholstered Chairs Matte Black and Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/150521_1.jpg","description":"Elevate your dining space to new heights of style. This transitional, five-piece dining set creates an elegant setting for family dining enjoyment. The metal table base forms soft, curved supports and features a powder coated finish for extra durability. The four cozy chairs are upholstered in grey fabric with thick, plush padding for an exquisite level of comfort. The round tabletop showcases wood grain accents for a rich, rustic vibe that's sure to enhance your space."}
