{"title":"Delphine 5-piece Trestle Counter Dining Set Vintage Dark Pine","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192748-S5_21.jpg","description":"Lend a rustic vibe to a contemporary home with this five-piece counter height dining set, complete with a trestle table and four chairs in a vintage dark pine wood finish.Beautiful and charming, the table offers a plank style tabletop that rests on a tall trestle base with accent molding and bracket feet.Each of the four ladder back style chairs feature similar style frame with gently tapered legs.Sit comfortably on these chairs, as well, as each features a padded seat cushion, wrapped in a supple brown leatherette.In addition, this table offers a 20-inch leaf extension to create extra dining space for more guests."}
{"title":"Darcy 5-piece Rectangle Dining Set Weathered Ash and Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/123091-S5_21.jpg","description":"Welcome rustic farmhouse flair to your home with this five-piece dining set, complete with an expansive, rectangular table and four side chairs in a weathered ash wood finish.The table comes with dual pedestal base and 18-inch leaf extensions, which allows for plenty of seating and lends a casual vibe to a formal dining space.Each French-inspired side chair includes a curved backrest and seat cushion, each padded and wrapped in a light neutral fabric to complement existing color palettes.Small details such as flared, tapered legs and welt rim add to the timeless charm of this furniture set.Place this French country style dining set in a formal dining space to entertain a large group of guests."}
{"title":"Kingman 6-piece Rectangular Dining Set Espresso and White","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109541-S5_21.jpg","description":""}
{"title":"Madelyn 5-piece Rectangle Dining Set Dark Cocoa and Coastal White","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/110381-S5_10.jpg","description":"Perfect for a beachside cottage or country style bungalow, this five-piece dining set includes a casual table with four chairs in a two-tone finish.This set's charming table comes with oversized wood turned legs in a crisp, magnolia white finish, topped with a plank style tabletop.Each chair also features the same two-tone design, along with turned legs and a ladder style backrest for diners to lean into.The chairs also have a carved wood seat.Extend this dining table even further with its 18-inch leaf to host and entertain an even larger dinner party."}
{"title":"Wethersfield 7-piece Dining Set Medium Walnut and Latte","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109841-S7_21.jpg","description":"Ideal for a contemporary dining room, this seven-piece dining set includes a minimalistic, rectangular table and six upholstered side chairs.The table is made of solid hardwood with a warm walnut finish that matches each chair's exposed wood frame.With a modern Parson style design, each chair is wrapped in a soft latte toned twill fabric for ultimate comfort.Place this dining set in your existing color palette with its neutral tones.In addition, this table and chairs make for a relaxing environment when hosting parties and get-togethers."}
{"title":"Darcy 7-piece Rectangle Dining Set Weathered Ash and Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/123091-S7_21.jpg","description":"Deliver rustic farmhouse flair to your home with this seven-piece dining set, complete with an expansive, rectangular table, four side chairs, and two armchairs, all in a lovely, weathered ash wood finish.The table comes with dual pedestal base and 18-inch leaf extensions, which allows for plenty of seating and lends a casual vibe to a formal dining space.Each French-inspired side chair includes rolled arms, as well as a curved backrest and seat cushion, each padded and wrapped in a light neutral fabric to complement existing color palettes.Small details such as flared, tapered legs and welt trim add to the timeless charm of this furniture set.Place this French country style dining set in a formal dining space to entertain a large group of guests."}
{"title":"Delphine 5-piece Dining Set with Extension Leaf Vintage Dark Pine","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192741-S5_21.jpg","description":"It's the little things that create the rich and robust look of this rectangular dining table and four chairs set.In a compelling vintage rustic pine finish, the table features a plank style tabletop with a trimmed and recessed apron and a 20-inch extension leaf that's ideal for seating six of your favorite people.Each chair is crafted with Asian hardwood and shows off a crisp ladder back with trimmed, tapering legs and leatherette upholstery.The table base features a classic trestle inspired design with a double pedestal.Square posts with elegant trim rest atop curved feet and present a structured finishing touch."}
{"title":"Kendall 5-piece Round Dining Set Gold and Cream White","Tags":"Dining Room Sets","img":"","description":"Majesty and class reign supreme in the classic glamorous look of this five-piece dining set featuring one round table and four side chairs. The table is crafted with an enhanced real marble top with a special paper endowed with a marble pattern applied to create more beauty and elegance. The contemporary table base features sculptural curves that exude a flair for sensual luxury. The two-tone padded chairs are upholstered in a soft cream white leatherette with a glossy gold finish for the legs that matches the base of the table. This dining set will transform your dining space with the glamour and sophistication it conveys."}
{"title":"Nogales 5-piece Rectangle Dining Set Acacia and Coastal Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109811-S5_21.jpg","description":"Place this modern farmhouse style dining set in a home for a more elegant look.Complete with a long table and four chairs, this dining set comes in a two-tone finish of a coastal grey and natural acacia wood finish.Each of the four chairs offer a curved slat style backrest and a padded seat, wrapped in a grey linen-like upholstery.The table adds a striking, contemporary vibe with its flared legs outward beveled edges.Invite the family to enjoy a casual meal and catch up with each other's lives."}
{"title":"Penelope 7-piece Dining Set Island Khaki and Rice Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/411B_1.jpg","description":"This seven-piece dining room set imparts an elegance that goes well in any dining room. It's sized for large gatherings with a large rectangular table top and expertly crafted legs. The entire set is finished in island khaki with stylishly distressed accents. The four side chairs and two armchairs are upholstered in a sumptuous off-white fabric trimmed with contrasting nailhead accents. Enjoy delicious meals and long conversations with this impressive set."}
{"title":"Rory 5-piece Dining Set Multi Color","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/460235.jpg","description":"A child's tea party has never been so enchantingly colorful. This five-piece youth table set from the Rory collection will brighten up any tea-and-cookie party. Simple, sleek table features a square top for all the party's essentials. Four chairs in a medley of colors (charming pink, mint green, baby blue, and rich cream) will help make this the table so popular that kids from all over the neighborhood will be lining up to make reservations. This precious set will quickly become an endearing pleasure for your child."}
{"title":"Conway 5-piece Rectangular Dining Set Dark Walnut and Aged Gold","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/191991-S5_21.jpg","description":"A modern design reigns supreme in the elements of this contemporary five-piece dining set featuring one rectangular table and four side chairs. The smooth dark walnut finish of the tabletop is a handsome, striking contrast to the aged gold finish of the double X trestle base design. Each chair is upholstered in a padded neutral grey leatherette for durability and style. The legs of the chairs also come in an aged gold finish with a single support beam for added sturdiness. The clean lines and muted neutral tones will bring a warm dimension to any dining space."}
{"title":"Pennington 5-piece Dining Set Natural Mango and Dark Ink Blue","Tags":"Dining Room Sets","img":"","description":"Host a fashionable dinner with friends around this chic 5-piece dining set from the Pennington collection. Abundant style makes this set a focal point, with a natural finish solid mango wood table atop striking gold hairpin legs. The gold color continues in the frame of the contemporary chairs, descending with slender, elegantly tapered legs. The comfort of plushily padded seating is accented with a splash of sunny color in light blue. This contemporary set completes the urban chic style your loft or apartment needs."}
{"title":"Darcy 5-piece Round Dining Set Weathered Ash","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/123090-S5_21.jpg","description":"Add a rustic farmhouse flair to your home with this five-piece dining set, complete with a round pedestal table and four side chairs. With a weathered ash wood finish, this set lends a casual vibe to a formal dining space. Each side chair offers a French inspired design, including a curved backrest and seat cushion, padded and wrapped in a light, neutral fabric. Extra details shine, like welt trim on the chairs, add a classic touch. Place this dining set in a traditional space for a charming, country look."}
{"title":"Delphine 7-piece Dining Set with Extension Leaf Vintage Dark Pine","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/192741-S7_21.jpg","description":"Take note of the understated accents that create the rich and robust look of this seven-piece dining table and chairs set, which offers four side chairs and two armchairs for the heads of the table.In a beautiful vintage rustic pine finish, the table features a plank style tabletop with a recessed and trimmed apron and a 20-inch extension leaf that ensures seating for six.Each side and armchair is crafted from durable Asian hardwoods and shows off a classic ladder back design with trimmed, tapering legs and plush brown leatherette upholstery.The base of the table features a rustic trestle inspired design with a double pedestal.Underneath the tabletop, square posts with elegant trim rest atop curved feet and add to a clean, structured look and feel."}
{"title":"Kelso 3-piece Drop Leaf Dining Set Cappuccino and Tan","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/190821-S3_21.jpg","description":"Maximize your dining space with this transitional three-piece dining set that's perfect for a breakfast nook or an apartment setting. The cozy set features a table with a drop-leaf extension and two (2) two-tone lattice-back chairs. The table is crafted with solid block legs and comes in a warm cappuccino finish. The stylish chairs are upholstered in a cushioned tan fabric and tapered legs with the same cappuccino finish as the table. It's a perfect set for a cozy gathering."}
{"title":"Fortress 7-piece Dining Set Chestnut and Vintage White","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/190721_1.jpg","description":"Complete your modern farmhouse dining room with this seven-piece dining set. Complete with one dining table and six side chairs, it offers a matching vintage white finish that lends a country charm. The spacious, rectangular dining table also features a chestnut colored, sandblasted wood tabletop with a dry brushed weathered finish. Each of the six chairs have a sturdy solid wood frame and flared backrests with open double-cross designs. Rest comfortably on their cushioned seats, wrapped in a high performance fabric in a grey hue that complements numerous color palettes."}
{"title":"Mapleton 6-piece Nailhead Dining Set Rustic Amber and Vintage Zinc","Tags":"Dining Room Sets","img":"","description":""}
{"title":"Oakville 7-piece Rectangular Dining Set Bitter Chocolate and Gunmetal","Tags":"Dining Room Sets","img":"","description":""}
{"title":"Wethersfield 5-piece Dining Set Medium Walnut and Latte","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/109841-S5_21.jpg","description":"Perfect for a transitional style home, this five-piece dining set includes a minimalistic, rectangular table and four side chairs.The spacious, solid hardwood table features a warm walnut finish, also mirrored in each chair's exposed wood frame.Each chair offers a modern Parson style silhouette, and padded seats wrapped in a latte hued twill upholstery for each diner's comfort.With a neutral two-tone design, this dining set lends itself nicely to existing color palettes.Create a wonderful atmosphere for guests and family members to dine in with this simply, yet elegant furniture set."}
{"title":"Simpson 7-piece Oval Table Dining Set Latte and Vintage Black","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/411B_1.jpg","description":"This seven-piece dining room set is ideal for an intimate gathering of family and friends. The round table comes with a lovely latte finish and legs and frame in a contrasting vintage black. The set includes four side chairs and two arm chairs, which have rolled seatbacks and armrests. Each chair has an upholstered thick cushion in a luscious beige fabric with nailhead trim along with a contrasting vintage black frame and legs. Enjoy years of durability with a large helping of bucolic style with this charming dining set."}
{"title":"Lavon 5-piece Counter Height Dining Set Medium Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/108218-S5_1.jpg","description":"Center family life around this 5-piece counter height dining set from the Lavon collection. A popular medium grey finish adds to the already bestselling appeal of this transitional collection. The storage pedestal base provides handy access to dining room needs with a closed storage compartment as well as open display shelf. Upholstered counter-height chairs offer additional comfort with cushioned black leatherette seats and stylish lattice back design. The 18-inch extension leaf makes it easy to accommodate extra guests by converting this round table to oval, so feel free to invite friends over."}
{"title":"Lavon 5-piece Dining Set Medium Grey","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/108211-S5_1.jpg","description":"Update that boring dining room with this stylish and practical 5-piece dining set from the Lavon collection. The popular medium grey finish is a new option to highlight the transitional styling of this bestselling collection. Perfect for families, the storage pedestal base table offers not only hidden storage but an open display shelf as well. To accommodate additional guests, simply use the 18-inch extension leaf to convert the round table to an oval shape. The classic lattice back chairs feature added comfort in the form of cushioned seats upholstered in supple black leatherette."}
{"title":"Simpson 6-piece Rectangular Dining Set Vintage White and Vintage Latte","Tags":"Dining Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/105181-S5_21.jpg","description":""}
