{"title":"Whitson Cushion Back Upholstered Sectional Stone","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509766_21.jpg","description":"Simplistic and chic, this sectional is a must-have for stylish living spaces. The wide herringbone chenille fabric is beautifully combined with the stone-colored upholstery, instantly brightening your living area. Track arms provide comfort along with a modern look and feel. Meanwhile, patterned throw pillows add a level of visual interest. Relax in style on the chaise lounge with your favorite book and beverage."}
{"title":"Waterbury 3-piece Pillow Top Arm Power Living Room Set Brown","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/602571P-S3_21.jpg","description":"This 3-piece living room set will serve you well through move nights and game days. Find convenience in the power reclining mechanism on all pieces. The loveseat provides a lift-top storage console with two USB outlets and a power outlet inside. Meanwhile, the sofa brings additional cup holders for your favorite beverage. Take a seat on any of the pieces and enjoy the comfortable cushioning on the backrests and armrests."}
{"title":"Waterbury 3-piece Pillow Top Arm Motion Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/602561-S3_21.jpg","description":"Bring the family over for a big game and enjoy the comfort of this three-piece sofa set. With manual reclining mechanisms, you'll feel that you scored a big win with this set. Incredible comfort is found with the padded cushioning and overstuffed armrests. Place your favorite beverage within the cup holders on the loveseat for ultimate convenience. This set looks striking in home theater rooms or modern living areas."}
{"title":"Whitfield 2-piece Sloped Arm Living Room Set Dove Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509201-S2_21.jpg","description":"Sleek and contemporary, this two-piece set includes a sofa and loveseat with a sloped back and track style arms.Its clean lined silhouette is wrapped in a dove grey chenille upholstery, lined with a black Russian birch frame.Tight waterfall bench seating and a shelter back invite you to kick back and unwind.Included with this set is welted faux down filled accent pillows that match the overall fabric.The black Russian birch frame darts down into arrows shaped feet."}
{"title":"Waterbury 3-piece Pillow Top Arm Power Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/602561P-S3_21.jpg","description":"This 3-piece living room set will serve you well through move nights and game days. Find convenience in the power reclining mechanism on all pieces. The loveseat provides a lift-top storage console with two USB outlets and a power outlet inside. Meanwhile, the sofa brings additional cup holders for your favorite beverage. Take a seat on any of the pieces and enjoy the comfortable cushioning on the backrests and armrests."}
{"title":"Whitfield 3-piece Sloped Arm Living Room Set Dove Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509201-S3_21.jpg","description":"Mixing sleek with contemporary, this three-piece living room set includes a sofa, loveseat, and armchair, each with a shelter style back and sloped, track style arms.Its sleek silhouette is wrapped in a dove grey chenille upholstery, lined with a contrasting black Russian birch frame.Tight waterfall bench seating and a shelter back invite you to kick back and unwind.Included with this set is welted faux down filled accent pillows that match the overall fabric.The black Russian birch frame darts down into arrows shaped feet."}
{"title":"Watsonville 3-piece Cushion Back Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/552001-S2_21.jpg","description":""}
