{"title":"Arden 2-piece Adjustable Back Sectional Taupe","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/508888_1.jpg","description":"Add modern stylishness to your space with this magnificent contemporary sectional sofa. It is exceptionally upholstered in an elegant taupe woven fabric that's soft to the touch. The powder coated black base features U-frame legs for sturdiness. One end has an open chaise-like design, while the opposite has an extension pillow top arm that can be used as a headrest when lounging. An added feature is the individual self-adjusting back rests, which allow for shortening and expanding seat depth."}
{"title":"Asherton 3-piece Living Room Set Grey","Tags":"Living Room Sets","img":"","description":""}
{"title":"Corliss 3-piece Arched Arms Living Room Set Beige and Rose Brass","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/508821-S2_21.jpg","description":""}
{"title":"Avonlea 3-piece Tufted Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/508461-S2_21.jpg","description":""}
{"title":"Drayton 2-piece Flared Arm Upholstered Living Room Set Warm Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509721-S2_21.jpg","description":"Designed with elegantly flared arms and comfy plush seating, this sofa set invite you to sit back and relax. Filled with premium down alternative and foam, this furniture set is built with pocket coil seating to provide long-lasting support and comfort. Plus, each seat and back cushion is wrapped in a warm grey upholstery and is fully reversible, offering easy maintenance. Comfortable boxed seat and back cushions come with top stitching details and offer a total of eight accent pillows, four in a black double sided faux fur and four jacquard pillows. Supported by solid hardwood legs in dark brown finish, each piece is also constructed of a solid wood frame, built for extra stability and made to last."}
{"title":"Contrary 2-piece Reversible Cushion Living Room Set Charcoal","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509381-S2_21.jpg","description":"This two-piece living room set includes a sofa and loveseat with thin, sloped track arms and reversible back cushions and seats.Stitched details add a refined, tailored touch.Wrapped in an easily cleanable, dark brown upholstery, this sofa and loveseat is perfect for families with children.Faux feather down cushions can be fluffed to refresh the support of the cushion.In addition, this living room set makes a wonderful addition to practically any home's existing decor with its transitional style."}
{"title":"Bismark 3-piece Living Room Set with Power Headrest Black","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/609461PPI-S3_21.jpg","description":"Delivering ultra-modern style and super cozy appeal, this power recliner set includes a sofa, loveseat, and chair, each of which offer loads of features, such as voice-activated controls for ultimate relaxation.Wrapped in a black top grain leather, this each recliner price offers everything from power headrests to massaging heated seats.In addition, this recliner lets you keep a refreshment or two nearby with its stainless steel cup holders.There is also convenient task lighting and a drop-down table for keeping snack on.Place this power recliner set in an entertainment room for a contemporary style."}
{"title":"Bleker 2-piece Tuxedo Arm Living Room Set Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509481-S2_21.jpg","description":"Featuring a bold blue velvet upholstery, this seating set offers an iconic Chesterfield style design. With low profile seating and button tufted backrests, this sofa set will lend a timeless vibe to any room. Each furniture piece even features classic, individually hammered silver nailheads along each arm's facade and as trimming along the front rail. Tuxedo arms flank each side of a tufted waterfall bench seat, supported and elevated by shiny silver electroplated tapered legs. Constructed of a solid wood frame, each piece in this sofa set is made to last and offers pocket coil seating that offers long-lasting support and comfort for family and guests."}
{"title":"Chalet 3-piece Tuxedo Arm Living Room Set Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509211-S3_21.jpg","description":"With a contemporary style, this three-piece living room set includes a sofa, loveseat, and armchair all with a shelter back style with vertical, channel tufted interiors, wrapped in a bold navy blue matte velvet.Each piece features a tight waterfall bench seating supported by tapered black metal legs.The arms of each piece roll gently outward, displaying the channel tufting.This set is perfectly suited for a contemporary home that needs a touch of glamour.Its deep, blue tone evokes an elegant nautical vibe, like being on a yacht."}
{"title":"Apperson 3-piece Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/508681-S2_21.jpg","description":""}
{"title":"Bismark 2-piece Living Room Set with Power Headrest Black","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/609461PPI-S2_21.jpg","description":"Super cozy with an ultra-modern look, this power recliner set includes a matching sofa and loveseat, both with loads of features, such as voice-activated controls for ultimate relaxation.Wrapped in a black top grain leather, each recliner piece offers everything from power headrests to massaging heated seats.In addition, this recliner lets you keep a refreshment or two nearby with its stainless steel cup holders.There is also convenient task lighting and a drop-down table for keeping snack on.Place this power recliner duo in an entertainment room for a contemporary style."}
{"title":"Avonlea 2-piece Upholstered Sloped Arm Living Room Set Off White","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509161-S2_21.jpg","description":"Elegance and glamour combine in this contemporary sofa and loveseat set, featuring a gently curved silhouette with arms that seem to cradle you.Wrapped in a soft white velvet upholstery, each piece's interior is button tufted with glittering rhinestones.Lining the graceful, track-like style arms, and bottom edge of each seat, is bronze nailhead trim for a classic touch.Each furniture piece rests on turned wood legs in a contrasting brown wood finish.Included with both the sofa and loveseat are faux cowhide accent pillows in a silver and gold finish."}
{"title":"Bleker 3-piece Tuxedo Arm Living Room Set Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509481-S3_21.jpg","description":"Featuring a bold blue velvet upholstery, this seating set offers an iconic Chesterfield style design. With low profile seating and button tufted backrests, this sofa set will lend a timeless vibe to any room. Each furniture piece even features classic, individually hammered silver nailheads along each arm's facade and as trimming along the front rail. Tuxedo arms flank each side of a tufted waterfall bench seat, supported and elevated by shiny silver electroplated tapered legs. Constructed of a solid wood frame, each piece in this sofa set is made to last and offers pocket coil seating that offers long-lasting support and comfort for family and guests."}
{"title":"Eastbrook 2-piece Tufted Back Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509111-S2_21.jpg","description":"Glamorous and stylish, this sofa and loveseat offers a formal touch of Hollywood Regency to a home. Both seats and wrapped in a light grey velvet upholstery, nestled by a sleek stainless steel arm and base in a lustrous gold finish. Each piece also offers a shelter style backrest and arms, with a button tufted interior. Each bottom cushion offers a smooth, yet tight waterfall style bench. Included in this set are four matching accent pillows."}
{"title":"Boardmead 3-piece Track Arms Living Room Set Dark Brown","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/506801-S3_21.jpg","description":"With a clean lined silhouette and classic wide track arms, this sofa set is the perfect addition to a transitional style home. Wrapped in a soft and smooth, dark brown top grain leather, its dark hue adds a handsome, bold statement to any living room. Rest comfortably on boxed seats and back cushions, each with top stitching details. Wide solid hardwood legs in a dark black hue elevate and add extra stability to each piece. In addition, the high density foam cushions are both eco-friendly and hypoallergenic, made with a Trillium blend that's makes the perfect seating set for a green home and lifestyle."}
{"title":"Contrary 3-piece Reversible Cushion Living Room Set Charcoal","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509381-S3_21.jpg","description":"This three-piece living room set includes a sofa, loveseat, and armchair, each with thin, sloped track arms and reversible back cushions and seats.Stitched details add a refined, tailored touch.Wrapped in an easily cleanable, dark brown upholstery, this sofa and loveseat is perfect for families with children.Faux feather down cushions can be fluffed to refresh the support of the cushion.In addition, this living room set makes a wonderful addition to practically any home's existing decor with its transitional style."}
{"title":"Boardmead 2-piece Track Arms Living Room Set Dark Brown","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/506801-S2_21.jpg","description":"With a clean lined silhouette and classic wide track arms, this sofa set is the perfect addition to a transitional style home. Wrapped in a soft and smooth, dark brown top grain leather, its dark hue adds a handsome, bold statement to any living room. Rest comfortably on boxed seats and back cushions, each with top stitching details. Wide solid hardwood legs in a dark black hue elevate and add extra stability to each piece. In addition, the high density foam cushions are both eco-friendly and hypoallergenic, made with a Trillium blend that's makes the perfect seating set for a green home and lifestyle."}
{"title":"Drayton 3-piece Flared Arm Upholstered Living Room Set Warm Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509721-S3_21.jpg","description":"Designed with elegantly flared arms and comfy plush seating, this sofa set invite you to sit back and relax. Filled with premium down alternative and foam, this furniture set is built with pocket coil seating to provide long-lasting support and comfort. Plus, each seat and back cushion is wrapped in a warm grey upholstery and is fully reversible, offering easy maintenance. Comfortable boxed seat and back cushions come with top stitching details and offer a total of eight accent pillows, four in a black double sided faux fur and four jacquard pillows. Supported by solid hardwood legs in dark brown finish, each piece is also constructed of a solid wood frame, built for extra stability and made to last."}
{"title":"Chalet 2-piece Tuxedo Arm Living Room Set Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509211-S2_21.jpg","description":"Wrapped in a bold navy blue matte velvet, this sofa and loveseat features shelter back style with vertical, channel tufted interiors.Each piece features a tight waterfall bench seating supported by tapered black metal legs.The arms of each piece roll gently outward, displaying the channel tufting.This set is perfectly suited for a contemporary home that needs a touch of glamour.Its deep, blue tone evokes an elegant nautical vibe, like being on a yacht."}
{"title":"Eastbrook 3-piece Tufted Back Living Room Set Grey","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509111-S3_21.jpg","description":"Elegant above all, this three-piece living room set comes with a sofa, loveseat, and armchair that lend a Hollywood Regency flair.Wrapped in a soft and light grey velvet upholstery, each piece is supported by thin stainless steel braces in a polished, high-gloss gold finish.Each furniture piece also offers a shelter style backrest and arms, as well as button tufted interiors.In addition, each tightly wrapped cushion has a smooth waterfall style bench.Included in this set are four matching accent pillows, two each for the sofa and loveseat."}
{"title":"Destino 6-piece Modular Power Sectional Midnight Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/651551P-S6_10.jpg","description":"Wrapped entirely in a handsome midnight blue upholstery, this six-piece power sectional makes as stunning addition to a living room.With a wide, extra-large chaise recliner, this sectional has reversible full filled cushions wrapped in feather down with cool gel memory foam tops.It also features a wall hugger mechanism so you don't have to worry about space, as well as Bluetooth speakers and stainless steel cup holders.The upholstery is made of a faux linen, which offers a soft place to rest.With sloped, track arms and lumbar side pillows, this sectional invites you to sit back and relax."}
{"title":"Avonlea 3-piece Upholstered Sloped Arm Living Room Set Off White","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/lifestyle/thumbs/509161-S3_21.jpg","description":"Add a glamorous flair to your contemporary home with this three-piece living room set, which includes a sofa, loveseat, and armchair with gently curved silhouettes and arms that invite you to sit with a cocktail.Wrapped in a soft white velvet upholstery, each piece's interior is button tufted with glittering rhinestones.Lining the graceful, track-like style arms, and bottom edge of each seat, is bronze nailhead trim for a classic touch.Each furniture piece rests on turned wood legs in a contrasting brown wood finish.Included with both the sofa and loveseat are faux cowhide accent pillows in a striking silver and gold finish."}
{"title":"Bluefield 6-piece Modular Motion Sectional Charcoal","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/609360PP_1.jpg","description":"Made with six modular pieces, this extra-large motion sectional features a charcoal grey performance faux suede.A center console offers a soft-closing lid and ample storage space, as well as a USB outlet for connecting handheld devices.Keep your refreshments close at hand with the two stainless steel cup holders, removable for easy cleaning.In addition, this sectional offers a cool gel memory foam topper, and optional power headrests.Place this expansive sectional in a large contemporary entertainment room to accommodate the entire family."}
{"title":"Destino 3-piece Modular Power Sectional Midnight Blue","Tags":"Living Room Sets","img":"https://www.coasterfurniture.com/wp-content/uploads/products/silo/thumbs/651551P-S3_11.jpg","description":"Bold midnight blue upholstery wraps this three-piece power sectional, which makes as stunning addition to a living room.With a wide, extra-large chaise, this sectional has reversible full filled cushions wrapped in feather down with cool gel memory foam tops.It also features a wall hugger mechanism so you don't have to worry about space.The upholstery is made of a faux linen, which offers a soft place to rest.With sloped, track arms and lumbar side pillows, this sectional invites you to sit back and relax."}
