{"title":"1505W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLuster Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200819/40/1505W_bedroom__l.jpg","description":"The unique styling of the Luster Collection presents a glamorous option for your bedroom. Embossed faux-wood veneer features a white finish that allows for the acrylic silver glitter fronts of the hidden jewelry drawers to shine. The jewelry drawers feature felt lining to protect your hidden items from wear and tear. The panel headboard features acrylic silver glitter accent banding as well as a silver faux leather channel-padded insert. Polished chrome bar drawer pulls front the drawers providing complementing contrast to the collection’s finish."}
{"title":"1407 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBeddington Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210223/263/14071_HP__l.jpg","description":"The traditional profile of the Beddington Collection pairs classic accent with elegant highlight to create a timeless look for your bedroom. Stylized decorative molding defines the bow-fronted shape of the traditional case pieces and bed, as do the bun feet and picture frame molding that fronts the drawers. The grandly styled bed features an upholstered faux leather button-tufted headboard insert that serves as the focal point of the carvings that frame it. Primavera and ash burl veneer are finished in dark cherry for elegant enhancement of the wood’s grain. Each drawer front is centered by metal and faux crystal knob hardware, an unexpected combination that cements the grandeur of this collection. The nightstand’s top drawer opens to reveal a mounted USB and power port, allowing for convenient access to your electronic devices."}
{"title":"1515 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLoudon Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191223/73/1515_bedroom__l.jpg","description":"The striking design of the Loudon Collection presents as a bold statement of your glamorous inclinations. The champagne metallic finish of the collection shimmers with LED back-lighting the headboard and mirror while additional sparkle comes in the form of the black glass encrusted drawer pulls, embossed diamond pattern of the mindy veneer, mirrored framing and acrylic feet. The top two drawers of the dresser feature hidden jewelry trays. The footboard drawers allow for additional storage space beyond the dresser, chest and nightstand."}
{"title":"1524 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWhiting Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/e124a734881d4b2891155a719fc5378f.jpg","description":"Modern design is given subtle glamorous accent in the design of the Whiting Collection. The bed’s construction allows for convenient packaging, lending to the overall design of the profile. The ultra-low, streamlined profile of the rails and footboard carries over into the design of the accompanying case pieces. Gray tufted linen graces the front of the headboard lending to the dramatic look. Black square hardware boldly fronts each drawer with black base framing lending additional accent to the printed marble-look of the collection."}
{"title":"1509 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJocelyn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/199a4e84f1bc417f95ce6996781def73.jpg","description":"The transitional styling of the Jocelyn Collection is achieved by blending the natural rustic look of wood grain and clean lines to create a unique bedroom group that will fit right in with your home’s aesthetic. The brown hue of the printed faux-wood grain is perfectly complemented by the subtle contrast of the nickel-finished metal fixed drawer pulls. Clipped corners define the profile of each piece in the collection."}
{"title":"1519CH Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSeabright Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/33893efda9284e2bb87e1852b0506705.jpg","description":"Merging traditional and transitional design creates the look of the Seabright Collection, providing a unique platform from which to style your bedroom. The cherry painted finish allows for exceptional versatility of placement and decorative inspiration. The bed features framed, color-coordinated, dual faux leather padded headboard inserts and an ultra-low-profile footboard. The traditional styling of the high polish chrome bale and pull hardware lends to the classic profile."}
{"title":"1400 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMotsinger Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210223/253/14001_HP__l.jpg","description":"Classic accenting is paired with rusticated styling to create the look of the Motsinger Collection. Solid acacia and acacia veneers are finished in a wire-brushed rustic brown, perfectly accenting the wood’s distinct grain. The brown fabric headboard features button tufting and serves as a complementing contrast to the finish of the collection. Bun feet provide support to each piece of the collection. Knob and bar hardware front the drawers of the dresser, chest, and nightstand."}
{"title":"1517 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCordelia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/178190d4a3db4939b63370f51b5f0565.jpg","description":"The soft modern styling of the Cordelia Collection creates a look that is a perfect fit for your bedroom. Black bar and knob hardware play subtly against the espresso finish that graces the okume veneer of the collection. The padded headboard insert is covered with gray linen, which provides decorative accent to the collection."}
{"title":"1534 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCorbin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/abd3a153a086453c8d7bd9397bef2ea1.jpg","description":"Modern lines and rustic styling are paired to create the look of the Corbin Collection. The embossed faux-wood veneer’s texture is highlighted by a rustic brown finish for a realistic wood look. Providing complementing contrast, the drawer fronts of the dresser, chest and nightstand feature black metal hardware. Subtle framing defines the profile of the headboard and footboard, further lending to the unfettered design of the collection."}
{"title":"1522 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBijou Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191126/219/1522_bedroom__l.jpg","description":"Dramatic from every angle, the Bijou Collection presents as a glamorous statement to the décor of your boudoir. The unique profile of the bed features a V-notch design that serves as not only as a focal point, but as inspiration for the woven pattern that fronts each piece of the collection. The back-lit faux leather headboard insert is featured in a champagne tone that perfectly complements the champagne finish of the collection. The mirrored framing of each piece provides subtle reflection and distinct accent. The drawers of the storage footboard, dresser, mirror, chest and vanity are fronted with triangle-shaped polished chrome hardware. The dresser and available vanity feature hidden jewelry box drawers allowing for the discrete storage of your personal accessories. The vanity also has jewelry hooks mounted on the back of the mirror as well as drawers, center glass top and coordinating stool."}
{"title":"1518 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDanridge Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/dc5061621fd64d3bac3914c47d712b77.jpg","description":"Rustic style is paired with modern accent to create the bold look of the Danridge Collection. Embossed faux wood veneer presents a realistic wood-look with brown and espresso blending to create the two-tone finish. Antiqued brass finish hardware fronts the drawers while LED backlights the headboard of the collection, softly illuminating the tufted, brown fabric insert."}
{"title":"1526 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBainbridge Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20201125/9d3449b710034eeda2a567af71269d32.jpg","description":"Following the trend of rusticated simplicity is the Bainbridge Collection. Melamine laminate perfectly mimics the look of weathered gray wood, lending to the rustic style. The transitional framing of the collection allows for placement in myriad bedroom settings, creating the perfect canvas for your preferred decorative style. Black metal bar hardware fronts the drawers of the nightstand, dresser, mirror, chest and storage footboard, providing complementing contrast to the gray finish."}
{"title":"1505 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLuster Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/898e2c1f996d49198a2343c474585f76.jpg","description":"The unique styling of the Luster Collection presents a glamorous option for your bedroom. Embossed faux-wood veneer features a gray finish that allows for the acrylic silver glitter fronts of the hidden jewelry drawers to shine. The jewelry drawers feature felt lining to protect your hidden items from wear and tear. The panel headboard features acrylic silver glitter accent banding as well as a gray faux leather channel-padded insert. Polished chrome bar drawer pulls front the drawers providing complementing contrast to the collection’s finish."}
{"title":"1519GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSeabright Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/180798011e744c98ad80b89416e9bfab.jpg","description":"Merging traditional and transitional design creates the look of the Seabright Collection, providing a unique platform from which to style your bedroom. The gray painted finish allows for exceptional versatility of placement and decorative inspiration. The bed features framed, color-coordinated, dual faux leather padded headboard inserts and an ultra-low-profile footboard. The traditional styling of the high polish chrome bale and pull hardware lends to the classic profile."}
{"title":"1571DZ Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBethany Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200724/8342f356ecb4450ca9edb565ca8e886a.jpg","description":"Classic lines and accenting provide a timeless look to the design of the Bethany Collection. The metal bed’s dark bronze finish lends unique character to the design of your bedroom. The rounded profile of the bed is paired with traditional accent joints, creating a bed with myriad decorative possibilities."}
{"title":"1570GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAnson Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200819/249/1570GY_bedroom__l.jpg","description":"The clean lines of the Anson Collection lend distinct style to the modern look of your bedroom’s décor. The neutral gray fabric of the upholstered bed allows the perfect palette to decorate your space. The channel-tufted headboard further lends to the modern profile of low-profile platform bed."}
{"title":"1549BE Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCrofton Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/9aea520a4a014ddfb0f3626011937a83.jpg","description":"The traditional styling of the Crofton Collection serves as a classic addition to your home’s décor. The optional beige or gray covering of this fully upholstered sleigh bed is accented with button tufting, nailhead accent and rolled profile, creating a neutral canvas for your decorative inclinations."}
{"title":"1547 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGlenbury Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200924/89/1547_bedroom__l.jpg","description":"The stately profile of the Glenbury Collection will provide a dramatic statement to the design of your bedroom. The fully upholstered bed features pleated dark gray velvet covering and mansion shelter headboard, creating a modern traditional look that defines your personal style."}
{"title":"1571BU Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBethany Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200724/cfceec89d98747febf3984559df20adf.jpg","description":"Classic lines and accenting provide a timeless look to the design of the Bethany Collection. The metal bed’s blue finish lends unique character to the design of your bedroom. The rounded profile of the bed is paired with traditional accent joints, creating a bed with myriad decorative possibilities."}
{"title":"1549GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCrofton Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/0f4a489915e347aabcdeb7a72c5a9384.jpg","description":"The traditional styling of the Crofton Collection serves as a classic addition to your home’s décor. The optional beige or gray covering of this fully upholstered sleigh bed is accented with button tufting, nailhead accent and rolled profile, creating a neutral canvas for your decorative inclinations."}
{"title":"1571RN Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBethany Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200724/0963b5feb84a49d9bb5a09973bb9904f.jpg","description":"Classic lines and accenting provide a timeless look to the design of the Bethany Collection. The metal bed’s orange finish lends unique character to the design of your bedroom. The rounded profile of the bed is paired with traditional accent joints, creating a bed with myriad decorative possibilities."}
{"title":"1553 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosemont Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/3d46dee561454ee98b925a15ffe95ad2.jpg","description":"The modern design of the Rosemont Collection creates a striking profile for your bedroom. The midnight blue finish is reflected by the chrome banding that defines the front of each piece in the collection. The bookcase headboard and storage footboard proved additional functional storage space beyond the available dresser, chest and night stand. Chrome pull hardware fronts each of the raised drawer fronts."}
{"title":"1519BK Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSeabright Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/1025e33b3d68415898d25de29ec7e99c.jpg","description":"Merging traditional and transitional design creates the look of the Seabright Collection, providing a unique platform from which to style your bedroom. The black painted finish allows for exceptional versatility of placement and decorative inspiration. The bed features framed, color-coordinated, dual faux leather padded headboard inserts and an ultra-low-profile footboard. The traditional styling of the high polish chrome bale and pull hardware lends to the classic profile."}
{"title":"1525 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nQuinby Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200923/997738cd982949e6b1bf5b0317655f9a.jpg","description":"The modern styling of the Quinby Collection is achieved by blending the natural look of wood grain and the clean lines of contemporary design to create a unique bedroom group that will fit right in with your home’s aesthetic. The embossed faux wood grain of the collection is perfectly complemented by the subtle contrast of the nickel finished metal fixed drawer pulls and the defining lines of the headboard and footboard’s routed framing."}
{"title":"1519WH Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSeabright Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210120/584/1519WH_bedroom__l.jpg","description":"Merging traditional and transitional design creates the look of the Seabright Collection, providing a unique platform from which to style your bedroom. The white painted finish allows for exceptional versatility of placement and decorative inspiration. The bed features framed, color-coordinated, dual faux leather padded headboard inserts and an ultra-low-profile footboard. The traditional styling of the high polish chrome bale and pull hardware lends to the classic profile."}
{"title":"1536 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGrant Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/5d0793fa041c43198087916c653f87f9.jpg","description":"The Grant Collection features a streamlined profile and visual complementing contrast, with the resulting design being a perfect fit for your modern home. An ebony finish is utilized over oak veneer, highlighting the distinct grain, with silver finished banding defining the fronts of each piece in the collection. Hidden, under-drawer finger pulls further the minimalistic look of the collection."}
{"title":"1555 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nScarlett Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/73376e4f4c454ed6b409226fe6f2ea3e.jpg","description":"The elegant modern profile of the Scarlett Collection will be the perfect addition to your bedroom. Cashew solid wood and mindy veneer is finished in a brownish gray with gold finished hardware and accent banding lending subtle contrast to the profile of the collection. The headboard features LED backlighting, enhancing the gray fabric headboard insert."}
{"title":"1535 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAziel Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/5781c61e96ee4fb58dade64bfc0946ef.jpg","description":"The modern styling of the Aziel Collection features geometrical accent to present a bold profile perfect for the sophisticated look you wish to achieve in your bedroom. Walnut veneer is highlighted by walnut finish, light reflecting the wood’s grain with each angle change of the decorative fronts. The drawer feature satin brass finished bar hardware that perfectly complement the design of the collection."}
{"title":"1566GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWest End Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210202/54/1566GY_bedroom__l.jpg","description":"Modern styling is achieved by pairing classic design elements with eye-catching bold lines culminating in the chic look of the West End Collection. Painted silver accent subtly frames the diamond-patterned gray faux leather fronts of the case pieces and bed, each providing complementing contrast to the gray wire-brushed finish of the collection’s birch veneer. Square nickel finished hardware fronts each drawer, furthering the modern look of the West End Collection."}
{"title":"1568 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMossbrook Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/d2b98bc149c04c7ba49a82df6f873bd0.jpg","description":"In nod to modern farmhouse design, the Mossbrook Collection features a classic profile that will be a perfect addition to your home’s décor. The pine solids and oak veneer of the collection feature a light gray finish, subtly highlighting the wood’s grain. The dark brown tops of the dresser, chest and nightstand provide contrast, as do the metal knobs that front the drawers. The vertical slats of the low-post bed lend classic styling to the collection, their heights following the curved profile of the headboard and footboard, each corner topped with a turned finial."}
{"title":"1572BK Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSalon Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200819/159/1572BK_bedroom__l.jpg","description":"Glamour abounds with the addition of the Salon Collection to your bedroom. The black pearlescent finish is enhanced by the silver glitter trim that frames each piece in the collection. The bed’s headboard features a padded faux leather insert that is accented by faux crystal button-tufting and LED-backlighting, that serves as the centerpiece of this sparkling collection. The dresser, nightstand and chest feature faux-crystal chrome bar hardware pulls."}
{"title":"1572W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSalon Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200819/162/1572W_bedroom__l.jpg","description":"Glamour abounds with the addition of the Salon Collection to your bedroom. The white pearlescent finish is enhanced by the silver glitter trim that frames each piece in the collection. The bed’s headboard features a padded faux leather insert that is accented by faux crystal button-tufting and LED-backlighting, that serves as the centerpiece of this sparkling collection. The dresser, nightstand and chest feature faux-crystal chrome bar hardware pulls."}
{"title":"1534GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCorbin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210311/22/1534GY_bedroom__l.jpg","description":"Modern lines and rustic styling are paired to create the look of the Corbin Collection. The 3D printed paper veneer’s texture is highlighted by a gray finish for a realistic wood look. Providing complementing contrast, the drawer fronts of the dresser, chest and nightstand feature black metal hardware. Subtle framing defines the profile of the headboard and footboard, further lending to the unfettered design of the collection."}
{"title":"1556W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLana Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200816/d868d53b9b0a4dddbf2972f4c3b66df7.jpg","description":"The unexpected intersection of traditional design and glamorous styling creates a dynamic look perfect for your bedroom. A white finish utilized to enhance the faux alligator embossed fronts of the bed and coordinating case pieces. The headboard features a faux leather crystal-tufted headboard as well as dramatic LED backlighting. Crystal faceted knob hardware fronts each alligator embossed drawer front. The nightstand, dresser, and chest each feature hidden storage allowing for the discrete placement of your personal affects."}
{"title":"1546 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nColchester Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/9b5ce5daa9644e68b6b758a95d77c036.jpg","description":"In the Colchester Collection, a modern take on traditional design creates an elegant profile for your bedroom’s décor. The driftwood gray finish of the collection is complemented by the gray fabric and nailhead accent of the headboard and footboard, with silver finished hardware providing complementing contrast to the fronts of the case pieces. Framed drawer fronts and picture frame molding further the classic look of the collection. The available vanity features tri-fold mirror, glass top, drawer units and jewelry hooks on the back of the side mirrors."}
{"title":"1559 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLogandale Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/314190b201be4b00a517c8f99d4e1a25.jpg","description":"The transitional framing of the Logandale Collection allows for versatile placement within a number of classic bedroom decors, making a perfect choice for your home. A brown finish is utilized over mango veneer for subtle highlighting of its distinct grain. A total of 6 drawer units are located on the side rails and footboard, creating additional storage space within your bedroom, beyond the traditional dresser, chest, nightstand and wardrobe chest. The sleigh headboard is paired with a platform footboard resulting in an unfettered design."}
