{"title":"5789N Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBaldwyn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20201213/165/5789N_bedroom__l.jpg","description":"A rolled and tufted headboard provides elegant touches to the casual Baldwyn Collection. Offered in dark gray fabric, this bed offers not only flexible placement, but the opportunity to style the room to fit your needs."}
{"title":"5877BE Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20181205/667281650c794fd39ac39cac82f1e2eb.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional look that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5877BR-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20180202/5877BR_DW_9170_l.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional look that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5877GY-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20181205/951ebe53c30f4f3ba1813ffae2406ed3.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional\nlook that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5442 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVermillion Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/43eae2c0588649dcbee6e8b6a5ccabf9.jpg","description":"Designed for the modern traditional home, the Vermillion Collection is a light and airy take on the themes of classic style and refined elegance. Enhancing the distinct grain of oak veneer is a subtle gray cashmere finish."}
{"title":"5877GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20181205/8af8e51749fd4aedae90333a719b94ed.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional look that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5877BE-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20181205/34527ad0e9c548e38a60639df6f2b9fb.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional look that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5438 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nToulon Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191018/171/5438_bedroom__l.jpg","description":"Classic framing provides elegant contrast to the unique rustic look of the Toulon Collection. Distressed dark oak finish provides texture to the acacia veneer of this lovely bedroom suite. The functional drawers of the footboard allow for additional storage. The French provincial inspired routing lends decorative touch to each piece, while dual drawer and door storage are accented with wide set horizontal metal and wood hardware providing ample space to store your personal possessions."}
{"title":"5790 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nZoey Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20171106/5790-1_135_l.jpg","description":"Make a statement in your bedroom with the Zoey Collection platform bed. This dramatic bed is covered with dark brown faux leather, matching night stand is also available."}
{"title":"4982 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBlanchard Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210302/8/4982_bedroom__l.jpg","description":"The Blanchard Collection is styled with traditional elements that are perfect fit for your bedroom’s decorative aesthetic. The metal bed features a mottled silver finish, its rounded profile paired with traditional accent joints and metal back panel, each design element lending to the bed’s classic look."}
{"title":"5877BR Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFairborn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20180202/5877BR-1_9168_l.jpg","description":"The stately profile of the Fairborn Collection will lend an air of understated elegance to your bedroom. The mansion headboard features nailhead accent and button tufting creating a modern traditional look that defines your personal style. Providing additional function to the bed is the footboard which extends to expose drawer space to meet your additional storage needs. The bed is offered in one of three fabric coverings – Beige, Brown and Gray."}
{"title":"5874GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarlow Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/38a1e247d99d46a2bbc70307c8edebfe.jpg","description":"Modern traditional styling is achieved with the design of the Carlow Collection. The profile of the camelback headboard is accented with nailhead furthering the traditional look. The bed is covered with gray velvet fabric."}
{"title":"5424 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLarchmont Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/8f735c643ac7426cb088d548924786ab.jpg","description":"The striking profile of the Larchmont Collection is an intersection of texture, material and style. The charcoal upholstered bed, that centers the collection, features pin-tucked button tufting and nail head accent. Dark glass tops night stand and dresser for subtle reflection and textural interest. Prominent horizontal metal hardware is mounted on each drawer front, and is finished to complement the tone of the charcoal finish over ash veneer. The night stand open concept of the drawer features not only the aforementioned glass top, but also underside LED lighting and power strip – with USB port - for the ultimate modern touch."}
{"title":"1642 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nToddrick Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/dad1162eb355422fbfaab0503b6b8050.jpg","description":"The distinct camelback headboard of the Toddrick Collection provides an elegant focal point for your bedroom. With styling that lends to placement in modern traditional environments, the upholstered bed’s profile is defined by nailhead trim, features button-tufting and is covered in gray linen-like fabric for neutral accent to your bedroom’s decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"2615DC Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMarston Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191119/380/2615DC_bedroom__l.jpg","description":"Refined elegance is exemplified in the design of the Marston Collection. Blending classic design elements to create a warm and welcoming bedroom. Each piece in the collection features turned feet and high polished cup pull and knob hardware. The neutral toned fabric inserts of the headboard and the padded footboard rail feature nailhead accent. Drawer storage features prominently on the footboard, offering that extra functional space that you need. The classic dark cherry finish further lends to the modern traditional look of the Marston Collection."}
{"title":"1632GH-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAitana Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200924/26a8845bc6d349c99c46b184f3ff688c.jpg","description":"The streamlined design of the Aitana Collection provides a functional focal point for your bedroom. With styling that lends to placement in modern environments, the upholstered bed’s profile is defined by its low-profile and graphite-hued linen-like fabric for neutral accent to your bedroom’s modern decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"1575 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHodgin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210223/500/15751_HP__l.jpg","description":"Subtle modern styling creates a versatile look for your bedroom with the addition of the Hodgin Collection. Unfettered lines comprise the bedroom’s profile with each case piece featuring bow fronts that lend to the refined look. Dark charcoal finish is utilized over quarter cut ash veneer, highlighting the wood’s grain. The dresser, nightstand and chest drawers are fronted with contoured bar hardware. The padded panel headboard insert features a neutral tone fabric, providing complementing contrast to the collection."}
{"title":"1632GH Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAitana Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200924/5290d60db0054e5f9123a6b7e0675b97.jpg","description":"The streamlined design of the Aitana Collection provides a functional focal point for your bedroom. With styling that lends to placement in modern environments, the upholstered bed’s profile is defined by its low-profile and graphite-hued linen-like fabric for neutral accent to your bedroom’s modern decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"1675 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBlaire Farm Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210524/8/1675_bedroom__l.jpg","description":"The transitional styling of the Blaire Farm Collection serves as the perfect complement to the rustic aesthetic that inspired the design. The okume veneer is enhanced by the charcoal gray finish that covers the collection. Fixed handle pull hardware fronts the drawers while horizontal accent at the top of the headboard and the top drawers of each case piece lends visual contrast."}
{"title":"1626GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWeaver Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200916/ef38b00b791a4e6198e10e863473f40f.jpg","description":"Transitional-rustic styling is expertly achieved in the design of the Weaver Collection. Antique gray provides bold contrast to the coffee-hued plank-style tops, with pine solids and oak veneer further lending visual texture to the bedroom. Classic framing paired with dark metal knob hardware complete the rustic look."}
{"title":"1624W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBaylesford Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/ef9a295bff1344c989ad66ac8cba9d29.jpg","description":"Soft, sweeping curves define the elegant profile of the Baylesford Collection. The bedroom is softened by an antique white rub-through finish with brown-gray finished framed-plank case good tops, creating a romantic aesthetic will place beautifully within your bedroom. Dark gray pleated, button-tufted fabric provides stunning contrast to the look of the bed, while dark finished metal knob hardware provides complementing contrast."}
{"title":"1647 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBolingbrook Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/8bc392c9154449cfb8807c5df36f01af.jpg","description":"Rustic styling intersects with traditional lines in the design of the Bolingbrook Collection. The charcoal finish over pine solids and engineered pine veneer creates a warm complement to the elegantly framed case pieces and platform storage bed. Providing subtle contrast the groups finish is the button tufted neutral tone fabric headboard insert. Knob hardware subtly accents the drawer fronts."}
{"title":"1577 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nZephyr Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210224/41/157712015774P_HP__l.jpg","description":"The sleek design of the Zephyr Collection pairs clean lines with modern convenience to create a style that will be the perfect palette for your design aspirations. The nightstands flank the low-profile bed, creating a wall-paralleling seamless transition between the pieces. The optional nightstand wall panel features touch-engaged LED under-lighting, providing\nconvenient illumination for your bedroom. Visually tying the collection together are the painted metal-finish banding of the headboard’s sides and the case piece’s base rails, as well as the metal bar hardware that fronts each drawer, culminating in an accenting contrast to the gray faux wood\nfinish of the melamine veneer."}
{"title":"1638 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLarkspur Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/775b8625c8cf47ea98fbe629c7b32cd9.jpg","description":"With a design that speaks to your love of vintage styling, the Larkspur Collection helps you to achieve the timeless aesthetic you wish to present in your bedroom. Classic elements, such as ball accents on the vertical rods of the headboard and footboard, and the bed’s curved profile, are finished in an antique bronze serving as an effective statement on the traditional look."}
{"title":"1677 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArcadia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190916/99bf151834a9420295a36f76f1c6826c.jpg","description":"Designed for your transitionally styled bedroom is the Arcadia\nCollection. The two-tone look of the group is achieved with white\nframing and variegated gray printed faux-wood grain veneer.\nDark hardware lends visual contrast to the classic case goods. The\ncollection offers the bed in California King, Eastern King, Queen,\nFull and Twin for perfect placement within your available space."}
{"title":"1573 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWittenberry Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210223/431/157320bedroom__l.jpg","description":"Modern convenience is paired with transitional style to create the versatile look of the Wittenberry Collection. The multi-functional design of the bed allows for convenient storage within the footboard drawers, charging capability by way of the mounted USB ports, as well as display and illumination within the touch-engaged LED-lit open fronted bookshelves of the headboard. The bed’s headboard also features pebble gray hued fabric inserts creating complementing contrast to the collections gray finish over okume veneer.  Dark bronze finished knob and bar hardware front the drawers of the collection."}
{"title":"1601 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEngleside Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210302/1/1601_bedroom__l.jpg","description":"Graceful lines pair with vintage styling to create the timeless look of the Engleside Collection. The gunmetal finish of the metal-famed bed serves as a neutral palette to your decorative preferences. Traditional jointing lends visual contrast to the intersection of curves and straight lines that comprise the framing of the platform bed. The collection is offered in Queen, Full and Twin Sizes."}
{"title":"1682 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHeath Court Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/4ff45afa06934c61bfb5bd93643124c1.jpg","description":"The elegant profile of the Heath Court Collection is comprised of\nclassic elements that have been combined to create the perfect\naddition to your home’s traditional décor. The formal styling of\nthe bedroom includes classic elements such routed edges and\ndecorative wood grain. The neutral hued brown button tufted\nfabric of the headboard sets the tone for the refined presentation\nof the wood framing of the bed. The white oak veneer that graces\nthe collection is highlighted with a brown oak finish."}
{"title":"1639 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWaterlyn Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/f91db977895e4e4ca3b1027432e07403.jpg","description":"Modern traditional framing is utilized to create the look of the Waterlyn Collection. The high wing-back design of the fully upholstered bed features neutral toned fabric accented with profile-defining nail head trim and pleated button tufting, solidifying the traditional look of this bed offering."}
{"title":"1584 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBrevard Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210224/134/15841_HP__l.jpg","description":"A perfect intersection of rustic and transitional aesthetics, the Brevard Collection’s versatile design allows for placement in myriad bedroom settings. The light finish that graces the birch veneer creates a neutral palette from which your decorative creativity will shine. Finial topped posts frame the vertical slats of the bed’s design. Knob and bar hardware front the drawers of the tall dresser, chest and nightstand, the dark metal finish providing contrast to the collection’s finish."}
{"title":"1648 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nParnell Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/95daaa5dda3741468ecce993372e0ec8.jpg","description":"Inspired by the aesthetic of modern-rustic design, the Parnell Collection utilized bold enhancement to create the perfect addition to your bedroom. V-matched planks draw immediate attention to their visually stunning shape and the rustic cherry finish over acacia veneers that defines the\ncollection. Mounted at the top of each drawer are antiqued finished pull hardware that enhance the rustic vision of this bedroom collection. Bold, yet understated, framing defines the collection’s modern profile."}
{"title":"1642-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nToddrick Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/b98816fb05f4461d936375c2006f4a0c.jpg","description":"The distinct camelback headboard of the Toddrick Collection provides an elegant focal point for your bedroom. With styling that lends to placement in modern traditional environments, the upholstered bed’s profile is defined by nailhead trim, features button-tufting and is covered in gray linen-like fabric for neutral accent to your bedroom’s decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"1631 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nQuantum Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20211115/30/1631_bedroom__l.jpg","description":"Minimalistic styling is the defining line of the Quantum Collection, creating the perfect canvas to complete your decorative vision. Dark gray textured fabric upholstery fully covers the low-profile bed, further complementing the stylistic versatility of the collection."}
{"title":"1632-DW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAitana Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210120/517/1632DW_bedroom__l.jpg","description":"The streamlined design of the Aitana Collection provides a functional focal point for your bedroom. With styling that lends to placement in modern environments, the upholstered bed’s profile is defined by its low-profile and gray linen-like fabric for neutral accent to your bedroom’s modern decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"1604 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nUrbanite Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200427/a3a62181a48746e7add96570b57ef0c8.jpg","description":"Perched atop metal legs, creating a dramatic statement of contemporary styling, the Urbanite Collection is a perfect reflection of your modern style preference. The solid acacia wood with acacia veneer is highlighted by a 3-tone gray finish that allows the variance of the natural grain to shine. The horizontal slat design as well as metal pull tab hardware lend to the clean, contemporary look of the collection."}
{"title":"1632 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAitana Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210120/516/1632_bedroom__l.jpg","description":"The streamlined design of the Aitana Collection provides a functional focal point for your bedroom. With styling that lends to placement in modern environments, the upholstered bed’s profile is defined by its low-profile and gray linen-like fabric for neutral accent to your bedroom’s modern decor. The platform bed’s low-profile footboard is offered in two configurations, either conveniently opening to reveal a storage drawer, providing functional space to store your essentials, or as a stationary unit."}
{"title":"1689 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190522/0a6a8bd88e8d4aa7a61e9d93f7c76c97.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your home. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a rich finish – driftwood charcoal over acacia solids and veneers – creates a collection that is worthy of your bedroom. Pewter finished hardware provides a subtle contrast to the wood’s dark finish. Providing ample storage space are the available dresser,  nightstand, chest and functional wardrobe chest. The complementing mirror features subtle framing for understated accent."}
{"title":"1603 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRoyal Highlands Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20180202/1603-1_9351_l.jpg","description":"Grandly styled for the traditional home is the Royal Highlands Collection. Prominent decorative scrolling adorns the headboard while heavier, carved scrolling accents the pilasters and feet of each piece in the collection. The substantial wood framing of the bed creates a distinct serpentine profile that carries into the design of the case pieces. Brown faux leather provides complementing contrast to the rich cherry finish. Traditional cherry and birch veneers accenting furthers the elegant presentation of the Royal Highlands Collection."}
{"title":"1614SL Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWillowick Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/77adbccd4ba24c65af1994b83857887b.jpg","description":"Inspired by the look of French Provincial styling, the Willowick Collection lends an air of classical romanticism to your opulent bedroom. Bold curves, elegant framing and the lightly distressed finish create eye-catching drama while antiqued hardware and turned feet are the decorative accouterment that ties the look together. Subtle rub-though of the antique white finish reveals gray undertones, that when paired with brown cherry finished tops, serves to highlight the poplar solids, along with the ash veneer. The dramatic sleigh bed, with button-tufted neutral tone linen headboard insert."}
{"title":"1669 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGriggs Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/6c001698c3d341458ff36038a5a31e46.jpg","description":"The contemporary styling of the Griggs Collection will be the perfect addition to your bedroom. The prominent ash veneer over acacia solids features a dark brown finish lending to the modern appearance. X-framing tops the headboard and understated lines of the panel bed. Fixed drawer pulls center each case piece further lending to the soft modern look."}
{"title":"1614 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWillowick Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/aed0c3597e0d48a6b790e65918872911.jpg","description":"Inspired by the look of French Provincial styling, the Willowick Collection lends an air of classical romanticism to your opulent bedroom. Bold curves, elegant framing and the lightly distressed finish create eye-catching drama while antiqued hardware and turned feet are the decorative accouterment that ties the look together. Subtle rub-though of the antique white finish reveals gray undertones, that when paired with brown cherry finished tops, serves to highlight the poplar solids, along with the ash veneer. The wood panel bed with button-tufted neutral tone linen headboard insert."}
{"title":"1689BR Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200709/368bbfe934d64c75bd45a79e85054cd4.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your home. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a light finish – brown wood over acacia solids and veneers – creates a collection that is worthy of your bedroom. Pewter finished hardware provides a subtle contrast to the wood’s light finish. Providing ample storage space are the available dresser, nightstand, chest and functional wardrobe chest. The complementing mirror features subtle\nframing for understated accent."}
{"title":"1626 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWeaver Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/d0b5730362844f59ad75a9a71f25be7f.jpg","description":"Transitional-rustic styling is expertly achieved in the design of the Weaver Collection. Antique white provides bold contrast to the rosy brown plank-style tops, with pine solids and oak veneer further lending visual texture to the bedroom. Classic framing paired with dark metal knob hardware complete the rustic look."}
{"title":"1645 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDavi Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200726/667feae8560a4581a255e8733140d424.jpg","description":"The modern styling of the Davi Collection is achieved by blending the natural look of wood grain and the clean lines of contemporary design to create a unique bedroom group that will fit right in with your home’s aesthetic. The defining lines of the distinct framing of the collection effectively accent the printed wood grain on melamine veneer. Providing complementing contrast are the nickel-finished, metal, fixed drawer pulls."}
{"title":"1675W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBlaire Farm Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200820/380/1675W_bedroom__l.jpg","description":"The transitional styling of the Blaire Farm Collection serves as the perfect complement to the rustic aesthetic that inspired the design. Fixed handle pull hardware fronts the drawers while horizontal accent at the top of the headboard and the top drawers of each case piece lends visual contrast. The white finish that covers the collection lends to a versatile look sure to be a perfect fit in your home."}
{"title":"1762 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMiter Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210712/25/1762_bedroom__l.jpg","description":"The Miter Collection combines the clean lines of contemporary styling with the look of natural wood grain in this stylish bedroom suite.  Embossed faux-wood veneer is utilized in both mahogany and ebony to achieve a 2-tone contrasted finish. Antique brass tone hardware provides additional contrast to the printed wood grain. Drawers are featured on the footboard creating the extra storage space."}
{"title":"1616 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTamsin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190717/51443429407a4ba4a7885b78b246dc34.jpg","description":"Designed to help your bedroom reach its full glamorous potential, the Tamsin Collection’s unique attributes blend to create a stylish and functional addition to your lifestyle. Mirrored framing provides dramatic enhancement to each piece in the collection, while LED back-lighting, from the vertical headboard panels and mirror, illuminates and highlights the silver-grey metallic finish of the collection. Acrylic hardware provides unobtrusive decorative touch to the drawer fronts of the case pieces and storage footboard, with the metallic silver faux leather-covered padded headboard insert lending decorative contrast to the finish of the collection. Hidden jewelry drawers in the dresser create discrete storage space for your fancy accoutrements. Also providing functional display to the collection is the available vanity. The mirrored front paired with drawer storage creates the perfect platform to prepare your glamorous self."}
{"title":"1678W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKerren Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190627/41/1678W_bedroom20set__l.jpg","description":"The visually stunning Kerren Collection is a modern study on line and light. LED enhances the front side of each case piece and top rail of the bed. Providing additional eye-catching drama is the white opalescent\nfaux leather headboard, shimmering in the glow of the LED light. The door dresser provides ample space for storage alongside the nightstand and chest."}
{"title":"1616W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTamsin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190930/97/1616W_bedroom__l.jpg","description":"Designed to help your bedroom reach its full glamorous potential, the Tamsin Collection’s unique attributes blend to create a stylish and functional addition to your lifestyle. Mirrored framing provides dramatic enhancement to each piece in the collection, while LED back-lighting, from the vertical headboard panels and mirror, illuminates and highlights the white finish of the collection. Acrylic hardware provides unobtrusive decorative touch  to the drawer fronts of the case pieces and storage footboard, with the faux leather-covered padded headboard insert lending decorative contrast to the finish of the collection. Hidden jewelry drawers in the dresser create discrete storage space for your fancy accoutrements. Also providing functional display to the collection is the available vanity. The mirrored front paired with drawer storage creates the perfect platform to prepare your glamorous self."}
{"title":"1649 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFrazier Park Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/7902cdfb686d4b5497e3c4d7fa7756a9.jpg","description":"With a subtle lodge look that takes inspiration from design history, the classic styling of the Frazier Park Collection will help you create a bedroom environment that is a reflection of your preference for traditional spaces. The brown cherry finish that highlights the mindy veneer provides rich character to the wood’s grain. Cut away detail on the bed and case goods provides a visual break the transitional lines of the collection. The platform bed provides additional space beyond the case pieces for storage of your personal items. Knob and pull hardware front the drawers lending\nsubtle contrast to the collection’s finish."}
{"title":"1714BK Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaurelin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200121/73984188c6174e87814ed017b9767da8.jpg","description":"Casual transitional styling lends versatility to the placement of the Laurelin Collection in a number of bedroom settings. The black sand-through finish creates a versatile look allowing for placement of the collection in traditional to country casual environments. Antiqued bronze knob hardware punctuates the look of each framed drawer front, providing complementing accent. Hidden drawers in the nightstand and dresser provide discrete storage for your valuables, while the storage drawers of the footboard provide a more visible means of additional storage capability. Bun feet support the case goods and a sleigh headboard finish off the transitional design of the collection."}
{"title":"1758 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHosta Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/c3055abc679e4735991b9f70fcfe1de2.jpg","description":"Inspired by vintage design, ball finials top the canopy frame while prominent decorative jointing and classic quatrefoil pattern lend to the modern traditional look of the Hosta Collection. The built-in platform support allows for the use of a mattress without a box spring. The Hosta collection is offered in twin and queen size bed options for versatile placement within your home."}
{"title":"1759 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRapa Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/a8da5908866248e284ead7cb8b94e18a.jpg","description":"Double x-framing provides distinct decorative accenting to the\nheadboard and footboard of the Rapa Collection. Unadorned canopy\nframing creates a clean and sophisticated look, with medallion\naccents lending to the modern traditional feel of the Rapa Collection’s\ndesign. The built-in platform support allows for the use of a mattress\nwithout a box spring. The Rapa collection is offered in twin and\nqueen size bed options for versatile placement within your home."}
{"title":"1896N Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nChasin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/203b5d81782e47e8bcc29d80131e7c40.jpg","description":"At home in a number of room settings, the Chasin Collection is styled to fit your needs. With an unfettered design in a neutral gray tone fabric, the bed will be the perfect platform for your restful sleep."}
{"title":"1761 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nChelone Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/6c31783e8190471396ab96b7f280d0bb.jpg","description":"Styled for the modern traditional home, ball finials top the canopy\nframe with prominent decorative jointing providing eye-catching\naccent to the modern traditional look of the Chelone Collection. The\nbuilt-in platform support allows for the use of a mattress without a\nbox spring. The Chelone collection is offered in twin and queen size\nbed options for versatile placement within your home."}
{"title":"1757 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCavalier Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/20180202/1757-1_9228_l.jpg","description":"The Cavalier Collection exemplifies the finest in Old World European design inspiration. Egg and dart base moldings, bead molding, acanthus leaf carvings, and genuine marble inset tops all blend to achieve an elegant addition for your traditional home. The grand sleigh bed features a faux leather, button-tufted headboard insert. Each of the collection’s beautiful detail is accented by the dark cherry finish on birch veneers with gold highlights."}
{"title":"1860 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRemy Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200819/270/1860_bedroom__l.jpg","description":"The knife edge profile of the Remy Collection cuts a modern look for your bedroom’s décor. The concave curve of the low-profile platform bed’s headboard is accented with button tufting and a grey fabric cover. Black metal legs provide support to the bed while offering subtle complementing contrast to the overall design of the piece."}
{"title":"1718GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBegonia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/2b28fc86efa34c6cbc1561fba0a1901e.jpg","description":"Casual transitional styling lends versatility to the placement of the Begonia Collection in a number of bedroom settings. The grayish brown finish lends distinctly to the execution of different looks from traditional to country casual, with knob hardware punctuating the look of each framed drawer front. Hidden drawers in the nightstand and dresser provide discrete storage for your valuables, while the storage drawers of the footboard provide a more visible means of additional storage capability. Bun feet support the case goods and a sleigh headboard finish off the transitional design of the collection."}
{"title":"1856 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAbbeville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191121/21532bc916fd4b24aa048e77d03f1726.jpg","description":"The ever popular Louis Philippe style is updated with functional accoutrements in the Abbeville Collection. Button and bale hardware grace the drawer fronts of each piece in the collection, while unbeknownst to the casual observer, there is hidden drawer storage on the nightstand, dresser and chest – each easily accessible with a pull of the front top frame. The sleigh bed furthers the timeless look of this adult collection, as well as youth. Okume veneers are elegantly highlighted with a traditional brown cherry finish."}
{"title":"1753 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nChesky Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/07bac32d4d54458984471930810bd127.jpg","description":"Contemporary design and convenient functionality intersect in the design of the Chesky Collection. Birch veneer is finished in a warm espresso in this unique bedroom offering. Raised panels provide visual interest to the drawer fronts, headboard and footboard. The bookcase headboard provides ample storage and display space as does the storage drawer footboard. Complementing horizontal metal hardware lend additional accent to the case pieces."}
{"title":"1844DC Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEunice Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/2cd1e5f8cffb465886aec4b8ad9a8440.jpg","description":"Traditional aesthetic doesn’t always have to be grand in scale or accent to achieve a timeless look. The Eunice Collection takes the form of traditional case pieces and utilizes an espresso finish and understated knob hardware to create bedrooms style that can range from transitional to cottage. Recessed framing carries over from the design of the headboard to the drawer fronts of the case pieces and storage footboard."}
{"title":"1903 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNashville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/cab506f0dec64cd5a1c5ef606ebe8699.jpg","description":"Transitional-rustic styling is expertly achieved in the design of the Nashville Collection. The two-tone faux wood look of melamine provides distinct contrast with its contrast of antique white and brown lending visual texture to the bedroom. The classic framing of the collection is paired with knob hardware that features white wood and black metal, to complete the rustic look."}
{"title":"1646 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAvondale Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/1d8234add4084d828d1e29dd4475717a.jpg","description":"The reflection of your glamorous image is one of striking style and classic sophistication, all illuminate by the boldly designed Avondale Collection. Mirrored framing immediately draws your eye to the modern-traditional profile of the case goods and bed as do the clipped corners on the bed mirror and vanity. Silver finished drop pull hardware centers each bead-molding adorned drawer front. The silver finish of the collection is illuminated not only by the reflected light off the mirrors, but it is also enhanced by the contrasting silver-gray crystal button-tufted accents on the headboard and footboard. Beyond the traditional case goods that are offered, an available vanity further enhances your space. Glass is mounted between the two vanity drawer units. Jewelry hooks provide convenient storage behind the folding mirrors and the available coordinating stool complements the collection."}
{"title":"1730WW Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCotterill Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210524/17/1730WW-1__l.jpg","description":"With transitional styling that is at home in a number of decorative environments, the Cotterill Collection will be a versatile addition to your bedroom. White finish over birch veneer, dramatically enhance the wood grain and is perfectly accented by the nickel hardware that punctuates each drawer front. Depending on your finish choice the headboard will feature either a white, gray or black faux leather insert with x-stitching and button-tufting."}
{"title":"1890N Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCadmus Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20201213/145/1890N_bedroom__l.jpg","description":"Offered in dark gray fabric, the Cadmus Collection tufting headboard will provide you with a versatile option for your contemporary home."}
{"title":"1881PU Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeleon Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20211212/182/1881_bedroom__l.jpg","description":"Designed for your modern home, the Deleon Collection allows for your creativity and space allowance to create the room of your dreams. Serving as the canvas of your bedroom makeover, the dark brown faux leather bed features a low-profile footboard and a dramatic diamond stitch pattern that adorns the headboard. Let your creativity flow with the addition of the DeLeon Collection."}
{"title":"1689P Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/7208995d490a4e34bc6ca42cc37de5c5.jpg","description":"The solid transitional styling of the Cardano Collection creates an\nimpactful design presence in your home. Utilizing distinct accent\ntechniques – plank effect, rasping, saw marks – and pairing them\nwith traditional framing and a rich finish – driftwood charcoal over\nacacia solids and veneers – creates a collection that is worthy of\nyour bedroom. The stately profile of the low-post bed is defined by\nthe column pilasters of the headboard and footboard, each post\ntopped by a turned finial."}
{"title":"2147 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMayville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/0c57b285eb794565a67195da0ad1437e.jpg","description":"Traditional in design and modest in scale, the elegant Mayville Collection takes its design inspiration from the classic Louis Philippe styling. Burnished brown cherry finish with all of the traditional flare unique to the style – antique brass tone drop handles and distinct framing – this collection is a perfect addition to your traditional adult or youth bedroom."}
{"title":"2046 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGarcia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200922/39c22ce1abac45bd91b09520cfe4055e.jpg","description":"Transitionally styled for your bedroom is the Garcia Collection. Created for versatile placement within a number of environments the louvered panel accents, distinct framing along with a cool gray finish over birch veneer combine to provide a clean palate for your personal decorative style. Nickel knob hardware provides subtle, yet distinct, contrast to the fronts of each case piece. The available desk is a functional addition to the collection with keyboard tray and drawer storage. The collection is offered in twin, full, queen, eastern king and california king for the perfect fit within your bedroom."}
{"title":"1824 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCatalonia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191119/989394b9e037417f8f1ac4196c96de4c.jpg","description":"Old-World European styling is captured in the dramatically elegant Catalonia Collection. Traditional design elements reign at every turn – egg and dart molding, acanthus leaf carving, bead molding, gold tipping and extravagant carvings – creating a sophisticated look for your bedroom. Each drawer front features dark bronze fixed-drop hardware with decorative flourish that furthers the elegant appointments that embellish this collection. A traditional cherry finish is utilized to highlight the cherry veneer of the set and decorative inlay patterns found on the case good tops. Metal scrollwork provides additional visual interest to the headboard, footboard and mirror framing."}
{"title":"2145 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEdina Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20211024/57/2145_bedroom__l.jpg","description":"Enhancing the contemporary design of your bedroom is the focus of the Edina Collection. Espresso finish build on the unexaggerated lines of this bedroom suite, blended with the tufted faux leather inserts on the headboard and the silver finish hardware culminates to achieve the modern look. Whether it is a hard contemporary or a softer transitional feel, your decor design options are wide open with this adult, as well as youth, bedroom collection."}
{"title":"1803W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWellsummer Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/b4f5ec050b2e468b8af9c2699db9713e.jpg","description":"The modern farm house serves as inspiration for the design of the Wellsummer Collection. Offered in white or gray finish for complete decorative versatility in your bedroom, this fresh look will satisfy your love of country styling. Ball finials top the bed posts while turned feet provide support to all pieces in the collection. Wood knob hardware centers the drawer fronts solidifying the trend forward transitional look."}
{"title":"1715 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolverson Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191119/ad9ca640e9cc4bed9f78fa750296af58.jpg","description":"Heavily influenced by industrial design, the Holverson Collection will lend a unique look to your personal space. Gunmetal finished wood framing provides sturdy structure and profile to each piece in this collection. Faux rivets provide additional detail to the metal finished bracketing that is prominently on display. The low profile bed features a horizontal slat design reminiscent of the industrial weathered environment that inspired the design. A rustic brown milk crate finish is utilized to highlight the acacia veneer. The open base nightstand provides drawer storage as well as an open display shelf."}
{"title":"2259W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBethel Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190724/32/2259W_bedoom20set__l.jpg","description":"An updated classic addition for your transitional bedroom is the Bethel Collection. Traditional accents, such as, turned bun feet that support each piece, and an antique white, lightly wire-brushed finish on ash veneer and selected hardwoods, blends with framing and lines that complement your personal style. Hidden drawer storages in the nightstand and dresser are a clever way to hide your valuables. Gray finish is also available."}
{"title":"1737NC Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLyric Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20211004/ec5319dc6d6940e3a3b6921aa4dee31d.jpg","description":"Taking the expected design elements of hard contemporary and putting a decidedly feminine curve into the mix make the Lyric Collection a unique addition to your new bedroom design. With each curve comes a new twist – satin nickel hardware accents the dark espresso finish, bowfront case pieces feature ball bearing drawer glides, and compliment the padded sleigh headboard and footboard, while a round, contemporary mirror reflects the modern designs that you have selected. A final unique addition to the collection is the glass-topped night stand that furthers the contemporary feel."}
{"title":"1803GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWellsummer Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200726/141/1803GY1__l.jpg","description":"The modern farm house serves as inspiration for the design of the Wellsummer Collection. Offered in white or gray finish for complete decorative versatility in your bedroom, this fresh look will satisfy your love of country styling. Ball finials top the bed posts while turned feet provide support to all pieces in the collection. Wood knob hardware centers the drawer fronts solidifying the trend forward transitional look."}
{"title":"1693 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRachelle Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/2f45b0f690b942f78c4362cb4781cca9.jpg","description":"The balance of rusticated accenting and elegant form is exquisitely achieved in the design of the Rachelle Collection. Serving as the focal point of the collection the stately sleigh bed presents an elegant profile for your bedroom, with its gray velvet-covered, rolled, padded headboard and footboard defined by button tufting, nailhead accent and wood framing. The traditionally styled case pieces feature classic appointments such as turned feet brown-finished metal drop hardware, egg and dart molding and rounded pilasters. The knotty pecan wood veneer features a weathered pecan finish further lending to the classic look of the collection."}
{"title":"1824PG Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCatalonia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191119/368/1824PG_bedroom20set__l.jpg","description":"Old-World European styling is captured in the dramatically elegant Catalonia Collection. Traditional design elements reign at every turn – egg and dart molding, acanthus leaf carving, bead molding, gold tipping and extravagant carvings – creating a sophisticated look for your bedroom. Each drawer front features dark bronze fixed-drop hardware with decorative flourish that furthers the elegant appointments that embellish this collection. A traditional platinum gold finish is utilized to highlight the oak veneer of the set and decorative inlay patterns found on the case good tops. Metal scrollwork provides additional visual interest to the headboard, footboard and mirror framing."}
{"title":"1730GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCotterill Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/fc3bfad076934eb1b00905914317281e.jpg","description":"With transitional styling that is at home in a number of decorative environments, the Cotterill Collection will be a versatile addition to your bedroom. Gray finish over birch veneer, dramatically enhance the wood grain and is perfectly accented by the nickel hardware that punctuates each drawer front. Depending on your finish choice the headboard will feature either a black or gray faux leather insert with x-stitching and button-tufting."}
{"title":"1714W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaurelin Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200615/1424c2be29c0476ea0c1a8516a7a8d42.jpg","description":"Casual transitional styling lends versatility to the placement of the Laurelin Collection in a number of bedroom settings. The white sand-through finish creates a versatile look allowing for placement of the collection in traditional to country casual environments. Antiqued bronze knob hardware punctuates the look of each framed drawer front, providing complementing contrast. Hidden drawers in the nightstand and dresser provide discrete storage for your valuables, while the storage drawers of the footboard provide a more visible means of additional storage capability. Bun feet support the case goods and a sleigh headboard finish off the transitional design of the collection."}
{"title":"1711NC Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRaku Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191018/297/1711NC_bedroom__l.jpg","description":"Danish mid-century modern design is well exemplified in the Raku Collection serving as stylish addition to your bedroom décor. Warm walnut finish-over the walnut veneer. The bed features a wood panel headboard and storage footboard. Each case piece features elongated pewter-finished hardware and the classic look of tapered leg design."}
{"title":"1757SV Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCavalier Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/fcaca8673d3643d1a5c5e3e43be6fc81.jpg","description":"The Cavalier Collection exemplifies the finest in Old World European design inspiration. Egg and dart base moldings, bead molding, acanthus leaf carvings, and genuine marble inset tops all blend to achieve an elegant addition for your traditional home. The grand sleigh bed features a faux leather, button tufted headboard insert. Each of the collection’s beautiful details is accented by the silver finish on birch veneer."}
{"title":"1730 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCotterill Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/7b13f03e6731440a96a02653ad856cff.jpg","description":"With transitional styling that is at home in a number of decorative environments, the Cotterill Collection will be a versatile addition to your bedroom. Cherry finish over birch veneer, dramatically enhance the wood grain and is perfectly accented by the nickel hardware that punctuates each drawer front. Depending on your finish choice the headboard will feature either a black or gray faux leather insert with x-stitching and button-tufting."}
{"title":"1711 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRaku Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190917/9d0655d6cd02461dbfdad4d36fe9d74f.jpg","description":"Danish mid-century modern design is well exemplified in the Raku Collection serving as stylish addition to your bedroom décor. Classic elements of understated retro design\ncombine with the two-tone finish - barnwood gray fronts and black profile - over walnut\nveneer and antique pewter bar hardware to blend effortlessly creating a sophisticated\nmodern look for your bedroom. Functional drawers front the footboard, allowing for\nadditional storage space beyond the dresser, nightstand and chest. Elongated, tapered\nturned legs support each piece of the collection."}
{"title":"1737NGY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLyric Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200910/185/1737NGY_bedroom__l.jpg","description":"Taking the expected design elements of hard contemporary and putting a decidedly feminine curve into the mix make the Lyric Collection a unique addition to your new bedroom design. With each curve comes a new twist – satin nickel hardware accents the brownish gray finish, bowfront case pieces feature ball bearing drawer glides, and compliment the padded sleigh headboard and footboard, while a round, contemporary mirror reflects the modern designs that you have selected. A final unique addition to the collection is the glass-topped night stand that furthers the contemporary feel."}
{"title":"1695 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEllendale Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200710/0eb550eb4ef14bdd9445781d982d6bab.jpg","description":"Modern lines and rustic aesthetic intersect in the design of the Ellendale Collection. Embossed faux-wood veneer creates the look of authentic mahogany finished wood planks, framed with contrasting 3D printed paper veneer in a dark ebony. Distressed pewter finished bar hardware provides contrast to the drawer fronts of this two-tone bedroom collection."}
{"title":"1869 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMont Belvieu Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/8df4d3a1626c4566a5abef6ef379e8c7.jpg","description":"When looking to furnish your traditional home, you choose pieces that are timeless. The classic look of the dark cherry finished Mont Belvieu Collection will allow you to fulfill your design desire. Pairing the panel bed of the collection with the traditional look of the Louis Philippe styling, instantly creates a classic look to your bedroom. Carved finials and squared pilasters provide traditional accent to the bed, as does the shell and scroll motif of the headboard and footboard that carries over to the collection’s mirror."}
{"title":"1882N Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBryndle Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20201213/118/1882N_bedroom__l.jpg","description":"The modern traditional styling of the Bryndle Collection is characterized by the button-tufted headboard and footboard, as well as the nail head accenting on headboard. Further complimenting the design is the brown fabric that covers."}
{"title":"1845LED Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlonza Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/81675bc17bc34679b9b3e113acba3942.jpg","description":"Adding a bold touch of glamour to your boudoir is the Alonza Collection. Finished in a metallic white, the embossed alligator board is reflected in the inlay mirrors of the bed and case pieces. Back-lit LED headboard and mirror illuminate with a delicate touch, creating a dazzling glow. Turned feet provide a distinct departure from the linear design of the collection, adding a distinctly feminine flair. Drawer pulls add to the allure of the collection with an inlay crystal and chrome look."}
{"title":"1904 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBeechnut Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/e8437f9abb704e84b38063282e69e714.jpg","description":"Blending the elements of contemporary design and rustic aesthetic, the Beechnut Collection is a unique addition to your master, youth or guest bedroom. Dark under-paneling serves to highlight the light elm finish of the embossed faux-wood veneer of the raised panels on the bed and case goods. Contrasting cup hardware punctuates each drawer front."}
{"title":"1958 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBevelle Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20211212/61/1958_bedroom__l.jpg","description":"Modern glamour is exemplified in the design of the Bevelle Collection. Acrylic crystals frame each piece in the collection, reflecting the light to create eye-catching drama. The silver finish serves as the perfect complement to the high-polish decorative knob hardware and medallion accents. A stylish mirrored vanity, with coordinating stool, provides additional function to the collection. Providing contrast to finish is the dark gray faux leather, button-tufted headboard panel. A coordinating dining room is also available."}
{"title":"2147BK Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMayville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/071a0b728ca844ac9ccb00c24d9f47d9.jpg","description":"Traditional in design and modest in scale, the elegant Mayville Collection takes its design inspiration from the classic Louis Philippe styling. Black finish with all of the traditional flare unique to the style – antique nickel tone drop handles and distinct framing – this collection is a perfect addition to your traditional adult or youth bedroom."}
{"title":"1961RF Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nErwan Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/083b1697fe744ff18afa967b1d5991a6.jpg","description":"Taking a nod from contemporary design, the look of the Erwan Collection is a versatile choice for the modern home. A rich espresso finish highlights the okume veneer and beveled drawer fronts which are punctuated with gunmetal finished hardware and bold framing that blend together to create this soft contemporary bedroom offering."}
{"title":"1916GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAllura Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/613cbc94f3424a4d8f02ca8043ec0d37.jpg","description":"Glamour reigns in the design of the Allura Collection. Framing each piece is a decorative beveled mirror accent that enhances the illumination from the touch-engaged LED backlight of the headboard and mirror, as well as the under-light of the night stand. High polished crystal-enhanced hardware boldly accents the gray finish as does the silver faux leather crystal-tufted headboard insert of the collection."}
{"title":"1923 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHebron Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200526/5a2941f775dc412d80ebd7edf18ad93a.jpg","description":"The transitional styling of the Hebron Collection creates a versatile look for your bedroom. The Sleigh headboard has a subtle curve to its profile which serves as defining contrast to the clean lines of the collection’s case pieces. The nightstand, dresser and chest each feature dark bronze finished cup hardware, providing complementing accent to the dark cherry finish that accentuates the birch veneer."}
{"title":"2024 Headboard\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPotrero Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/9fa0034f5a1d4561811448a0e3cba29a.jpg","description":"Versatile placement options, while utilizing minimum space makes the Potrero Collection the right choice for your home. Gray fabric covers the padded vertical channel tufted headboards."}
{"title":"1919 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAntoinetta Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/91d96ad22c3a48909b3a122320475b3d.jpg","description":"Traditional elements of Old World European styling are blended to create the look of the Antoinetta Collection. Acanthus leaf motif as well as bead and heavily carved moldings serve as the initial draw to the traditional design. Canted pilasters, marble tops, sunburst medallion, and classic button and bale hardware further accent the case goods. The heavily framed headboard features dark brown bonded faux leather with crystal button tufting. Cherry veneer and burl inlay are highlighted by a warm cherry finish with gold tipping."}
{"title":"1916 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAllura Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190912/e7ce9dd459454e1aacd6e826f5a8ee33.jpg","description":"Glamour reigns in the design of the Allura Collection. Framing each piece is a decorative beveled mirror accent that enhances the illumination from the touch-engaged LED backlight of the headboard and mirror, as well as the under-light of the night stand. Alligator embossing and high polished crystal-enhanced hardware boldly accent the silver finish as does the silver faux leather crystal-tufted headboard insert of the collection."}
{"title":"1902 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWaldorf Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/5f90a9122dd44d588635f9a7e794f134.jpg","description":"With a transitional look that lends to industrial, rustic and modern styling, the Waldorf Collection is a versatile choice for your bedroom. The printed wood grain of the performance laminate is featured in a gray tone allowing for neutral accent to your stylistic environmental choices. Horizontal accenting on the headboard and footboard creates a dramatic line that carries over to the clean design of the case pieces, each featuring distinct framing and dark, contrasting metal hardware."}
{"title":"2220DBR Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLorenzi Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/a1fc25d8c4de4bf0aaa75fbb63ff8063.jpg","description":"The contemporary design of the Lorenzi Collection is enhanced by the addition of the durable dark brown faux leather covering that encases each piece in the collection. Silver tone hardware provides a distinct contrast to the fabric’s finish. Scaled for urban living, this collection will prove to be a unique and stylish addition to your master, youth, and guest bedrooms."}
{"title":"2243SL Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Park Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/a3a70ed8c6634cdc98dd622bc7a9fed3.jpg","description":"Walking into the bedroom that is occupied by the Deryn Park Collection immediately displays your love of the traditional aesthetic. Stately from every angle, sophisticated design elements blend to create this beautiful collection. A graceful sleigh bed allows you the flexibility to fit the scale of your bedroom and the design to accommodate your personal style. Design elements include burl inlay, traditional bale and knob hardware, claw feet and shell motifs. The cherry finish is highlighted by gold tipping that accentuates the traditional feel of elegant Deryn Park Collection."}
{"title":"1919NC Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAntoinetta Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190429/0da19cc8547d4b02b97d5bb3e41b91b0.jpg","description":"Traditional elements of Old World European styling are blended to create the look of the Antoinetta Collection. Acanthus leaf motif as well as bead and heavily carved moldings serve as the initial draw to the traditional design. Canted pilasters, marble tops, sunburst medallion, and classic button and bale hardware further accent the case goods. The heavily framed headboard features champagne-tone bonded faux leather with crystal button tufting. Birch veneer is highlighted by a champagne finish with accentuating tipping."}
{"title":"2059 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCooper Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200717/75/20591__l.jpg","description":"The distinct styling of the Cooper Collection will be the perfect fit for the modern industrial look you wish to achieve in your bedroom. Utilizing embossed faux-wood veneer, the unique 4-tone style accentuates highs and lows of dark and light acacia as well as the rich tones of dark ebony and rustic mahogany faux grains. Dark metal hardware provides complementing contrast to the drawer fronts."}
{"title":"1910 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMandan Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200806/2535a91ca5704cccab8f3eff405868d5.jpg","description":"The modern lines of the Mandan Collection are blended with transitional aesthetic to create a unique offering for your bedroom. Utilizing faux wood veneer creates the look of authentic wood planks with the weathered pine finish further lending to the rusticated style. Black finished nickel bar hardware fronts each drawer providing contrasting complement to the nightstand, dresser and mirror."}
{"title":"1923NB Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHebron Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200526/745f8275127a430b9fff7eec00c6d19a.jpg","description":"The transitional styling of the Hebron Collection creates a versatile look for your bedroom. The sleigh bed has a subtle curve to its profile which serves as defining contrast to the clean lines of the collection’s case pieces. Further complementing the bed’s look is the beige woven fabric and nailhead accent that grace the front the headboard and footboard. The nightstand, dresser and chest each feature dark bronze finished cup hardware, providing complementing accent to the dark cherry finish that accentuates the birch veneer and poplar solids."}
{"title":"2042 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWoodrow Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200721/23c9948fdfa844d3b3f6932706b8e783.jpg","description":"Industrial design is subtly used to achieve a cool look for your bedroom in the Woodrow Collection. Dark metal hardware and corner banding with rivet look lend to the casual look of this bedroom group. Melamine laminate features a weathered-wood look that furthers the intended design. Black faux leather accents the headboard providing distinct complementing contrast to the finish of the collection.  Coordinating dining, entertainment and occasional are available."}
{"title":"2159 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCumberland Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200910/224/2159_bedroom__l.jpg","description":"A classic addition to your transitional bedroom will be the Cumberland Collection. Traditional accents such as, the bun foot that supports each piece and rich brown cherry finish on birch veneer, and selected hardwood blend with framing and lines that compliment your personal style. Hidden drawer storages in the night stand and dresser are a clever way to hide your valuables."}
{"title":"1955 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLonan Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200910/557/1955_bedroom__l.jpg","description":"With a hint of weathering so popular in industrial styling, the Lonan Collection will fit into the rustic contemporary aesthetic that you look to achieve in your bedroom. Melamine laminate mimics the look of sun-bleached wood with a darker under-hue providing subtle contrast to the design of the group, with dark finished metal handles providing additional contrast. The collection is offered in twin, full, queen, eastern king and california king for perfect placement in your home."}
{"title":"2147W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMayville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200923/b70a0ed516414ae8bf915543c6752879.jpg","description":"Traditional in design and modest in scale, the elegant Mayville Collection takes its design inspiration from the classic Louis Philippe styling. White finish with all of the traditional flare unique to the style – antique brass tone drop handles and distinct framing – this collection is a perfect addition to your traditional adult or youth bedroom."}
{"title":"1936 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVestavia Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/2d537e003ab3471daaf59d4b9806d46d.jpg","description":"The contemporary styling of the Vestavia Collection provides a unique platform from which to redecorate your bedroom. Faux wood printed veneer provides subtle texture and a gray finish perfectly contrast to the dark brown base rails of the case pieces and back panels of the headboard and footboard. Clean lines lend to the angular modern look are enhanced by the horizontal brushed nickel hardware. Offered in both adult and youth beds, this collection provides great flexibility to your rooms at home."}
{"title":"1957 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJerrick Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/8746b0e299c84875b9a526d6a210140c.jpg","description":"Classic transitional design serves as a base for the natural qualities of the solid wood utilized to create the rustic look of the Jerrick Collection. Metal hardware furthers the authentic rustic look while a burnished finish serves to highlight the wood grain while allowing each plank to serve as a unique accent to the overall design."}
{"title":"1916W Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAllura Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190912/135/1916W_LEDbedroom20set__l.jpg","description":"Glamour reigns in the design of the Allura Collection. Framing each piece is a decorative beveled mirror accent that enhances the illumination from the touch-engaged LED backlight of the headboard and mirror, as well as the under-light of the night stand. Alligator embossing and high polished crystal-enhanced hardware boldly accent the white finish as does the pearl-white faux leather crystal-tufted headboard insert of the collection."}
{"title":"1928 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCelandine Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200922/e8b3304b60f64437b876db6b6ced9d90.jpg","description":"The look of traditional design is updated for the modern traditional home in the Celandine Collection. Crystal tufting immediately draws the eyes to the pearlized finish of the faux leather headboard insert, while high polished knob hardware stands out from the silver finish of the collection. With each of the aforementioned elements, subtle glamour will be achieved in the design of your elegant bedroom."}
{"title":"1916BK Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAllura Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20190912/6a82e4c851ad41618d835e0ad09e0227.jpg","description":"Glamour reigns in the design of the Allura Collection. Framing each piece is a decorative beveled mirror accent that enhances the illumination from the touch-engaged LED backlight of the headboard and mirror, as well as the under-light of the night stand. Alligator embossing and high polished crystal-enhanced hardware boldly accent the black finish as does the black faux leather crystal-tufted headboard insert of the collection."}
{"title":"2243 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Park Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/7d7e545880a14086ab15bd9263ef7bf3.jpg","description":"Walking into the bedroom that is occupied by the Deryn Park Collection immediately displays your love of the traditional aesthetic. Stately from every angle, sophisticated design elements blend to create this beautiful collection. Stately poster bed allows you the flexibility to fit the scale of your bedroom and the design to accommodate your personal style. Design elements include burl inlay, traditional bale and knob hardware, claw feet and shell motifs. The cherry finish is highlighted by gold tipping that accentuates the traditional feel of elegant Deryn Park Collection."}
{"title":"2145NP Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEdina Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200823/b2ae88a1672d4931a2b1f16ea05c429a.jpg","description":"Enhancing the contemporary design of your bedroom is the focus of the Edina Collection. Dark gray finish build on the unexaggerated lines of this bedroom suite, blended with the tufted faux leather inserts on the headboard and the chrome finish hardware culminates to achieve the modern look. Whether it is a hard contemporary or a softer transitional feel, your decor design options are wide open with this adult, as well as youth, bedroom collection."}
{"title":"1910GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMandan Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/42ff6ebaba0b4e4fa1b246ca8eeb7e52.jpg","description":"The modern lines of the Mandan Collection are blended with transitional aesthetic to create a unique offering for your bedroom. Utilizing faux wood veneer creates the look of authentic wood planks with the weathered gray finish further lending to the rusticated style. Satin nickel bar hardware fronts each drawer providing contrasting complement to the finish of the collection."}
{"title":"2042NB Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWoodrow Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20191222/87/2042NB1_bedroom20set__l.jpg","description":"Industrial design is subtly used to achieve a cool look for your bedroom in the Woodrow Collection. Dark metal hardware and corner banding with rivet look lend to the casual look of this bedroom group. Melamine laminate features a weathered-wood look that furthers the intended design. The bookcase headboard provides ample space for your bedside storage needs. Further functionality comes in the form of an optional tower night stand and under-bed toy boxes."}
{"title":"2147SG Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMayville Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200816/189/2147SG_bedroom__l.jpg","description":"Traditional in design and modest in scale, the elegant Mayville Collection takes its design inspiration from the classic Louis Philippe styling. Stained gray finish with all of the traditional flare unique to the style – antique brass tone drop handles and distinct framing – this collection is a perfect addition to your traditional adult or youth bedroom."}
{"title":"1904GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBeechnut Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200811/146/1904GY_bedroom2__l.jpg","description":"Blending the elements of contemporary design and rustic aesthetic, the Beechnut Collection is a unique addition to your master, youth or guest bedroom. Dark under-paneling serves to highlight gray finish, enhancing the embossed faux-wood veneer of the raised panels on the bed and case goods. Contrasting cup hardware punctuates each drawer front."}
{"title":"2220 Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLorenzi Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20210930/9d17ab283636458fbe072dc2d154d3c5.jpg","description":"The contemporary design of the Lorenzi Collection is enhanced by the addition of the durable black faux leather covering that encases each piece in the collection. Silver tone hardware provides a distinct contrast to the fabric’s finish. Scaled for urban living, this collection will prove to be a unique and stylish addition to your master, youth, and guest bedrooms."}
{"title":"2259GY Bedroom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBethel Collection","main category":"BED ROOM","sub category":"Bedroom Collections","img":"https://www.homelegance.com/u/HMLG/20200716/bccdab4f1fd042caab52cb8a00327fea.jpg","description":"An updated classic addition for your transitional bedroom is the Bethel Collection. Traditional accents, such as, turned bun feet that support each piece, and a gray, lightly wire-brushed finish on birch veneer and selected hardwoods, blends with framing and lines that complement your personal style. Hidden drawer storages in the nightstand and dresser are a clever way to hide your valuables. Antique white finish is also available."}
