{"title":"5807W Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEnfield Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/91/5807W_dining__l.jpg","description":"The design of the Enfield Collection pairs convenience and function to create a counter-height console table that will be the perfect fit in your home’s casual living space. Sidling up to the back of your sofa, this 4-piece table set features USB charging ports, electrical plug-in, drink shelf -convenient to the sofa back- and three wood-framed stools that feature padded seats. A two-tone brown and antique white finish is utilized over acacia veneer, solidifying the modern farmhouse look."}
{"title":"5275-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOlney Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/40/527536_dining__l.jpg","description":"Designed for your modest dining space, the Olney Collection provides a stylish and functional\nsurface for your mealtime needs. Offered in two convenient table heights, this five-piece\npacked collection is available in both dining and counter height. The metal table base rises to\nsupport the faux marble fixed tabletop. Vertical accents grace the table apron and the top rails\nof the dark brown faux leather covered dining height and 24-inch height chairs."}
{"title":"586-76 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmeillia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/106/58676_dining__l.jpg","description":"Alive with an exciting Arts & Crafts flair, the contemporary style of Ameillia Collection uses smooth dark oak finish and clean line design to create an inviting atmosphere to enhance your dining experience. The contemporary design appeals to the sense with its subtle attention to details. Chair seat and bench seat feature easy to clean black faux leather."}
{"title":"5752 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWhittaker Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/82/5752_dining__l.jpg","description":"Pairing the natural form of wood with a modern profile creates the look of the Whittaker Collection. Live edge Asian hardwood is finished in brown, with light burnishing, highlighting the natural grain, a design feature that carries from the tabletop to the available bench. The padded seat and back of each side chair are covered in gray linen fabric and are supported by wood legs."}
{"title":"5162WW Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKiwi Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/24/5162WW36_dining__l.jpg","description":"Perfectly scaled for your cozy dining space is the Kiwi Collection. The two-tone finish of the group – white wash and dark cherry – serves to highlight the mindy veneer. Drop leaf sides allow for placement or storage within your space that is quick and convenient for your lifestyle. The wood chairs feature brown faux leather seats that contrast the white wash finish of the chairs. An open shelf base allows for the display of your tabletop accessories."}
{"title":"2601BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTempe Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/1dc8814e86184a3fa37e3ee6239e2314.jpg","description":"With a scale appropriate for any number of smaller dining spaces, the Tempe Collection will provide the look and style you want in your home.  The transitional feel of the group comes from the richly hued faux marble table top that is supported by the black metal base and the minimalistic design of the accompanying black faux leather side chairs."}
{"title":"5746-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWeston Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/68/574636_dining__l.jpg","description":"The transitional styling of the Weston Collection is paired with convenience to create a dining set scaled for your casual home. The 5-piece collection includes a counter-height table and four counter-height chairs. The acacia veneer of the group is highlighted with a medium brown finish and is further complemented by the brown faux leather of the chair seats."}
{"title":"710-48 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211017/4dcf511deb8b4548abba799ab7bc1f6e.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the rectangular and round traditional dining height tables. Additional offering is the trestle table with black glass insert. Dining height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"5746 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWeston Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/69/5746_dining__l.jpg","description":"The transitional styling of the Weston Collection is paired with convenience to create a dining set scaled for your casual home. The 5-piece collection includes a traditional dining height table and four chairs. The acacia veneer of the group is finished with a medium brown and is complemented by the brown faux leather of the chair seats."}
{"title":"5769W Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nIthaca Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/89/5769_dining__l.jpg","description":"With a neutral palette and transitional design, the Ithaca Collection will place perfectly in your casual dining room. The two-tone finish that graces the acacia veneer - the legs and apron a grayish-white supporting the medium brown top - creates a canvas for your decorative tabletop accessories. The fixed top table is flanked by wood framed chairs with wheat colored linen fabric seats."}
{"title":"5817-60 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKeene Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210223/161/58176020dining__l.jpg","description":"From its streamlined profile to the vibrant hues that contrast the table’s neutral finish, the modern design of the Keene Collection will blend perfectly with your dining room’s sleek aesthetic. A gray finish over oak veneer subtly highlights the distinct grain of the wood, while lending neutral contrast to the three available -blue, orange, and gray - velvet upholstered coverings of the accompanying side chairs. Black-finished hairpin legs support the table’s fixed top."}
{"title":"5167 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nYates Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/37/516796_dining__l.jpg","description":"Blending the look of country style with the popular modern industrial aesthetic, the Yates Collection manages to achieve a look that is unique unto itself. The turned legs of the trestle base rise to support the burnished dark oak table top. Neutral fabric covered chairs feature wood support legs with a unique turned block look and nailhead accent. The accompanying china’s mirrored back, display shelving, light feature, lower door storage, and drawer storage provide ample room to show off your table top accessories. The look of turned pilasters and framed panel doors further lend to the stylish collection."}
{"title":"5165GY Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNisky Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/32/5165GY48_dining__l.jpg","description":"Styled for the casual transitional dining space, the Nisky Collection will provide a neutral pallet for your decorative influences to shine. The gray finish over acacia veneer highlights the subtle quadrant pattern as the woods distinct grain. Gray fabric covers the seats and backs of the available side chairs."}
{"title":"5757 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLevittown Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/86/5757_dining__l.jpg","description":"The classic style of the Levittown Collection will fit in perfectly with the transitional décor of your casual dining space. X-framing supports the counter height tabletop, a design feature that carries over to the x-backed counter height chairs. The padded chair seats feature a brown fabric. The mindy veneer of the collection features a brown finish furthering the transitional look of the collection."}
{"title":"5302BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSaddleback Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190912/4358cd8b327d4ea496c48adc6a49d096.jpg","description":"A space apart from the hustle and bustle of today’s hectic lives, this black sand-through finish gathering height table with four saddle back stools are designed for you to enjoy a good meal with or without your friends and families."}
{"title":"5806-5P Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLovell Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/f76537da6e594132929542356501ad89.jpg","description":"The transitional styling of the Lovell Collection will lend perfect accent to your casual dining space. The 5-piece dining set is scaled to seat four comfortably and includes a table and four chairs. The oak veneer is highlighted by a gray finish. The wood framed side chairs feature brown fabric-covered padded seats the upper seatbacks featuring the same covering."}
{"title":"5800BK-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAsher Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/5d943b3538b74fe18f1cb6af95a0e0a1.jpg","description":"The transitional style of the Asher Collection creates a versatile platform to inspire your casual dining room décor. The round counter height table’s support base features a display shelf that allows for quick and open access to your tabletop accessories. The brown and black finish over acacia veneer serves to highlight the wood’s grain while allowing for maximum versatility in decorative accenting. The coordinating wood-framed counter height chairs feature beige fabric seats for complementing contrast."}
{"title":"710-36SQ Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/115/71036SQ_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the square counter height table. Counter height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"5275 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOlney Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/41/5275_dining__l.jpg","description":"Designed for your modest dining space, the Olney Collection provides a stylish and functional surface for your mealtime needs. In this five-piece packed offering, the metal table base rises to support the faux marble fixed tabletop. Vertical accents grace the table apron and the top rails of the dark brown faux leather covered chairs."}
{"title":"5473-54 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLordsburg Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210223/160/54735420dining__l.jpg","description":"Elegantly designed for the traditional dining room is the Lordsburg Collection. Supported by the pedestal base is the table’s round top where the magnificent parquet veneer is highlighted by the brown cherry finish that covers the collection. Heavily carved molding provides distinct accent to the table’s top while brown faux leather covers the seats and backs of the coordinating wood-framed chairs. The accompanying server provide ample storage space for your tabletop accessories."}
{"title":"5839CH-5P Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFaust Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210113/87/5839_dining__l.jpg","description":"Scaled for your casual dining nook, the transitionally styled Faust Collection will provide the perfect complement to your home’s decor. Vertical slat-back wood-framed chairs feature dark brown faux leather seating that pair with the coordinating table. The five-piece dining collection is offered in a charcoal brown finish over birch veneer."}
{"title":"5103 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMosely Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211108/40/5103_dining__l.jpg","description":"Designed for your cozy dining nook, the transitionally styled Mosely Collection will be a perfect fit. Vertical slat back chairs – featuring black faux leather seating with contour stitching – flank the routed tabletop. The five-piece dining collection is offered in a dark brown cherry finish."}
{"title":"5039BR Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAhmet Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/5ac41b94e96d44d480f81930f776a5aa.jpg","description":"Scaled for a smaller dining space, the Ahmet Collection provides comfortable seating for four. The rectangular table’s walnut brown finish highlights the ash veneer and provides complementing contrast to the brown faux leather seats and backs of the side chairs, all blending to create neutral accent to your decorative palette."}
{"title":"5473-103 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLordsburg Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210930/f062b780edc24111ba78d14cd992345d.jpg","description":"Elegantly designed for the traditional dining room is the Lordsburg Collection. Supported by the double pedestal base is the tabletop where the magnificent parquet veneer is highlighted by the brown cherry finish that covers the collection. Heavily carved molding provides distinct accent to the tabletop while brown faux leather covers the seats and backs of the coordinating wood-framed chairs. The accompanying hutch and buffet provide ample storage space for your tabletop accessories."}
{"title":"710-36RD48 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211017/0/710-36RD_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the round counter height table. Counter height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"586-82 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmeillia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/107/58682_dining__l.jpg","description":"The solid, clean lines of the Arts and Crafts movement are interpreted from modern times in the Ameillia Collection. Substantial tapered legs and the wood veneer complement this simple and refined dining offering. The dark oak finish rectangular table is flanked by the perfectly coordinating chair or bench option."}
{"title":"5800WH-48RD Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAsher Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/2cb556606eef404ebf5c2f5e3408f63a.jpg","description":"The transitional style of the Asher Collection creates a versatile platform to inspire your casual dining room décor. The round dining height table’s support base features a display shelf that allows for quick and open access to your tabletop accessories. The antique white finish over acacia veneer serves to highlight the wood’s grain while allowing for maximum versatility in decorative accenting. The coordinating wood-framed dining height chairs feature light brown fabric seats for complementing contrast."}
{"title":"5803RF Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBrightleaf Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210223/138/5803RF20dining__l.jpg","description":"With a design that pairs well with your preference for transitional country styling the Brightleaf Collection will provide a functional addition to your casual dining space. The two-tone finish, over ash veneer, of the counter-height dining table features a brown tabletop and light gray base, with the color combination carrying over the coordinating counter height wood chair. The table’s apron features 4 functional drawers, each accented by antique brass-finished cup hardware, allowing for convenient storage of your tabletop accessories."}
{"title":"5772 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nElias Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/1fe0a433cfde492abcf4fb4ed5da881e.jpg","description":"Inspired by industrial environments, the Elias Collection presents a functional modern aesthetic to your casual dining space. Acacia veneer features a gray finish that is perfectly contrasted by the gunmetal black finished wood framing that provides support. The table features a bookcase side support which features open display as well as drawer storage allowing for easy access to your table top items. Seating comes in the form of an available counter height bench and barstools – each with gray fabric-covered padded seats."}
{"title":"5664 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTripp Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/486/5664_dining__l.jpg","description":"Scaled for your casual dining space, the rustic-industrial look of the Tripp Collection will provide a platform\nfor you to enjoy your mealtime. The silver gray metal legs and apron of the table provide support to the printed faux\nwood veneer tabletop. Metal framed chairs feature padded black-hued faux leather seats that perfectly\ncomplement the table."}
{"title":"5050 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGalena Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/14/505036_dining__l.jpg","description":"The convenient height of the Galena Collection along with the warm cherry finish will be a welcome addition to your casual dining space. The five-piece offering includes the counter height table with display storage base and four coordinating chairs that have dark brown faux leather seats. The transitional styling makes the placement of the collection appropriate for numerous home decors."}
{"title":"5706GY Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArmhurst Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/10/5706GY60_dining__l.jpg","description":"Functionality beyond the expected use of a tabletop makes the Armhurst Collection the perfect addition to your casual dining space. The ends of the table feature drawers for quick and easy storage of your smaller table top accessories. Gray finish is a versatile option for your decorative preferences. Wood framed chairs feature vertical slat backs with neutral tone seats."}
{"title":"5460 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDiego Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/346/546036_dining__l.jpg","description":"At home in your casual dining space or perhaps in your recreation room, the Diego Collection serves as a casual gathering spot to relax and enjoy a meal, or to catch up with friends and family. The birch veneer of the collection features a versatile espresso finish. The pedestal display base allows for open storage. The matching chairs feature wooden vertical slat backs and padded seats with black faux leather covering."}
{"title":"5302A Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSaddleback Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190912/382/5302A__l.jpg","description":"A space apart from the hustle and bustle of today’s hectic lives, this oak finish gathering height table with four saddle back stools are designed for you to enjoy a good meal with or without your friends and families."}
{"title":"5713GY Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConnected Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/554/5713GY_dining__l.jpg","description":"The elevated dining experience that the Connected Collection provides will fuel your device’s battery life while you fuel yourself. The convenience of built-in USB ports and A/C power turns your casual dining area into an efficient recharging station. The four-piece pack of the Connected Collection includes a counter height table and three barstools. A single drawer allows for discrete storage on the table’s side apron. As a neutral pallet for your decorative preference, the collection features a gray finish over ash veneer, with the neutral gray tone of the barstool’s seats providing subtle accent."}
{"title":"5773DC Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaye Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/99b75c714ece44368cf043b76c50c8dc.jpg","description":"Modern convenience is paired with transitional design to create the multi-functional Daye Collection. This unique casual dining set features built-in display shelf, two USB ports and seating for two. Mindy veneer is finished in burnished brown cherry. The wood-framed low-back chairs feature gray fabric seat covers for neutral accent to the collection’s finish."}
{"title":"5511 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDelmar Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/359/5511_dining__l.jpg","description":"The burnished finish and classic profile of the Delmar Collection will be a perfect fit for your modest casual dining space.  Splat back wood chairs with black faux leather seats flank the dining height table offering.  Routed detailing provides a linear focal point on the tables tops."}
{"title":"5838CH-5P Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHazel Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210113/89/5838_dining__l.jpg","description":"Scaled for your casual dining nook, the transitionally styled Hazel Collection will provide the perfect complement to your home’s decor. X-back wood-framed chairs feature dark brown faux leather seating that pair with the coordinating table. The five-piece dining collection seats four and is offered in a charcoal brown finish over birch veneer."}
{"title":"5716RFAK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBalin Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210421/4/5716RFAK_dining__l.jpg","description":"Sharing a meal with friends and family is made easy with the Balin Collection. Designed for maximum efficiency and personal decorative preference, each feature of the collection lends individual character to the overall design. The rotation of the inset lazy Susan allows for quick and easy access to your meal. The table’s base features an open storage shelf for display of your favorite tabletop items. Three seating options are available for you to choose your seating experience – counter height bench, double X-back chair, vertical slat back chair – each featuring gray textured fabric covering the padded seats. The mindy veneer of the collection is finished in light oak for neutral accent to your casual dining space."}
{"title":"5603 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTimbre Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201123/28/56033620560324__l.jpg","description":"The multifunctional design of the Timbre Collection will be the perfect addition to your dining nook. A built-in bookcase provides open display space to this counter height offering. Wire brushed acacia veneer is highlighted by a gray finish. Textured black faux leather seats top the accompanying stools and feature nailhead accent for added decorative flair."}
{"title":"5777WH Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTroy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/259f564a676b40c2b8679d7136e85cf8.jpg","description":"Modern farmhouse styling is exemplified in the design of the Troy Collection. Scaled for a cozy casual dining space, the table seats four comfortably around it’s fixed top. The two-tone finish that graces the table and chairs – the table legs, apron and chair frame an antique white supporting the cherry tabletop and chair seats- creates a canvas for your decorative tabletop accessories."}
{"title":"5518 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMattawa Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/383/551878_dining__l.jpg","description":"Rustic industrial styling heavily influences the design of the Mattawa Collection. Metal banded rivet accenting provides visual contrast to the chairs, table and server of this casual dining collection. The brown finish has hints of gray undertone lending to the rustic look. Accompanying the collection is the server, featuring drawers and behind door storage."}
{"title":"5735 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLeland Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200826/35/5735_dining__l.jpg","description":"The Leland Collection is a study of the artful intersection of metal and wood, a creative collaboration that will be a perfect addition to your casual dining room. Parquet mindy veneer is finished in a warm brown finish that provides distinct highlight to the dining tabletop, with black metal framing providing structural support. Shelter-back side chairs feature brown fabric for complementing accent to the modern table."}
{"title":"5489 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSelbyville Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/349/5489_dining__l.jpg","description":"Transitional lines paired with mixed media elements create the casual look of the Selbyville Collection.  The fixed wood top of the group features a rectangular black glass insert that allows you to look down onto the under-table wine storage rack.  Metal framing supports the table and wood seat swivel chairs.  The cherry finish of the wood is accented by the Gunmetal finished metal."}
{"title":"5718 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJosie Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/58/5718_dining__l.jpg","description":"The collective enjoyment of mealtimes is amplified with the addition of the Josie Collection to your casual dining space. The round design of the table, paired with the starburst oak veneer pattern, creates a central focus point lending to ease of conversation and serving, as the center-mounted lazy Susan rotates allowing each dish from your meal to come within easy reach. An espresso finish and sturdy profile lend to the modern-transitional style. The gray fabric of the chair’s seats and backs provide complementing contrast to the wood framing that defines their profile."}
{"title":"5705BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBaywater Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/0/5705BK_dining__l.jpg","description":"Transitional styling is utilized in the design of the Baywater Collection creating a stylish addition to your dining space. Notched accenting, two-tone black and natural finish, open display storage base, wood framed chairs with neutral tone fabric seats – all lend to the casual aesthetic that envelopes your home."}
{"title":"5494-76 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSavion Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/424/549476_dining__l.jpg","description":"Sophisticated soft contemporary design is achieved in your dining room with the addition of the Savion Collection. Oval single pedestal table featuring a distinct birdcage style base. An espresso finish highlights the unique veneer pattern. Dramatic flair is lent to the design by the accompanying chairs. Neutral tone fabric covers the substantially sized roll back arm and side chairs. Reeded fronts on the server along with the serpentine profile further the elegance of this distinctly sophisticated collection."}
{"title":"5441-06 Occasional\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSarasota Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210113/115/544106_dining__l.jpg","description":"With a style that fits the transitional aesthetic of your home, the Sarasota Collection is sure to become a perfect platform for your home casual living space. Ash veneer is highlighted with a driftwood brown finish for a wonderfully weathered aesthetic. The console table’s top catches your eye with its quadrant v-matched veneer pattern. The clever design allows for use as a worktable or eating space with 2 USB ports, 2 electrical outlets, underside open storage and lower drink shelf that can be easily accessed when located behind your sofa. The nailed head accent and linen-like gray fabric of the stool’s seat provides perfect complement to the finish of the collection."}
{"title":"5627NW-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranby Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/270/5627NW36205627NW24205627NW40__l.jpg","description":"Inspired by the aesthetic of a casual country kitchen, the Granby Collection is an inviting gathering spot for mealtime with family and friends. 36-inch counter height with 4 drawers on the apron and storage display shelf base. The two-tone look of the acacia and pine solids base, finished in antique white, and the elm veneer of the table’s top, finished in a rosy brown, present as a harmonious combination of color. Also available for the 72-inch table – side chair, bench and server."}
{"title":"5658 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSalton Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/476/5658_dining__l.jpg","description":"Designed for your casual dining space with a transitional look that draws inspiration from Arts & Crafts styling, the Salton Collection is packaged as a 6 piece set that includes the table, 4 chairs and a bench. The collection’s birch veneer is finished in traditional cherry, lending to the timeless aesthetic. Wood framed chairs further draw inspiration from the classic style with brown faux leather seats and back accent providing complementing contrast to the finish."}
{"title":"5654-92 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRathdrum Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/462/5654_dining__l.jpg","description":"The streamlined profile of the Rathdrum will present a modern platform for your mealtime, pairing with the elegant style that defines your home. The trestle table’s top features book-matched oak veneer that is highlighted by dark oak finish, allowing for the depth of the distinct grain to create dramatic eye-appeal. The accompanying side chairs and armchairs feature wood framing that is contrasted by the gray fabric cover of the stitch-contoured seats and backs."}
{"title":"5438-54 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nToulon Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/5b1b70e1e04140d886654dbf4b32531c.jpg","description":"Bold curves provide elegant contrast to the unique look of the Toulon Collection. The heavily scrolled base supports of the table feature routing with dark pewter-finished metal trestle that connects. Distressed dark oak finish provides texture to the acacia veneer of the table and pine of the accompanying chairs. The optional bench takes shape with inspiration drawn from church pews, allowing for a look that will add a special touch to your dining room. The French provincial inspired routing lends decorative touch to the accompanying server, while dual drawer and door storage provides ample space to stow your tabletop accessories."}
{"title":"5038 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFlannery Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200910/388/503848_dining__l.jpg","description":"With a scale appropriate for any number of smaller dining spaces, the Flannery Collection will provide the look and style you want in your home. The transitional feel of the group comes from the richly hued faux marble table top and the minimalistic design of the metal ladder-backed chairs that feature black faux leather seats. The table and chairs are constructed of metal in black finish."}
{"title":"5655-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOxton Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/467/565536_dining__l.jpg","description":"Designed for your home’s rustic aesthetic, the Oxton Collection provides an ample platform for your mealtime and social activities. The rectangular counter height tabletop is supported by a functional storage base, allowing for discrete placement of your tabletop accessories. Contoured-back, wood-framed, 24-inch height chairs feature nailhead accent and espresso faux leather seats that perfectly complement the rustic look of the Oxton collection."}
{"title":"5520 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFulbright Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/207/5520_dining__l.jpg","description":"An updated look for the casual country inspired dining space, the Fulbright Collection is a warm and inviting addition to your home. A weathered gray rub through finish serves to contrast the coffee finish of the table top, seats and server top, lending to the updated styling of the traditional look. The available bench provides an additional seating option beyond the expected side chair configuration, creating an open and inviting communal look."}
{"title":"5607 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nChevre Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200825/177/5607_dining__l.jpg","description":"The Chevre Collection will be a perfect addition to your cozy dining space. The burnished finish of the pine solids and veneers is perfectly complemented by the gray metal of the collection’s framing. The rustic industrial styling makes this smaller scale collection a big addition to your dining area."}
{"title":"5627NW-72 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranby Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/283/5627NW72205627NWS205627NW40__l.jpg","description":"Inspired by the aesthetic of a casual country kitchen, the Granby Collection is an inviting gathering spot for mealtime with family and friends. Traditional 72-inch dining height leg table with 6 drawers located on the ends and sides of the apron and storage display shelf base. The two-tone look of the acacia and pine solids base, finished in antique white, and the elm veneer of the table’s top, finished in a rosy brown, present as a harmonious combination of color. Also available for the 72-inch table – side chair, bench and server."}
{"title":"710-72 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/129/71072_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the rectangular traditional dining height table. Dining height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"710-36RD Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/112/71036RD_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the round counter height table. Counter height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"5703 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nStonington Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200924/95/5703_dining__l.jpg","description":"The traditional styling that comprises the design of the Stonington Collection creates an elegant country look for your dining room. Oak and walnut-inlay veneers are finished in a 2-tone brown and charcoal creating a perfect contrast that highlights the distinct patterns of each wood’s grain. A self-storing extension leaf allows for both convenient placement and expansion of your table to fit your desired number of guests. The trestle base that supports the tabletop features dramatically curved posts that lend to the classic design. The wood-framed armchair and side chair feature beige fabric seats and backs with accenting nailhead trim. Providing additional display and storage space within your dining room is the available server. Antique brass-finished ring-pull and knob hardware front the drawers and doors of the server."}
{"title":"5106BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEdgar Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/19/5106BK_dining__l.jpg","description":"Richly hued faux marble tops the metal counter height table base in the three-piece Edgar Collection. Vertical slat detailing provides stylish detail to this convenient table offering. Two black faux leather covered barstools complement the collection while easily storing beneath the table allowing for placement in the coziest of dining spaces."}
{"title":"586 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmeillia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/108/586_dining__l.jpg","description":"Alive with an exciting Arts & Crafts flair, the contemporary style of Ameillia Collection uses smooth dark oak finish and clean line design to create an inviting atmosphere to enhance your dining experience. The contemporary design appeals to the sense with its subtle attention to details. Chair seat and bench seat feature easy to clean dark brown faux leather."}
{"title":"5800WH-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAsher Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/fde29413ce034e2d925985612cdcd4fc.jpg","description":"The transitional style of the Asher Collection creates a versatile platform to inspire your casual dining room décor. The round counter height table’s support base features a display shelf that allows for quick and open access to your tabletop accessories. The antique white finish over acacia veneer serves to highlight the wood’s grain while allowing for maximum versatility in decorative accenting. The coordinating wood-framed counter height chairs feature light brown fabric seats for complementing contrast."}
{"title":"5163 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nUniversity Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/27/516348_dining__l.jpg","description":"Perfectly scaled to seat four, the transitionally styled University Collection will be the perfect addition to your cozy dining space. Book-matched mindy veneer is highlighted with a gray finish. The chair seats and backs are covered in a neutral gray fabric, providing perfect complement to the table."}
{"title":"5800BK-48RD Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAsher Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/ccd242ff4b734bcdb7eb00ccfcbe6a18.jpg","description":"The transitional style of the Asher Collection creates a versatile platform to inspire your casual dining room décor. The round dining height table’s support base features a display shelf that allows for quick and open access to your tabletop accessories. The brown and black finish over acacia veneer serves to highlight the wood’s grain while allowing for maximum versatility in decorative accenting. The coordinating wood-framed dining height chairs feature beige fabric seats for complementing contrast."}
{"title":"2601-48 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTempe Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/4d4c63e61d724cf6a785930564816873.jpg","description":"With a scale appropriate for any number of smaller dining spaces, the Tempe Collection will provide the look and style you want in your home. The transitional feel of the group comes from the richly hued faux marble table top and the minimalistic design of the brown faux leather chairs. The traditional dining table and chair are constructed of metal in black finish."}
{"title":"5477N Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOrsina Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210223/159/5477N9620dining__l.jpg","description":"Casting a glamorous reflection of your personal style, the Orsina Collection will dazzle your friends and family as they enter the sophisticated dining space you have created. A sparkling silver finish enhances the mirrored table apron and fronts of the server while the pearl faux leather of the accompanying chairs lends elegant contrast. Crystal button tufting lends additional sparkle to the collection. The server provides ample drawer and behind door storage allows for the safe keeping of your tabletop accessories."}
{"title":"2615DC-96 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMarston Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/318d8fee4a2e4551a5c3df929db23b36.jpg","description":"Refined elegance is exemplified in the design of the Marston Collection. With three available table options, there is a perfect match for your home – A double pedestal base rises to support the clipped-corner rectangular tabletop of the 96-inch table is flanked by chairs that feature turned front legs and nail head accent, along with a neutral tone fabric that covers the seats and backs. In support of the collection are the functional china and server. Featuring drawer and door storage, each with polished chrome tone cup pull and knob hardware, you can be assured of plentiful space in which to stow or display your tabletop décor. The server also features a black melamine laminated top."}
{"title":"710-54SQ Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/124/71054SQ_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the square traditional dining height tables. Additional offering is the trestle table with black glass insert. Dining height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"5627GY-72 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranby Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200330/28/5627GY72205627GYS205627GY13205627GY40_HP__l.jpg","description":"Inspired by the aesthetic of a casual country kitchen, the Granby Collection is an inviting gathering spot for mealtime with family and friends. A two-tone finish of the dining height table presents as a harmonious combination of color. The gray fabric seat complements antique gray finished side chair frame. 6-drawer on table apron and a 3-door server provide ample space in which to store your tabletop accessories."}
{"title":"5415RF Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSedley Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190918/83a5740f23834017a327792b66f624cb.jpg","description":"Whether your home leans to transitional or contemporary design, the Sedley Collection will be the perfect fit for your casual dining needs. From the distinct walnut veneer pattern to the unique cut-away design of the trestle table base, bench, and server, each design component lends to placement in a variety of dining spaces. The chocolate brown tone of the chair fabric complement the finish of the group. Convenience factors in the self-storing table leaf, while the server provides additional function with sliding doors that open to reveal wine bottle rack and shelf storage. Drawer storage with recessed pull hardware features prominently at the center of the server."}
{"title":"5056 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCreswell Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/55c43258392e4f0ebf4d011d1846174c.jpg","description":"Classic elements of traditional style are blended to create an elegant casual dining experience in the Creswell Collection. A dark cherry finish compliments the veneer pattern, lending to the traditional look, with turned legs further enhancing the look of the table, server, and side chairs. The intertwining curves of the chair backs continue their design on the door fronts of the coordinating server. Each chair features padded seating covered with brown faux leather."}
{"title":"5442-96 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVermillion Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/382/544296_dining__l.jpg","description":"Designed for the modern traditional home, the Vermillion Collection is a light and airy take on the themes of classic style and refined elegance. Enhancing the distinct grain of oak veneer is a subtle bisque finish. Neutral-tone button-tufted fabric covers the host and side chairs of the collection, each adorned with nailhead accent and coordinating wood legs. The trestle base of the table provides solid support and unique decorative touch. Storage space comes in the form of the accompanying server that features elegant framing over the antiqued mirror doors."}
{"title":"5441 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSarasota Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/583/5441_dining__l.jpg","description":"With a style that fits the transitional aesthetic of your home, the Sarasota Collection is sure to become a perfect platform for your mealtime activities. Ash veneer is highlighted with a driftwood brown finish for a wonderfully weathered aesthetic. The table’s top catches your eye with its quadrant v-matched veneer pattern. The self-storing leaf allows for\nexpansion of the table to its full length of 102 inches."}
{"title":"5267RF Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nReid Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190717/8ee20ea976df46269bbc5c17756c3ab4.jpg","description":"A classic look for your traditional home, the Reid Collection offers an updated country style that will be a warm and inviting addition to your dining space.  A cherry finish graces the wood veneer of the group.  The rectangular table is supported by substantially appointed double turned leg bases while host and hostess chairs feature nailhead accent, neutral tone fabric and turned legs.  The tabletop extends to reveal a self-storing table leaf for quick and convenient placement.  The accompanying china provides ample space for display, drawer and behind door storage."}
{"title":"5447 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBayshore Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200910/534/544736XL_dining2__l.jpg","description":"Transitional aesthetic meets modern lines in the casually elegant Bayshore Collection. The rectangular oak veneer tabletop with leaf feature quartered book-match walnut inlay veneers with a heavily burnished finish. Supporting the uniquely veneered table top is a storage table base with a display shelf. Both tables are complimented by dark brown faux leather chairs that feature wood cap and legs."}
{"title":"710-72TR Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/132/71072TR_dining2__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the trestle table with black glass insert. Dining height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"5302C Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSaddleback Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/47/5302C_dining__l.jpg","description":"A space apart from the hustle and bustle of today’s hectic lives, this warm cherry finish gathering height table with four saddle back stools are designed for you to enjoy a good meal with or without your friends and families."}
{"title":"5773WH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaye Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/d8645e154b904efca8cd171a8a59245d.jpg","description":"Modern convenience is paired with transitional design to create the multi-functional Daye Collection. This casual dining set features built-in display shelf, two USB ports and seating for two. Mindy veneer is finished in two-tone white and gray. The wood-framed low-back chairs feature gray fabric seat covers for neutral accent to the collection’s finish."}
{"title":"5438-96  Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nToulon Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/3395c34fdbd344dd812780522236f0d2.jpg","description":"Bold curves provide elegant contrast to the unique look of the Toulon Collection. The heavily scrolled base supports of the table feature routing with dark pewter-finished metal trestle that connects. Distressed dark oak finish provides texture to the acacia veneer of the table and pine of the accompanying chairs. The optional bench takes shape with inspiration drawn from church pews, allowing for a look that will add a special touch to your dining room. The French provincial inspired routing lends decorative touch to the accompanying server, while dual drawer and door storage provides ample space to stow your tabletop accessories."}
{"title":"5538W Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFlorian Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/393/5538W_dining__l.jpg","description":"Ultra modern styling is exemplified with the design of the Florian Collection. White metal legs with clear glass top – for the perfect fit in your casual dining space. Faux leather covered seats in coordinating black or white complete the contemporary look."}
{"title":"5538BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFlorian Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/391/5538BK_dining__l.jpg","description":"Ultra modern styling is exemplified with the design of the Florian Collection. Black metal legs with black glass top – for the perfect fit in your casual dining space. Faux leather covered seats in coordinating black or white complete the contemporary look."}
{"title":"5070 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCristo Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211004/925e402a51754e8bac3a601a25bc8e4e.jpg","description":"Dark espresso wood legs serve as an elegant contrast to the neutral toned marble tabletop in the Cristo Collection. Brown faux leather covers the flanking chairs and optional 49-inch bench. The color combination strengthen the contemporary look of the Cristo Collection."}
{"title":"5503 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nYannis Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/354/5503__l.jpg","description":"Sleek contemporary styling provides the platform from which you will create your casual dining space in the Yannis Collection.  Ultra-bright high gloss finish of the tabletop and V-shaped support provides a distinct contrast to the high polish chrome base plate.  The continuous base of the accenting chairs rises to support gray faux leather seats with diamond pattern stitching providing additional visual interest.  A smooth glide system opens with ease to reveal the self-storing butterfly leaf."}
{"title":"5799 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGloversville Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200826/96/5799_dining__l.jpg","description":"With styling that hints at times gone past, the Gloversville Collection’s stately presence will be the perfect addition to your dining room. The pine solids of the 86-inch table are supported by a distinct trestle base, its curves providing bold accent to the table’s top. The upholstered armchair is complemented by the wood framed side chair, each featuring a neutral toned fabric and nailhead accent. The wood bench takes design inspiration\nfrom old-fashioned church pews, its curved arms giving way to the unfettered seating."}
{"title":"5567GY Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNashua Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210223/36/5567GY7220dining__l.jpg","description":"The Nashua’s transitional styling utilizes classic design elements to create a look that serves as the catalyst of the decorative versatility of your casual dining room. A gray finish over mango veneer highlights the wood’s grain. The table expands with the opening of a butterfly leaf, conveniently folding to store under the table’s top with ease. The accompanying wood-framed side chairs and available bench feature black faux leather padded seats. Providing additional storage space within your dining room is the Nashua Collection’s server. Drawer and behind door storage allow for tidy compartmentalization of your tabletop accessories while the wine rack and wine glass storage present with open display. Antique brass finished knob hardware front the drawers and doors of the server providing complementing contrast to the collection’s finish."}
{"title":"5569 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAvenhorn Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200825/120/556978_dining__l.jpg","description":"Modern styling is softened with the juxtaposition of metal finish and wood in the Avenhorn Collection. The wood table top and flanking chairs feature a gray finish that clearly accentuates the distinct grain pattern. Black-metal-finished wood framing supports both the table and available server. The gray fabric that covers the side and arm chairs creates additional visual contrast to the collection."}
{"title":"5606 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFideo Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/458/5606_dining__l.jpg","description":"Wood and metal are combined to create the rustic industrial style of the Fideo Collection. Metal framing supports the table and creates the profile of the wood-backed side chairs in this casual dining set. Pine solids and veneer are featured in a herringbone pattern and has been given a burnished finish to complement the gray metal frame."}
{"title":"5603RF Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTimbre Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201123/7e6213a13b574e6288c3fb342c6509c4.jpg","description":"The multifunctional design of the Timbre Collection will be the perfect addition to your dining nook. A built-in bookcase provides open display space to this counter height offering. Wire brushed acacia veneer is highlighted by a gray finish. Gray chenille fabric seats top the accompanying stools and feature nailhead accent for added decorative flair."}
{"title":"5597 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNelina Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/431/5597_dining__l.jpg","description":"The modern profile of the Nelina Collection pulls design inspiration from mid-century modern styling and updates it with the addition of padded, contoured chairs. The stark white faux leather covered chairs provide distinct contrast to the 2-tone espresso and natural finish of the walnut veneer. The round tabletop is supported by an angular base in this casual dining offering."}
{"title":"5544 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCodie Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210120/202/5544_dining__l.jpg","description":"The look of natural weathering is combined with the understated styling of rustic design in the Codie Collection. The look of saw marks on the distressed wood veneer lend perfectly to this trend forward style. Gray undertones play to the weathered look with brown burnishing lending distinct, yet natural contrast. Allowing for perfect placement in your home are the side chairs, with neutral tone fabric seats, and optional 50-inch wood bench. An accompanying server provides drawer and display storage for your tabletop accessories."}
{"title":"5656 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClover Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/474/565666_dining__l.jpg","description":"In a twist on expected rustic design, the Clover Collection’s light and inviting aesthetic creates a welcoming spot to enjoy your mealtime with family and friends. The grey finish of the wood table top is perfectly complimented by the weathered white of the table’s base, creating a warm two-tone look that fits right in with your modern farmhouse aesthetic. When the leaf is removed, the table’s shape transforms from oval to round. The wood chairs feature a notch hole for ease of movement and the two-tone finish that carries over from the table."}
{"title":"5447-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBayshore Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/343/54473620544724S_dining2__l.jpg","description":"Transitional aesthetic meets modern lines in the casually elegant Bayshore Collection. The 47.5-inch fixed oak veneer square table top feature quartered book-match walnut inlay veneers with a heavily burnished finish. Supporting the uniquely veneered table top is a storage table base with a display shelf. Both tables are complimented by dark brown faux leather chairs that feature wood cap and legs."}
{"title":"2425 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGriffin Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200910/401/242536_dining__l.jpg","description":"The transitional design of the five-piece Griffin Collection allows for versatile placement in a number of casual dining settings.  The wide ladder back chairs feature black faux leather seating that compliments the heavily espresso finish of this 40-inch fixed-top counter height table."}
{"title":"5494-106 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSavion Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/423/5494106_dining__l.jpg","description":"Sophisticated soft contemporary design is achieved in your dining room with the addition of the Savion Collection. Rectangular double pedestal table featuring a distinct birdcage style base. An espresso finish highlights the unique veneer pattern. Dramatic flair is lent to the design by the accompanying chairs. Neutral tone fabric covers the substantially sized roll back arm and side chairs. Reeded fronts on the server along with the serpentine profile further the elegance of this distinctly sophisticated collection."}
{"title":"5496 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMakah Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/5bc544f980a94221ae43bfc58a801ba2.jpg","description":"The look of Arts and Crafts styling is updated for the modern home in the Makah Collection. Classically framed chairs pair with the tapered leg table to create this casual dining look. A dark brown finish highlights the wood veneer allowing for the neutral tone of the seats to blend with little effort. The drawers of the server, table apron and chairs feature framing that lends accent to the classic look. The accompanying server features a double wine rack as well as drawer and behind door storage."}
{"title":"5400-36XL Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSchleiger Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210511/b8bd8edbfbf4483d802a8bb01183da8a.jpg","description":"Transitionally styled with a burnished brown finish, the Schleiger Collection features bold accenting and functional storage options. A sturdy storage base supports the metal and rivet banded counter-height table top, with swivel chairs and bench flanking allowing for versatile seating options for this industrial influenced collection. Metal and rivet banding with nailhead accent also features prominently on the open buffet, and mobile kitchen cart that are available for this collection."}
{"title":"2042 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWoodrow Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200727/64280391450841709e81581a08257661.jpg","description":"Industrial design is subtly used to achieve a cool look for your living room in the Woodrow Collection. Dark metal corner banding with rivet detail lends to the casual look of this leg table dining group. Melamine laminate features a weathered wood look that furthers the intended design. The flanking side chairs feature ladder-back design and black faux leather seats. Coordinating bedroom, occasional and home entertainment unit are also available."}
{"title":"5409-78 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKavanaugh Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/b7e65447014244d198ee1b0a146a26b9.jpg","description":"Subtle contemporary design is called into play for the styling of the Kavanaugh Collection. Lending a distinct look to the tabletop is a classic checkerboard veneer pattern which is highlighted by a dark brown, with gray undertone finish. Providing contrast to the table is the gray fabric coverings of the shallow cove back seats."}
{"title":"710-54 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDaisy Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/120/71054RD_dining__l.jpg","description":"Daisy Collection combines superb visual appearance and fine quality that you need in your dining area. Three distinct elegant flared tulip bases support beveled glass tabletops on the rectangular and round traditional dining height tables. Additional offering is the trestle table with black glass insert. Dining height chairs feature clean lines and sleek curves; available in both white faux leather and dark brown faux leather. The set is constructed of hardwood solids and veneers in a refreshing espresso finish."}
{"title":"2423W Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJunipero Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201227/72/2423W_dining__l.jpg","description":"Utilizing the traditional elements of mission styling, the Junipero Collection adds the feel of the Arts and Crafts design movement to your casual dining room. The counter height pedestal table base supports an oval top and features storage accessible behind the drop-panel door. Framing, unique to the classic style comprises design of the table base and coordinating counter height chairs. The white finish over oak veneer serves to highlight the wood’s grain."}
{"title":"1957 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJerrick Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200820/265/1957_dining__l.jpg","description":"Classic transitional design serves as a base for the natural qualities of the solid wood utilized to create the rustic look of the Jerrick Collection. The rustic look of the fixed-top dining table, bench, and coordinating chairs is enhanced by the burnished finish over the solid wood grain, allowing each plank to serve as a unique accent to the overall design of the casual dining group."}
{"title":"2456-64WM Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDecatur Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210719/109/2456-64WM2456S__l.jpg","description":"The casual Decatur Collection is the transitional style that you have been searching for in your dining space. Wood legs in espresso finish support both the white marble table top and chair seats. Covered in brown faux leather, the tufted accenting on the chair and bench lend not only to the design but also to your comfort, when you sit with family and friends over a casual meal."}
{"title":"5801 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAdina Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/bc3c11a4b0e2422391c5a031f27dd1cd.jpg","description":"The Adina Collection’s transitional style makes it a perfect fit for your casual dining space. A black finish is utilized over the ash veneer of the counter height leg table and legs of the coordinating counter height chairs. The chairs feature padded seats and backs that are covered in gray fabric, providing neutral complement to your home’s décor."}
{"title":"2469 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOklahoma Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200910/403/2469_dining__l.jpg","description":"Sturdy for the daily activities of your family, the cozy five-piece Oklahoma Collection is the perfect addition to your dining space. Substantial double notched legs – a design that carries to the brown faux leather seated chairs – support the double thick table top. The espresso finish along with the transitional design, allows for placement in a number of home designs."}
{"title":"1928-78NG Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCelandine Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190919/45/192878NG_dining20set__l.jpg","description":"The look of traditional design is updated for the modern traditional home in the Celandine Collection. The table leg of the collection stands proudly as the main platform of your formal dining room. Crystal tufting immediately draws the eyes to the subtle pearlized finish of the faux leather chair backs, while high polished knob hardware stands out from the silver finish of the server. Inset glass highlights the shagreen embossing accent of the table’s top and server top. The server features shagreen drawer fronts, built-in wine rack, drawer and behind door storage. With each of the aforementioned elements, subtle glamour will be achieved in the design of your elegant dining room."}
{"title":"2514BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNorman Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200727/e70c19d1294149849a49b8fabda754fd.jpg","description":"Perfectly scaled for a cozy dining area is the Norman Collection. The counter height table features double display shelves, providing ample storage and display space. Each chair, in this five-piece dining offering, has a double X-back design that lends a transitional feel. The black finish compliments the casual feel of this offering."}
{"title":"2423 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJunipero Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200916/77/2423_dining__l.jpg","description":"Utilizing the traditional elements of mission styling, the Junipero Collection adds the feel of the early 20th Century design movement to your casual dining room. The pedestal table base supports an oval top and features storage accessible behind the drop-panel door. Framing, unique to the classic style, carries from the chair backs to the table base. The dark cherry finish serves to highlight the wood veneer."}
{"title":"1715-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolverson Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200726/aa4dff42b5d34bb79d36f851daa93d86.jpg","description":"Heavily influenced by industrial design, the Holverson Collection will lend a unique look to your personal space. Gunmetal finished wood framing provides sturdy structure and profile to each piece in this collection. Faux rivets provide additional detail to the metal bracketing that is prominently on display. Fixed-top counter height allows for perfect placement within your casual dining space. Side chair for both table heights present the opportunity to customize seating to fit your lifestyle. A rustic brown milk crate finish is utilized to highlight the acacia veneer. The open display hutch paired with the drop front server base, provides ample display and behind door storage for your tabletop accessories."}
{"title":"1689-54 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210922/55/1689-54_dining__l.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your dining room. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a rich finish – driftwood charcoal over acacia solids and veneers – creates a collection that is worthy of your dining room. 54-inch round pedestal base table allows for perfect placement within your space. Pewter-finished hardware mounted on the functional drawers and doors of the china and server provides a subtle contrast to the wood’s dark finish. The behind glass door shelving of china top allows for convenient and unobscured access to your decorative tabletop accessories, while the buffet server, with its wood door and drawers, serves dual purpose as the china’s base and as a stand-alone sideboard."}
{"title":"1820 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMckewen Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190429/7eb5173ed34343a894b13fa5a5b9a341.jpg","description":"The sophisticated modern styling of the McKewen Collection brings refined design to the elegant space of your dining room. The oak veneer, over poplar solids, is finished in gray finish that is perfectly complemented by the neutral tone of the arm and side chair’s fabric and the vertically mounted nickel-finished metal hardware that centers each drawer and door front. Providing ample storage for your tabletop accessories are the available china and server. The china features glass fronted doors and shelves that allow for dramatic display while the server has wood fronted doors and drawers for more discrete storage. The wine bottle shelving and hanging wine glass rack further enhance the functional capability of the server."}
{"title":"2456-64 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDecatur Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210719/96/2456-64_dining__l.jpg","description":"The casual Decatur Collection is the transitional style that you have been searching for in your dining space. Wood legs in espresso finish support both the black marble table top and chair seats. Covered in brown faux leather, the tufted accenting on the chair and bench lend not only to the design but also to your comfort, when you sit with family and friends over a casual meal."}
{"title":"1689BR-54 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200726/ca0ed32f231e4f14a318742647d36527.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your dining room. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a light finish – brown wood over acacia solids and veneers – creates a collection that is worthy of your dining room. 54-inch round pedestal base table allows for perfect placement within your space. Pewter-finished hardware mounted on the functional drawers and doors of the china and server provides a subtle contrast to the wood’s finish. The behind glass door shelving of china top allows for convenient and unobscured access to your decorative tabletop accessories, while the buffet server, with its wood door and drawers, serves dual purpose as the china’s base and as a stand-alone sideboard."}
{"title":"5661 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGilman Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/480/5661_dining__l.jpg","description":"Classic elements of traditional styling lend timeless accent to your casual dining space with the addition of\nthe Gilman Collection. Turned legs provide support to the tabletop and wood seat chairs, creating the classic\nprofile that defines this casual 5-piece dining set. The neutral tone of the gray driftwood finish over birch veneer\nbecomes a canvas allowing for your decorative preferences to shine."}
{"title":"2466 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDandelion Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200727/d48c6c87260048a58902c3ca8c7eddd8.jpg","description":"Traditional style does not need to mean old and stuffy. Take the gracefully turned pedestal base and sweeping arm of the accenting chairs of the Dandelion Collection, and traditional style takes on a whole new meaning. The distressed dark brownish gray finish of the table is a fresh look, further complimented by the exquisitely soft grayish fabric covering each of the chairs. This collection is sure to be the highlight of your dining room."}
{"title":"2601-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTempe Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200817/c8803d81eac14e6d9e98b77cd0b0c808.jpg","description":"With a scale appropriate for any number of smaller dining spaces, the Tempe Collection will provide the look and style you want in your home. The transitional feel of the group comes from the richly hued faux marble table top and the minimalistic design of the brown faux leather chairs. The counter height table and chair are constructed of metal in black finish."}
{"title":"2547 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaeve Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200817/f500639255d7431597a5c39cd1c6e20c.jpg","description":"Lacking any appearance of pretension, the Maeve Collection provides a stylish spot for your family to enjoy their time together. A dark cherry finish on the table and wood frame chairs is complimented by the seats of brown faux leather covered chairs. The cutout that tops each chair back is a simple design element that lends graceful style to this modest dining collection."}
{"title":"1718GY Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBegonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210930/e1b789d1cc094845ab79454dfed2c59b.jpg","description":"Casual transitional styling lends versatility to the placement of the Begonia Collection in a number of dining room settings. The grayish brown finish and traditional styling of the table, chairs and server lends distinctly to the execution of different looks from traditional to country casual. Knob hardware punctuates the look of each framed drawer and door front on accompanying server. Behind glass door display storage and wine glass rack provide additional functionality neutral toned fabric chairs perch atop turned legs and feature nailhead accent that serves to define the chair back’s profile."}
{"title":"2538 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDevlin Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200727/684c125ea5e040529b1e5874ada7d740.jpg","description":"The Devlin Collection offers the classic look of transitional styling with a nod to the Arts and Craft movement all in a well appointed six-piece group. Neutral tone fabric covers the seats of the chairs and bench in the espresso finished collection. Notch accent completes the look of the collection."}
{"title":"2456-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDecatur Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210719/83/2456-36_dining__l.jpg","description":"The casual Decatur Collection is the transitional style that you have been searching for in your dining space. Wood legs in espresso finish support both the black marble table top and chair seats. Covered in brown faux leather, the tufted accenting on the chair and bench lend not only to the design but also to your comfort, when you sit with family and friends over a casual meal."}
{"title":"2544 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTeague Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210930/acc2eaf1b9104874b39788dd449ac1d4.jpg","description":"A natural selection for your transitional home, the Teague Collection will compliment your lifestyle. Faux marble is set in a diamond pattern in this casual dining offering. With brown faux leather seating and a espresso finish to compliment it all, this dining collection will be a welcome addition to your home."}
{"title":"5055 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNorwich Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/20171106/5055-82_mixing_color_2014D-10_161_l.jpg","description":"Traditional design elements are elegantly layered to create the beautiful Norwich Collection.  Shell motif, egg & dart molding, rope molding, ball and claw feet, with elegantly designed inlay begin the design journey. Book-match cherry veneer prominently highlights the top of the rectangular table and features oval inlay decorative accenting. The table is flanked by chairs that are accented by brown fabric seats. With the china glass fronted doors providing a view of your cherished tabletop accessories, there is also drawer and wood fronted cabinets that allow for additional storage space. The collection is offered in a dark cherry finish."}
{"title":"2546 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKeegan Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190911/69f53f78f30b43b48535d0b89bb8c046.jpg","description":"Exuding the sophisticated elegance that your formal dining room calls for, the Keegan Collection will wow your dinner guests. The china cabinet stands at attention, not only functioning as a storage facility for all of your tabletop finest, but also as the grand centerpiece of this stylish dining offering. For additional storage, or for smaller spaces, the server features wine storage and unique mirror accent that adds a small height to the standard server. Storage features prominently. The 96-inch tabletop with leg supports featuring a lovely veneer pattern that is highlighted by the rich cherry finish. Accenting hardware is featured in polished nickel. The complimenting chair features a neutral tone fabric seat and elegantly overlapping chair back design."}
{"title":"1649 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFrazier Park Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211004/80714ce71bfc497eb539bf45fbfa128e.jpg","description":"With a subtle lodge look that takes inspiration from design history, the classic styling of the Frazier Park Collection will help you create a dining room environment that is a reflection of your preference for\ntraditional spaces. The leg table’s apron features distinct framing that subtly defines the table’s profile. The brown cherry finish, that highlights the mindy veneer, provides rich character to the wood’s grain.\nThe uniquely styled side chairs feature wood framing and brown faux leather seats. Horizontal fixed hardware fronts the functional drawers and doors of the server and china, creating subtle contrast to the collection’s finish."}
{"title":"5602-24BKS1 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/448/56023620BKS1_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"1808 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRussian Hill Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200429/ac18a9a7607b43ea99b6cd0faae79d36.jpg","description":"Blending the classic aesthetic of traditional design is the Russian Hill Collection. The nod to Old World styling comes in elements such as dental, rope and bead molding, shell motifs and faux marble accent, this dining collection goes above and beyond to create the desired look. An elegant double pedestal table serves the main course of this refined collection. Acanthus scroll design encompasses the table apron and complement the wood frame fabric chairs. The stately china stands as the focal point topped with a carved shell accent and elaborate acanthus scroll design. The server features faux marble top, glass and wood door fronts, wine storage as well as service drawers. Further lending to the design of the china and server are the fixed antique finished hardware and pilaster accenting in the style of Corinthian columns. The Russian Hill Collection is offered in a traditional warm cherry finish with gold tipping solidifying the interpretation on traditional décor."}
{"title":"1958 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBevelle Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211212/128/1958-96_dining__l.jpg","description":"Modern glamour is exemplified in the design of the Bevelle Collection.  Acrylic crystals frame each piece in the collection, reflecting the light to create eye-catching drama.  The silver finish serves as the perfect complement to the high-polish decorative knob hardware of the china and server while medallion accents grace all pieces.  Providing contrast to finish is the dark gray faux leather of the side chairs and arm chairs.  A coordinating bedroom is also available."}
{"title":"5713WT Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConnected Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/38/5713WT_dining__l.jpg","description":"The elevated dining experience that the Connected Collection provides will fuel your device’s battery life while you fuel yourself. The convenience of built-in USB ports and A/C power turns your casual dining area into an efficient recharging station. The four-piece pack of the Connected Collection includes a counter height table and three barstools. A single drawer allows for discrete storage on the table’s side apron. As a neutral pallet for your decorative preference, the collection features a white finish, with the neutral gray tone of the barstool’s seats providing subtle accent."}
{"title":"5710 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBinghampton Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/18/5710_dining__l.jpg","description":"The transitionally styled table is uniquely accented by the modern lines of the accompanying chairs in the Binghampton Collection. Neutral tone fabric seats present complementing contrast to the cherry finish over cherry veneer of the casual dining group. Four functional drawers are located on the table apron allowing for convenient storage of tabletop accessories within quick reach. The available bench complements the design of the side chairs, providing an option for customizing your seating experience."}
{"title":"5602-24BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/447/56023620BK_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"5599 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGlissand Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/434/5599_dining__l.jpg","description":"Sleek contemporary styling provides the platform which you will create your casual dining space in the Glissand Collection. Ultra-bright high gloss white and gray-taupe finish is paired on the table top and pedestal base, creating distinct contrast to the high polish chrome base plate. The continuous base of the accenting chairs rises to support gray-taupe faux leather seats with understated vertical stitching and chrome chair top accent providing additional visual interest. A smooth glide system opens with ease to reveal the self-storing butterfly leaf."}
{"title":"5562 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOratorio Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190430/c545a5b05d90406fb1c02f0d80d2748b.jpg","description":"The modern traditional styling of the Oratorio Collection paired with two distinct table offerings allow the creation of your dream dining room. Cherry finish over cherry veneer lends a classic look to the unique design of the rectangular pedestal table base. The ring shape of the rectangular table’s base provides distinct character while the substantial profile of the round table’s pedestal base lends sturdy, yet stylish support. The side chairs that flank the rectangular table feature neutral toned fabric and nailhead, complementing the sophisticated design. Barrel back, contoured swivel chairs surround the round table lending motion and unique design to the collection. An available server provides ample storage space for your table top accessories."}
{"title":"5655-36FA Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOxton Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/468/5655362024FA_dining__l.jpg","description":"Designed for your home’s rustic aesthetic, the Oxton Collection provides an ample platform for your mealtime and social activities. The rectangular counter height tabletop is supported by a functional storage base, allowing for discrete placement of your tabletop accessories. Contoured-back, wood-framed, 24-inch height chairs feature nailhead accent and luxurious to the touch fabric seats that perfectly complement the rustic look of the Oxton collection."}
{"title":"5724 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPalmer Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200826/19/5724_dining__l.jpg","description":"The design of the Palmer Collection allows for this 3-piece counter height table and barstools to tuck neatly against a wall, helping to create an open space within your casual dining area. Whether used as your primary dining spot or as an enhancement to your recreational room, the collection is a welcome space saver. The wire-brushed acacia veneer of the table and barstools is finished in grey for neutral accent to your home. The neutral tone of the linen-like padded seats of the two barstools further complements your space."}
{"title":"5104 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShankmen Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200824/17/5104_dining__l.jpg","description":"Wood rails top the brown faux leather covered chairs in the Shankmen Collection. Seating four comfortably, the round tabletop is supported by the gently curved legs of the display table base. The collection is offered in an espresso finish."}
{"title":"5592 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWesterlyn Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/427/5592_dining__l.jpg","description":"Scaled for the smaller dining space, and utilizing industrial influence, the Westerlyn Collection will be a cool addition to your home’s décor. Crafted of wood and metal, the stool seating tucks neatly under the tabletop. Ash veneer on the table’s top and stool seats is features a dark walnut finish that is accented by the black metal framing."}
{"title":"5713ES Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConnected Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/35/5713ES_dining__l.jpg","description":"The elevated dining experience that the Connected Collection provides will fuel your device’s battery life while you fuel yourself. The convenience of built-in USB ports and A/C power turns your casual dining area into an efficient recharging station. The four-piece pack of the Connected Collection includes a counter height table and three barstools. A single drawer allows for discrete storage on the table’s side apron. As a neutral pallet for your decorative preference, the collection features an espresso finish over ash veneer, with the neutral gray tone of the barstool’s seats providing subtle accent."}
{"title":"5713BK Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConnected Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/30/5713BK_dining__l.jpg","description":"The elevated dining experience that the Connected Collection provides will fuel your device’s battery life while you fuel yourself. The convenience of built-in USB ports and A/C power turns your casual dining area into an efficient recharging station. The four-piece pack of the Connected Collection includes a counter height table and three barstools. A single drawer allows for discrete storage on the table’s side apron. As a neutral pallet for your decorative preference, the collection features a black finish, with the neutral gray tone of the barstool’s seats providing subtle accent."}
{"title":"5578 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVisby Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201117/106/5578_dining__l.jpg","description":"Transitionally styled for smaller-scale dining spaces is the Visby Collection. This 4-piece dining group features a counter height table, two stools and one bench. The gray finish further lends versatility, being a neutral palette for your decorative preference."}
{"title":"5659 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSharon Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/478/5659_dining__l.jpg","description":"Designed to fit within your casual dining space, the Sharon Collection offers seating for 4 and convenient table base display\nstorage. The medium tone gray finish of the mindy veneer and unfettered lines of the collection’s profile lend to the transitional\nstyling of this set making it the perfect selection for a number of home environments. Neutral tone fabric covers the padded\nseats, and a built-in display shelf, within the table’s base, allows for convenient and functional display storage."}
{"title":"5686 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBracknell Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/502/5686_dining__l.jpg","description":"The rustic inspired design of the Bracknell Collection will\nbe the perfect fit in your casual dining or entertainment\nspace. Conveniently packaged as a table and two stools,\nthis industrial set features a brown cherry finish, turnbuckle\naccent and rustic distressing for maximum aesthetic effect."}
{"title":"5511-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDelmar Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/357/551136_dining__l.jpg","description":"The burnished finish and classic profile of the Delmar Collection will be a perfect fit for your modest casual dining space.  Splat back wood chairs with black faux leather seats flank the counter height table offering.  Routed detailing provides a linear focal point on the tables tops."}
{"title":"5602-24WT Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/450/56023620WT_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"5712 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDarla Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/28/571254_dining__l.jpg","description":"The transitional styling is paired with convenient function to create the Darla Collection.  Brown finish highlights the distinct grain of the mindy veneer of the table and accompanying chairs. The folding butterfly leaf allows for quick expansion of the table and convenient storage underneath the table’s top while an under-table shelf allows for open display for tabletop accessories. Pairing with the table are wood framed chairs which feature brown faux leather seats, perfectly complementing the collection’s finish."}
{"title":"5739 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAnderson Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/62/5739_dining__l.jpg","description":"Seating four with ease, the Anderson Collection will be the perfect addition to your casual dining space. The rectangular table features acacia veneer that is finished in an antique white. The accompanying wood framed chairs feature gray linen-like seats that perfectly pair with the rectangular table, completing the transitional look of this 5-piece packed set."}
{"title":"5709 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBlair Farm Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/12/5709_dining__l.jpg","description":"Designed in the transitional style for your casual dining space, the Blair Farm Collection will be a welcome space for your friends and family to gather during meals and social activities. The\nconvenient 7-piece packaging of the collection includes a table and six side chairs. Ladderback, wood\nframe chairs perfectly complement the unfettered design of the leg table. Light, neutral tone seats\ncreate complementing contrast to the brown finish over acacia veneer of the collection."}
{"title":"5693 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolders Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/504/5693_dining__l.jpg","description":"Designed in the transitional style for your casual dining space, the Holders Collection will be a\nwelcome space for your friends and family to gather during meals and social activities. The convenient\n6-piece packaging of the collection includes a table, four chairs and a bench. X-back, wood frame\nchairs perfectly complement the understated design of the table. Light, neutral tone seats create\ncomplementing contrast to the gray finish of the collection."}
{"title":"5674-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBaresford Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200825/236/567436_dining__l.jpg","description":"The transitional look of counter height dining of the Baresford Collection makes it the perfect addition to your casual dining room. Providing additional function beyond the tabletop are the 4 drawers located on the table apron – 2 per side - each featuring brushed nickel knob hardware. Ash veneer is highlighted by the gray finish that graces the collection. The wood framed chairs have padded seats that are covered in a neutral toned fabric for complementing contrast. The available server features wine rack and hanging glass storage, drawers and door storage making it the perfect functional accompaniment to your dining room."}
{"title":"1824PG Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCatalonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20191119/369/1824PG112_dining20set__l.jpg","description":"Old-World European styling is captured in the dramatically elegant Catalonia Collection. Traditional design elements reign at every turn – egg and dart molding, acanthus leaf carving, bead molding, gold tipping and extravagant carvings – creating a sophisticated look for your dining room. Each drawer front of the china and server features dark bronze fixed-drop hardware with decorative flourish that furthers the elegant appointments that embellish this collection. The shield back chairs feature elegantly patterned fabric seats. A traditional platinum gold finish is utilized to highlight the cherry veneer of the set and subtle decorative inlay pattern found on the table’s top."}
{"title":"5614 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWieland Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190430/62d99193d20547a4891509fcf7a6c970.jpg","description":"Styled for the transitional home, the Wieland Collection creates a classic profile for your casual dining area. The trestle base of the table paired with the mindy veneer, light rustic brown finish and brown faux leather seats create at table that is stylistically perfect for your environment. Furthering the design is the butterfly leaf that conveniently stores beneath the table’s top. The side chairs and available bench feature padded brown faux leather seats."}
{"title":"5706 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArmhurst Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/9/5706_dining__l.jpg","description":"Functionality beyond the expected use of a tabletop makes the Armhurst Collection the perfect addition to your casual dining space. The ends of the table feature drawers for quick and easy storage of your smaller table top accessories. Brown finish is a versatile option for your decorative preferences. Wood framed chairs feature vertical slat backs with neutral tone seats."}
{"title":"5627GY-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranby Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200330/59/5627GY36205627GY24205627GY40_HP__l.jpg","description":"Inspired by the aesthetic of a casual country kitchen, the Granby Collection is an inviting gathering spot for mealtime with family\nand friends. A two-tone finish of the counter height table presents as a harmonious combination of color. The gray fabric seat complements antique gray finished counter height chair frame. 4-drawer on table apron and a 3-door server provide ample space in which to store your tabletop accessories."}
{"title":"5602-24WTS1 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/451/56023620WTS1_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"5716 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBalin Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210421/14/5716_dining__l.jpg","description":"The joy of a shared meal creates bonds that last a lifetime and the addition of the Balin Collection will provide you, your family and friends a platform from which to enjoy those mealtime experiences. Central to the table’s top is the functional lazy-susan – spinning to provide easy access to each element of your feast. The mindy veneer is finished in dark brown lending depth to the wood’s grain. Three distinct seat options – double x-back, slat back and bench seating - allow for perfect placement within your decorative environment, with each featuring a brown seat cover for neutral accent."}
{"title":"5546 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCrawford Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211220/118/5546-84__l.jpg","description":"Blending traditional lines with modern glamour is the Crawford Collection. Finished in an eye-catching silver, the collection will be a dramatic addition to your home’s dining room. Cabriole legs lend traditional accent to all pieces in the collection. Unique accenting abounds in this collection, the tabletop features inset glass panels and the chairs are enhanced with crystal button tufting. The china lends visual impact as well as functional display and behind drawer and door storage are perfect for your prized table top accessories."}
{"title":"1372-78 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCrown Point Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201030/ec7b0ac235d04bb893de21c58892fe9c.jpg","description":"Adorn your dining area with Crown Point Collection. This grand scale casual dining in warm merlot finish is as strong and durable as they are stunning. Table top is constructed of mango veneer with strong support tapered legs. Attractive X-back dining chair with comfortable leather-look brown seat completes the unsophisticated streamlined look."}
{"title":"1372-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCrown Point Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201030/933c4cb86361432eaebdaf4a648a2659.jpg","description":"Adorn your dining area with Crown Point Collection. This grand scale casual dining in warm merlot finish is as strong and durable as they are stunning. Table top is constructed of mango veneer with strong support tapered legs. Attractive X-back dining chair with comfortable leather-look brown seat completes the unsophisticated streamlined look."}
{"title":"5516 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJanina Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/379/551666_dining__l.jpg","description":"At home in a casual country setting, the Janina Collection allows for a customizable look to match the décor of your dining space. The natural finish of the pine veneer serves to contrast the 4 available colors – teal, black, white, buttermilk – and allowing for an eclectic mix and match combination or singular color configuration."}
{"title":"5603WW Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTimbre Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/455/5603WW_dining__l.jpg","description":"The multifunctional design of the Timbre Collection will be the perfect addition to your dining nook. A built-in bookcase provides open display space to this counter height offering. Wire brushed acacia veneer is highlighted by a whitewash finish. Brown fabric seats top the accompanying stools and feature nailhead accent for added decorative flair."}
{"title":"5559N Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArasina Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210930/15761f39b6654cbfa48edfe752639791.jpg","description":"Boldly designed, richly finished and beautifully accented, the unique aesthetic of the Arasina Collection is for sure to draw your eye. The heavily appointed base supports of the table featuring a dark pewter-finished metal trestle that connects the two pedestals. Wire-brushed distressing provides texture to the acacia veneer of the table and pine of the accompanying chairs. The side chairs and optional bench takes shape with inspiration drawn from church pews, featuring cut-away accent that lend elegant, natural beauty to your dining room. The French provincial inspired routing lends decorative touch to the accompanying server, while drawer and door storage, along with wine bottle and wine glass display to create ample storage space within your dining room."}
{"title":"5808 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBonner Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201202/93/580868_dining__l.jpg","description":"With its transitional style the Bonner Collection presents as the perfect addition to your casual dining room. Solid pine lays a foundation for the acacia veneer of the group, with a brown finish lending highlight to the distinct veneer pattern. Coordinating wood-framed chairs feature an X-back and beige-hued fabric seats. A coordinating wood-framed bench, with beige seat, creates an alternate seating option."}
{"title":"1526 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBainbridge Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201125/e654554e5a7b410893c3ed73794964e2.jpg","description":"Following the trend of rusticated simplicity is the Bainbridge Collection. Melamine laminate perfectly mimics the look of weathered gray wood, lending to the rustic style. The transitional framing of the collection allows for placement in myriad casual dining room settings, creating the perfect canvas for your preferred decorative style. The fixed-top table and coordinating chairs - which feature gray fabric padded seats – seats six comfortably.  Black metal bar hardware fronts the doors and drawers of the coordinating server, providing complementing contrast to the gray finish."}
{"title":"5741-94 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSouthlake Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200826/42/5741_dining__l.jpg","description":"An elegant blend of traditional styling and rustic aesthetic combines to create the look of the Southlake Collection. The rectangular tabletop is supported by a double pedestal base, it’s urn profile lending distinct accent to your dining room. The wire-brushed rustic brown finish highlights the oak veneer and solid acacia construction. The brown linen-covered seats and backs of the side chairs provide complementing contrast to the table. An available bench provides an alternate seating option. The available server provides ample behind door and drawer storage in which to stow your tabletop accessories. The server doors and drawers feature nickel bar and knob hardware."}
{"title":"5674-72 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBaresford Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/499/567472_dining__l.jpg","description":"The transitional look of the Baresford Collection makes it the perfect addition to your casual dining room. Providing additional function beyond the tabletop are the 6 drawers located on the table apron – 3 per side - each featuring brushed nickel knob hardware. Ash veneer is highlighted by the gray finish that graces the collection. The wood framed chairs have padded seats that are covered in a neutral toned fabric for complementing contrast. The available server features wine rack and hanging glass storage, drawers and door storage making it the perfect functional accompaniment to your dining room."}
{"title":"5547-78 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMantello Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200825/63/5547782013_dining__l.jpg","description":"Transitionally styled for your home is the Mantello Collection. Offered in traditional dining height and counter height options, the collection’s cherry finish over mango veneer and classic styling will provide the perfect platform for your mealtime gatherings. Dark brown faux leather covers the available side chairs and wood-backed seat bench for the counter height table – with the selection of seating being configurable to your specific wants and needs. The available server provides functional storage for your tabletop accessories as well as wine bottle rack and glass display."}
{"title":"5532 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSona Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/386/553236__l.jpg","description":"Ultra-modern styling is executed flawlessly in the design of the Sona Collection. Immediately drawing your attention and providing stylistic drama to the casual dining group is the silver finished metal base and elongated cut-away faux leather backs of the flanking dining chairs. Silver finished metal table legs support the dual glass table top – the dining surface features a clear glass with black framing while the lower display shelf features black glass providing contrast and a finish that lends a modest touch to the over-the-top design of this casual dining offering."}
{"title":"5602-24WTS2 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/452/56023620WTS2_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"1689BR-96 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200726/24c7726b0aab427897a707caf2d61a9d.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your dining room. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a light finish – brown wood over acacia solids and veneers – creates a collection that is worthy of your dining room. 96-inch round pedestal base table allows for perfect placement within your space. Pewter-finished hardware mounted on the functional drawers and doors of the china and server provides a subtle contrast to the wood’s finish. The behind glass door shelving of china top allows for convenient and unobscured access to your decorative tabletop accessories, while the buffet server, with its wood door and drawers, serves dual purpose as the china’s base and as a stand-alone sideboard."}
{"title":"5602-24BKS2 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmsonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/449/56023620BKS2_dining__l.jpg","description":"Creating a subtle rustic look is the design of the Amsonia Collection. A gray finish graces the solid rubberwood dining group highlighting the veneer. Providing visual interest beyond the classic styling, are the alternate finishes of the accompanying chairs, offered in black sand-though and white sand-through. The chairs also feature a swivel mechanism with three distinct seat backs – X-back, divided X-back and vertical slat back, lending to ease of motion while seated."}
{"title":"2243-114 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Park Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210930/ef5d4144d7984076b083a398963c7313.jpg","description":"Walking into the dining room that is occupied by the Deryn Park Collection will immediately invoke your love of the traditional aesthetic. Stately from every angle, sophisticated design elements blend to create this beautiful collection. Burl inset flanks the book-match veneered cherry-finished tabletop. With two table options – the rectangular double pedestal base, and the oval topped single pedestal – the collection allows you the flexibility to fit the scale of your dining room. Each chair features an elaborately designed back and a richly hued fabric cover. The china and coordinating server provide ample display and storage space for your tabletop accessories. The cherry finish is highlighted by gold tipping that accentuates the traditional feel of elegant Deryn Park Collection."}
{"title":"2243-76 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Park Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20211004/ca40a4087ca84bbd8a79a8389e0f125e.jpg","description":"Walking into the dining room that is occupied by the Deryn Park Collection will immediately invoke your love of the traditional aesthetic. Stately from every angle, sophisticated design elements blend to create this beautiful collection. Burl inset flanks the book-match veneered cherry-finished tabletop. With two table options – the rectangular double pedestal base, and the oval topped single pedestal – the collection allows you the flexibility to fit the scale of your dining room. Each chair features an elaborately designed back and a richly hued fabric cover. The china and coordinating server provide ample display and storage space for your tabletop accessories. The cherry finish is highlighted by gold tipping that accentuates the traditional feel of elegant Deryn Park Collection."}
{"title":"1715-94 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolverson Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200726/dd5eb7861f9d43b3a871cbe0498a95ec.jpg","description":"Heavily influenced by industrial design, the Holverson Collection will lend a unique look to your personal space. Gunmetal finished wood framing provides sturdy structure and profile to each piece in this collection. Faux rivets provide additional detail to the metal bracketing that is prominently on display. Rectangular dining height table allows for perfect placement within your casual dining space. Side chair for both table heights present the opportunity to customize seating to fit your lifestyle. A rustic brown milk crate finish is utilized to highlight the acacia veneer. The open display hutch paired with the drop front server base, provides ample display and behind door storage for your tabletop accessories."}
{"title":"5566 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAppert Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20201201/408/55663620BK_dining__l.jpg","description":"Perfectly styled for your casual dining room is the Appert Collection. This counter height offering features a dark gray metal base – with built in wine rack – that serves to support the wood top which frames a black rectangular glass insert. The round seats and back supports of the accompanying chairs are covered in faux leather."}
{"title":"1689-96 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCardano Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20210922/54/1689-96_dining__l.jpg","description":"The solid transitional styling of the Cardano Collection creates an impactful design presence in your dining room. Utilizing distinct accent techniques – plank effect, rasping, saw marks – and pairing them with traditional framing and a rich finish – driftwood charcoal over acacia solids and veneers – creates a collection that is worthy of your dining room. 96-inch rectangular double pedestal trestle base table allows for perfect placement within your space. Pewter-finished hardware mounted on the functional drawers and doors of the china and server provides a subtle contrast to the wood’s dark finish. The behind glass door shelving of china top allows for convenient and unobscured access to your decorative tabletop accessories, while the buffet server, with its wood door and drawers, serves dual purpose as the china’s base and as a stand-alone sideboard."}
{"title":"1824 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCatalonia Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20190613/a5a1ad40c35b468f84a8d7c103270fb7.jpg","description":"Old-World European styling is captured in the dramatically elegant Catalonia Collection. Traditional design elements reign at every turn – egg and dart molding, acanthus leaf carving, bead molding, gold tipping and extravagant carvings – creating a sophisticated look for your dining room. Each drawer front of the china and server features dark bronze fixed-drop hardware with decorative flourish that furthers the elegant appointments that embellish this collection. The shield back chairs feature elegantly patterned fabric seats. A traditional cherry finish is utilized to highlight the cherry veneer of the set and subtle decorative inlay pattern found on the table’s top."}
{"title":"1682-108 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHeath Court Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200726/028e85954138438b9ddd55bd47383593.jpg","description":"The elegant profile of the Heath Court Collection is comprised of classic elements that have been combined to create the perfect addition to your home’s traditional décor. The formal styling of the table includes classic elements such as the turned double pedestal trestle base, routed table edge and decorative wood grain. The neutral hued brown fabric sets the tone for the refined presentation of the wood framed side chairs and armchairs. The white oak veneer that graces the collection is highlighted with a brown oak finish. The china features elegant glass-fronted behind door display shelving as well as wood doors and doors that provide more discrete storage space. The buffet server’s behind door and drawer storage provides ample space for your tabletop accessories. Providing a reflection to the presentation of the Heath Court Collection is the wood framed mirror."}
{"title":"5547-36 Dining\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMantello Collection","main category":"DINING","sub category":"Dining Room Collections","img":"https://www.homelegance.com/u/HMLG/20200825/65/5547362024BH_dining__l.jpg","description":"Transitionally styled for your home is the Mantello Collection. Offered in traditional dining height and counter height options, the collection’s cherry finish over mango veneer and classic styling will provide the perfect platform for your mealtime gatherings. Dark brown faux leather covers the available side chairs and traditional flat seat bench for the dining height table – with the selection of seating being configurable to your specific wants and needs. The available server provides functional storage for your tabletop accessories as well as wine bottle rack and glass display."}
