{"title":"9957CH-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLantana Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/648/9957CH_Sectiona__l.jpg","description":"Subtle traditional styling provides a clean and classic look for your home in the Lantana Collection. The sectional allows for the perfect placement within your living room. Chocolate fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors. Also available in gray."}
{"title":"9914 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosnay Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/10/9914_2LCN+CR+2R__l.jpg","description":"Plush seating creates the perfect platform for comfort in the Rosnay Collection. Manual motion mechanisms, when engaged with the pull of a side\nmounted tab, ease you from seated to reclined. Providing additional function to the collection is the center mounted console that features cupholders and lift-top storage."}
{"title":"9957GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLantana Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/175/9957GY3209957GY220360031__l.jpg","description":"Subtle traditional styling provides a clean and classic look for your home in the Lantana Collection. Available in love seat, sofa or sectional configuration, the options allow for the perfect placement within your living room. Gray fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"9928DBR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClarkdale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/159/9928DBR3209928DBR220358830__l.jpg","description":"At home in a number of settings, the transitionally styled Clarkdale Collection will be a welcome addition to your living space. Dark brown faux leather. Ample seating creates a plush platform for your relaxation, with each piece in the collection offering unique functionality. The dual reclining sofa features a drop-down center seatback that opens to reveal a table top and cup holders. The love seat is divided by a center console unit that has dual cup holders and hidden storage. The available reclining chair provides a comfortable spot in the form individual seating."}
{"title":"9916DG Sectional\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMcCafferty Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/175/9916DG_seating__l.jpg","description":"The versatility and functionality of the McCafferty Collection goes beyond that of a traditional sofa. Covered in dark gray fabric, the transitional profile of this seating group is complemented by stitch tufted and track-style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage."}
{"title":"9928BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClarkdale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/163/9928BLK3209928BLK220358830__l.jpg","description":"At home in a number of settings, the transitionally styled Clarkdale Collection will be a welcome addition to your living space. Black faux leather. Ample seating creates a plush platform for your relaxation, with each piece in the collection offering unique functionality. The dual reclining sofa features a drop-down center seatback that opens to reveal a table top and cup holders. The love seat is divided by a center console unit that has dual cup holders and hidden storage. The available reclining chair provides a comfortable spot in the form individual seating."}
{"title":"9989GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMadrona Hill Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201029/46/9989GY_seating__l.jpg","description":"Your vision for creating the ideal environment for rest and relaxation is made reality with the addition of the Madrona Hill Collection. This plush seating group is offered in a gray polished microfiber, with contrast stitching and decorative accent, making it a unique choice for transitional to modern homes. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. The available glider chair fully reclines and is perfect as an accompaniment to the collection."}
{"title":"9957CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLantana Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/127/9957CH3209957CH220360031__l.jpg","description":"Subtle traditional styling provides a clean and classic look for your home in the Lantana Collection. Available in love seat, sofa or sectional configuration, the options allow for the perfect placement within your living room. Chocolate fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"9999GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDarwan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210720/100/9999GY_seating__l.jpg","description":"Soft contemporary styling makes the Darwan Collection a comfortable and functional addition to your living room. Light gray, with dark gray contrast premium faux leather making the collection a bold decorative choice for your modern home. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. Providing additional function to the collection are the extended reclining mechanism installed on chair, love seat and sofa that allows for further extension than the average recliner."}
{"title":"9990GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nYerba Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210727/164/9990GY_seating__l.jpg","description":"Designed to make your downtime as relaxing as possible, the Yerba Collection will be a welcome addition to your home. Dark gray polished microfiber fabric covers the plush seating of this motion seating group. Function amenities include the unique drop down back center console and dual reclining ends of the sofa, center console with dual cup holders and lift top storage on the love seat and the accompanying chair completes the arrangement with a reclining mechanism. Providing additional function to the collection are the extended reclining mechanism installed on chair, love seat and sofa that allows for further extension than the average recliner."}
{"title":"9917DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDalal Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210805/18/9917DB_Sectiona__l.jpg","description":"It is evident upon first glance that the Dalal Collection was designed with your comfort in mind. Dark brown bi-cast vinyl covers this sofa chaise. The fully extended chaise allows for instant relaxation while the push back recliner gently eases you into a prone position."}
{"title":"9957GY-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLantana Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/654/9957GY_Sectiona__l.jpg","description":"Subtle traditional styling provides a clean and classic look for your home in the Lantana Collection. The sectional allows for the perfect placement within your living room. Gray fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors. Also available in chocolate."}
{"title":"9967 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClumber Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/617/9967-3SC__l.jpg","description":"Customizable to fit your space, the transitional design of the Clumber Collection is as functional as it is stylish. The chaise is reversible, allowing for placement based on your needs. The sofa chaise is offered in a sand-toned fabric, with contrasting toss pillows, making it a versatile platform for your decorative preferences."}
{"title":"9980 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nChai Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211017/130/9980_seating__l.jpg","description":"Plush seating is combined with soft contemporary styling that create the bold look of the Chai Collection. The two-tone brown fabric of the collection lends to placement in a number of decorative environments. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. The available chair fully reclines and features a glider mechanism for the ultimate relaxation experience."}
{"title":"9990DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nYerba Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210727/104/9990DB_seating__l.jpg","description":"Designed to make your downtime as relaxing as possible, the Yerba Collection will be a welcome addition to your home. Dark brown polished microfiber fabric covers the plush seating of this motion seating group. Function amenities include the unique drop down back center console and dual reclining ends of the sofa, center console with dual cup holders and lift top storage on the love seat and the accompanying chair completes the arrangement with a reclining mechanism. Providing additional function to the collection are the extended reclining mechanism installed on chair, love seat and sofa that allows for further extension than the average recliner."}
{"title":"9989DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMadrona Hill Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201029/29/9989DB_seating__l.jpg","description":"Your vision for creating the ideal environment for rest and relaxation is made reality with the addition of the Madrona Hill Collection. This plush seating group is offered in a dark brown polished microfiber, with contrast stitching and decorative accent, making it a unique choice for transitional to modern homes. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. The available glider chair fully reclines and is perfect as an accompaniment to the collection."}
{"title":"9560BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMackay Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/524/9560BU-3CL__l.jpg","description":"Designed for placement in your casual living space, the Mackay Collection provides a multifunctional seating space that meets your downtime needs. With a quick adjustment to the adjustable click mechanism, this armless sofa turns into a flat platform perfect for sleeping or just hanging out. The Mackay Collection is offered gray fabric for versatile placement within your decorative environment."}
{"title":"9529SVE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLambent Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/169/9529SVE_seating__l.jpg","description":"With a hint of glam the Lambent Collection was designed for placement in your modern living room. Silver-gray top-grain leather-match coverings - lend elegant accent to the decorative preferences that fill your space. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab."}
{"title":"9668BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenter Hill Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/83/9668BRW_seating__l.jpg","description":"With plush seating that is uncommon in most traditional looks, the design of Center Hill Collection will be a welcome addition to your living room. The traditional nail head accent lends an elegant statement to each piece and the easy recline mechanisms adds to the comfort. This lovely seating offering will provide your friends and family a warm environment to spend their quality moment.  The collection offered in dark brown faux leather with manual or power reclining mechanism."}
{"title":"9330GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosalie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/179/9330GY_seating__l.jpg","description":"The exquisite glamour that accents your home will pair perfectly with the Rosalie Collection. The dramatic curves of the sofa, love seat and chaise give way to traditional accent in the form of rolled arms, button-tufting, turned legs -with black finish- and nailhead trim. The velvet covering of the collection is offered in light gray to perfectly complement your living space."}
{"title":"9528DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKennett Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/152/9528DGY_seating__l.jpg","description":"Styled for the transitional home, the Kennett Collection is a comfortable and functional addition to your living room. Dark gray top-grain leather match, making the color palette a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage. Each offering  features touch controls that feature a USB port, allowing for easy access to your electronic devices as it recharges."}
{"title":"9526GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDiscus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/136/9526GY_seating__l.jpg","description":"The transitional design of the Discus Collection provides a classic look for your casual living room. The decorative versatility of the gray microfiber fabric covering allows for perfect placement in your living room. Contoured plush seating is enhanced by the dual end recliners of the sofa and love seat, with the chair providing a single seat that is a perfect complement to the rest of the seating options or as a stand-alone addition to your home. Creating additional function is the console of the love seat that provides secure storage of beverages and lift top storage. The reclining mechanism is engaged with a pull of the side mounted tabs, taking you from seated to prone in an easy motion."}
{"title":"9540GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSwallowtail Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/164/9540GY_seating__l.jpg","description":"Customizable for your casual living room’s available space, the Swallowtail Collection’s functionality goes beyond that of a traditional sofa. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise can be configured as right or left side placement based on the needs of your space."}
{"title":"9580GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLongvale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/533/9580GY3209580GY2209580GY1__l.jpg","description":"The Longvale Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and glider chair, feature manual reclining mechanisms, taking you from seated to prone with ease. The Longvale Collection is offered in gray polished microfiber, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9999DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDarwan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210720/87/9999DG_seating__l.jpg","description":"Soft contemporary styling makes the Darwan Collection a comfortable and functional addition to your living room. Dark gray, with light gray contrast premium faux leather making the collection a bold decorative choice for your modern home. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. Providing additional function to the collection are the extended reclining mechanism installed on chair, love seat and sofa that allows for further extension than the average recliner."}
{"title":"9537DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDenizen Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20190603/bdc25b24e5a441e8b8358285b91bb9b3.jpg","description":"In a departure from the expected minimalism of modern design, the Denizen Collection takes clean lines and blends substantially plush seating to create a bold addition for your living room. Top-grain leather-match is featured in dark gray, for neutral accent to your home. Stitch-tufting defines the profile and enhances your comfort by contouring the seating space. Also available in a lighter gray."}
{"title":"9311GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLanning Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/544/9311GY_seating__l.jpg","description":"The functional practicality of the Lanning Collection features a convenient pop-up bed and pop-up ottoman, providing the extra sleep space that so many homes need. The right-side facing two-seat unit reveals the pop-up bed extension, while the left side two-seat unit reveals the pop-up ottoman providing full extension of the farthest left side seat. Tufting lends classic accent while contrasting toss pillows complement the gray chenille fabric that covers the seating group, each element lending neutral accent to your home’s décor."}
{"title":"9327KH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nElmont Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201213/1a1147be280e403c9ad6a8f11010ea05.jpg","description":"Designed for perfect placement in myriad decorative home settings, the Elmont Collection pairs clean lines with plush seating to create a versatile option for your living room. The transitional styling of the sofa, love seat and chaise features a khaki textured fabric covering, track arms and loose back cushions. The chaise features a coordinating toss pillow."}
{"title":"9560BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMackay Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/519/9560BR_seating__l.jpg","description":"Designed for placement in your casual living space, the Mackay Collection provides a multifunctional seating space that meets your downtime needs. With a quick adjustment to the adjustable click mechanism, this armless sofa turns into a flat platform perfect for sleeping or just hanging out. The Mackay Collection is offered gray fabric for versatile placement within your decorative environment."}
{"title":"9700BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCranley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201001/222/9700BRW_seating__l.jpg","description":"The reclining Cranley Collection utilizes a release mechanism that with a gentle pull sends you straight into your ultimate comfort zone. This collection is offered in brown faux leather."}
{"title":"9326DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWelwyn Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/315/9326DG_seating__l.jpg","description":"The iconic style of the Welwyn Collection exemplifies the timeless look of traditional design. This Chesterfield-style seating group is comprised of a sofa, love seat and chair, each covered in dark gray velvet and features the classic accenting of button tufting, heavily rolled arms and nailhead accent. Cherry finished wood legs provide support while complementing the velvet’s neutral tone."}
{"title":"9569NFTP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMagnus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/105/9569NFTP_seatin__l.jpg","description":"Your comfort is elevated to the next level with the addition of the Magnus\nCollection. The sofa-chaise features a convenient pop-up sleeper that provides the extra sleep space that so many homes need. The chaise unit opens to reveal additional storage space furthering the multi-functional use of the collection."}
{"title":"9529GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLambent Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/166/9529GRY_seating__l.jpg","description":"With a hint of glam the Lambent Collection was designed for placement in your modern living room. Gray top-grain leather-match coverings - lend elegant accent to the decorative preferences that fill your space. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab."}
{"title":"9419 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMatteo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/40/9419_seating__l.jpg","description":"Sleek styling gives way to subtle curves creating the bold contemporary styling of the Matteo Collection. Color blocked gray and black faux leather covers the ultra-low-profile sofa, love seat and chair while chrome legs provide support. Perfect complement to the collection comes in the form of the coordinating glass-topped cocktail table."}
{"title":"9566DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDasha Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200105/123/9566DG__l.jpg","description":"Providing ample seating space for your home’s living room is the Dasha Collection. The clean lines of the sectional’s profile lend perfectly to your transitional to traditional décor choices. Comfort comes in the form of the tufted cushion backs and seats with the ottoman allowing for that perfect extra space to stretch out. Nailhead accent on the track style arms and a dark charcoal gray fabric cover further lend to the versatile styling."}
{"title":"9318CBN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRivermeade Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200924/515/9318CBN_seating__l.jpg","description":"The enveloping sensation you will experience as you relax into the Rivermeade Collection is an antidote to the stresses of the outside world. Carbon-hued soft textured plush microfiber covers the ample seating of this transitionally styled seating group. The geometric pattern of the toss pillows provides visual contrast as well as comfort."}
{"title":"9594BUE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVenture Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/54/9594BUE_seating__l.jpg","description":"Designed for the modern home, the Venture Collection provides a stylish seating option for your living room. The blue fabric that covers the collection creates a neutral palette for your decorative preferences to take shape. The rounded profile of the arm takes inspiration from retro styling while the chrome finish of the support legs lends a distinctly modern touch."}
{"title":"9560GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMackay Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/526/9560GY_seating__l.jpg","description":"Designed for placement in your casual living space, the Mackay Collection provides a multifunctional seating space that meets your downtime needs. With a quick adjustment to the adjustable click mechanism, this armless sofa turns into a flat platform perfect for sleeping or just hanging out. The Mackay Collection is offered gray fabric for versatile placement within your decorative environment."}
{"title":"9338BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTolley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/3a82c2015cb64cf7839fd75036448957.jpg","description":"Created for a modern space, the Tolley Collection’s vibrant hue and streamlined profile will perfectly accent your home’s living room. The seating group is supported by dark brown finished wood legs that complement the blue velvet upholstered cover."}
{"title":"9327CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nElmont Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201213/b9dafb1a8ac54093bfe2cec6df0e0742.jpg","description":"Designed for perfect placement in myriad decorative home settings, the Elmont Collection pairs clean lines with plush seating to create a versatile option for your living room. The transitional styling of the sofa, love seat and chaise features a charcoal textured fabric covering, track arms and loose back cushions. The chaise features a coordinating toss pillow."}
{"title":"8412 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFlorentina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/20171106/8412_all_636_l.jpg","description":"The elaborate designs of Old World Europe are treated with a distinct modern touch in the Florentina Collection. The eye-catching jewel tufting reflects with a brilliance intended to accentuate the dusky taupe coloring of the faux silk and the rich silver, with gold undertone finish of the show wood frame. With details such as shell and acanthus leaf scrolling, routed pilaster and cabriole legs, the traditional look of the collection is solidified. The accenting faux silk toss pillows feature traditional fringe detailing and a complementing detail pattern. The series 8412 Florentina Seating and Occasional Collections complement the Homelegance series 1867 Florentina Bedroom and Dining Collections."}
{"title":"9339GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHalton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/428/9339GY_seating__l.jpg","description":"An air of elegance surrounds the Halton Collection, from its deeply curved arms to its classic accents, this seating group will provide the traditional feel you are looking to achieve in the design of your living room. The contoured recessed arms that anchor the seating group are defined by nail head trim and supported by espresso finished legs, each element providing subtle contrast to the gray textured fabric upholstery. Further accent comes in the form of the contrast toss pillows."}
{"title":"9330DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosalie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/177/9330DG_seating__l.jpg","description":"The exquisite glamour that accents your home will pair perfectly with the Rosalie Collection. The dramatic curves of the sofa, love seat and chaise give way to traditional accent in the form of rolled arms, button-tufting, turned legs -with black finish- and nailhead trim. The velvet covering of the collection is offered in dark gray to perfectly complement your living space."}
{"title":"9422FS-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSherbrook Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/380/9422FS3PWH209422FS2PWH209422FS1PWH__l.jpg","description":"The Sherbrook Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and chair, feature power reclining mechanisms, power headrests and USB ports, allowing for quick access to your electronic devices as they charge. The Sherbrook Collection is offered in smoke chenille, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9527BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLance Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/148/9527BRW_seating__l.jpg","description":"The Lance Collection is a study in transitional styling and traditional accenting, culminating into the elegant design that is presented.  Dark brown top-grain leather match covers the plush seating of the group. Dual reclining ends create a comfortable platform for your relaxation with the touch of a button, which engages the power-driven reclining mechanism. Nailhead trim defines the profile of each piece in the collection. The love seat features a center mounted console with cupholders and storage. Each piece in the collection also features USB ports for quick and easy access to your devices as they charge."}
{"title":"9301GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClifton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210429/40/9301GRY3209301GRY220350830__l.jpg","description":"The modern profile of the Clifton Collection serves to provide comfort, function and style to your home’s casual living room. The gray polished microfiber that covers the plush arms and seating of the sofa, love seat and chair lends to the decorative versatility of the collection. The sofa features dual reclining ends and a drop down center seat back with cup-holders and tabletop, the dual glider reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9528BRG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKennett Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211220/117/9528BRG_seating__l.jpg","description":"Styled for the transitional home, the Kennett Collection is a comfortable and functional addition to your living room. Brown-gray top-grain leather match, making the color palette a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage. Each offering features touch controls that feature a USB port, allowing for easy access to your electronic devices as it recharges."}
{"title":"9580GY-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLongvale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/521/9580GY3PWH209580GY2PWH209580GY1PWH__l.jpg","description":"The Longvale Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and chair, feature power reclining mechanisms and power headrests for your ultimate comfort. The Longvale Collection is offered in gray polished microfiber, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9428DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAdelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/422/9428DG_seating__l.jpg","description":"With versatility of function, the Adelia Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. The seatback cushions are removable as well as reversible. Offered in cobblestone velvet cover for neutral decorative placement and soft touch, the classic profile furthers the placement ability within a number of home environments."}
{"title":"9203BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMalcolm Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211114/36/9203BRW_seating__l.jpg","description":"The elements that define modern style create a timeless look for your home with the addition of the Malcolm Collection. Track-style arms and defining welt lend a tailored aesthetic to the clean lines of the sofa, love seat, and chair making the collection well-suited for modern, transitional, rustic, or industrial inspired spaces. The collection is covered in brown faux leather upholstery further lending to the decorative versatility of this modern-classic offering."}
{"title":"9314GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCornish Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/215/9314GY_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Cornish Collection. The two-seat section of the sofa features a pull-out bed that, when extended, pairs to the chaise to create a bed. The Collection offered in blue, charcoal or gray textured fabric."}
{"title":"9526BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDiscus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/134/9526BR_seating__l.jpg","description":"The transitional design of the Discus Collection provides a classic look for your casual living room. The decorative versatility of the brown microfiber fabric covering allows for perfect placement in your living room. Contoured plush seating is enhanced by the dual end recliners of the sofa and love seat, with the chair providing a single seat that is a perfect complement to the rest of the seating options or as a stand-alone addition to your home. Creating additional function is the console of the love seat that provides secure storage of beverages and lift top storage. The reclining mechanism is engaged with a pull of the side mounted tabs, taking you from seated to prone in an easy motion."}
{"title":"9668NDB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenter Hill Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/81/9668NDB_seating__l.jpg","description":"With plush seating that is uncommon in most traditional looks, the design of Center Hill Collection will be a welcome addition to your living room. The traditional nailhead accent lends an elegant statement to each piece and the easy recline mechanisms adds to the comfort. This lovely seating offering will provide your friends and family a warm environment to spend their quality moment.  The collection offered in premium faux leather with manual or power reclining mechanism."}
{"title":"9435RF Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDriggs Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/506/9435RF_seating__l.jpg","description":"Turning your seating area into a platform for lounging is the versatile Driggs Collection. Click-motion mechanisms allow for the lounger back to go from upright to flat with little effort. The side arms are also adjustable, allowing for an even surface with the flat-adjusted back. The Driggs Collection is offered in gunmetal gray and silver-gray chenille, each a neutral canvas for your personal decorative preference."}
{"title":"9409GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMedora Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210805/15/9409GRY_seating__l.jpg","description":"The low profile and sleek styling of the Medora Collection lend modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa. The modified chaise provides ample space for relaxation. The optional gray or blue microfiber coverings and black finished metal legs complete the look of this sectional seating group."}
{"title":"9408DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAshland Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/666/9408DGY_seating__l.jpg","description":"Contemporary design is utilized to create the look of the Ashland Collection. The two-piece sectional features left-side two-seat configuration paired with a right-side chaise. Chrome legs provide support and lend accent to the dark gray top-grain leather with faux leather match covering."}
{"title":"9411GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMonty Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/582/9411GY_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Monty Collection. The reversible configuration of the three-seat sectional comes in the form of the ottoman that is utilized as the base for the reversible end chaise cushion, creating the option of a left or right extension of the sofa seating. The optional black, navy or gray velvet cover paired with the streamlined profile of the sofa lend to the modern look of the collection."}
{"title":"9406RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreenway Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/482/9406RN_seating__l.jpg","description":"With versatility of function, the Greenway Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. Offered in a velvet cover for decorative neutrality and soft touch, the classic design furthers the placement ability within a number of home environments."}
{"title":"9594DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVenture Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211004/098c717666e74df19c58a2d810ed8939.jpg","description":"Designed for the modern home, the Venture Collection provides a stylish\nseating option for your living room. The dark gray fabric that covers the\ncollection creates a neutral palette for your decorative preferences to take shape. The rounded profile of the arm takes inspiration from retro styling while the chrome finish of the support legs lends a distinctly modern touch."}
{"title":"9428CB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAdelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/420/9428CB_seating__l.jpg","description":"With versatility of function, the Adelia Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. The seatback cushions are removable as well as reversible. Offered in cobblestone velvet cover for neutral decorative placement and soft touch, the classic profile furthers the placement ability within a number of home environments."}
{"title":"9580TN-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLongvale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200623/64/9580TN3PWH209580TN2PWH209580TN1PWH__l.jpg","description":"The Longvale Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and chair, feature power reclining mechanisms, power headrests and USB port for your ultimate comfort. The Longvale Collection is offered in tan polished microfiber, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9594BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVenture Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/56/9594BR_seating__l.jpg","description":"Designed for the modern home, the Venture Collection provides a stylish seating option for your living room. The brown fabric that covers the collection creates a neutral palette for your decorative preferences to take shape. The rounded profile of the arm takes inspiration from retro styling while the chrome finish of the support legs lends a distinctly modern touch."}
{"title":"9328GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKeighly Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/67/9328GY_seating__l.jpg","description":"The sleek profile of the Keighly Collection will be the perfect complement to your modern living room. The seating group features a gray fabric cover for the ultimate decorative versatility, while pillow-top arms and plush seating create a platform that is perfect for your comfortable seated relaxation."}
{"title":"9407DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMichigan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200129/303/9407DG3209407DG2209407DG1__l.jpg","description":"Comfort and versatility merge with the addition of the Michigan Collection, its functionality going beyond that of a traditional sofa. Covered in dark gray polished microfiber, the transitional profile of this seating group is complemented by plush, contoured tufting and pillowtop arms."}
{"title":"9413IN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDickinson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/323/9413IN3209413IN2209413IN1__l.jpg","description":"The unfettered design of the Dickinson Collection allows for perfect placement in homes with decorative themes that range from modern to transitional. Offered in indigo chenille, each piece in the collection is featured with either manual motion reclining mechanisms. The manual motion mechanism is engaged with a pull of the side mounted tab, taking you from seated to reclined in an easy motion. The love seat features a console with cup holders and hidden storage space. The expanse of the streamlined pillow-top arms furthers the comfort level of your downtime."}
{"title":"9545BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nUlrich Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/2/9545BU_seating__l.jpg","description":"Your casual living room is the perfect setting for the modern Ulrich Collection. The bold blue hue of the fabric cover lends a pop of color to the versatile design of the seating group. Square ottomans serve as movable seating configuring to both your available space and situational need. The armless design allows for each piece to be moved within your environment with loose-back bolsters serving as support."}
{"title":"9335BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTiverton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/5a13d4af9df04dd59e3dcb50ef4c0546.jpg","description":"With a look that would be at home in the poshest of lounges, the Tiverton’s traditional design and classic accenting will be a grand addition to your classically styled living room. The Chesterfield-style seating group is offered in brown breathable faux leather upholstery and features the classic accenting of button tufting, defining welt and heavily rolled arms."}
{"title":"9579GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDyersburg Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20191101/50/9579GRY_6LCRRPW__l.jpg","description":"The versatility of the Dyersburg Collection allows for perfect placement within your space, creating a comfortable spot to unwind. The transitional styling of the sectional features plush pillow-back seating, contoured shape and gray premium faux leather. The right and left side end units feature a USB port and are available as power reclining chair or chaise, each allowing for seated extension. Expanding the length of the sectional are the available console unit – with cup holders and storage space – armless chair and power motion armless chair."}
{"title":"9546GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGuthrie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/11/9546GY_seating__l.jpg","description":"Try as you might, it will be hard to resist the urge to stay snuggled up on the sofa all day with the addition of the Guthrie Collection to your home. The substantial size of this sectional paired with down-topped high-density foam seats creates the perfect spot for relaxing. Grey fabric covers the loose back, reversible seats and cushions, with the covers being removeable for ease of care. The form of the sectional takes shape with the addition of the armless chairs and available ottoman, making this seating group as unique as the space it occupies."}
{"title":"9537GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDenizen Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20190603/9bb8c8a616734260a313935391f9bccb.jpg","description":"In a departure from the expected minimalism of modern design, the Denizen Collection takes clean lines and blends substantially plush seating to create a bold addition for your living room. Top-grain leather-match is featured in gray, for neutral accent to your home. Stitch-tufting defines the profile and enhances your comfort by contouring the seating space. Also available in dark gray."}
{"title":"9329BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRand Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/0a8b9a48be954d5ba1657cde715077fe.jpg","description":"The refined profile of Mid-Century inspired design gets a modern update in the Rand Collection. Velvet covers this stylish seating group, its vibrant blue perfectly complementing your modern decorative environment. Track arms flow to meet the base rails of the sofa, love and chair while back cushions are fronted by coordinating toss pillows, a bold monochromatic statement solidifying the classic look. Brown-finished wood legs provide support as well as subtle complementing contrast to the vibrant color of the group."}
{"title":"9426 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBoise Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200924/554/9426_seating__l.jpg","description":"With well-appointed features that create not only a comfortable seating experience but a functional one as well, the Boise Collection will be a welcome addition to your living room. The brown polished microfiber covering creates a style that will blend effortlessly with your transitional decorative preference. The sofa features dual reclining ends and a drop down center seat back with cup-holders and tabletop, the dual reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9340BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDorelle Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201217/442/9340BU_seating__l.jpg","description":"The modern style of the Dorelle Collection is a timeless pairing of clean lines and neutral color resulting in a seating collection that will pair with your home’s chic aesthetic. Segmented stitch tufting provides visual contrast to the plush, subtly contoured framing of the sofa, love seat and chair’s fronts. Blue fabric upholstery serves as the versatile palette to your decorative preferences."}
{"title":"9314BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCornish Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/193/9314BU_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Cornish Collection. The two-seat section of the sofa features a pull-out bed that, when extended, pairs to the chaise to create a bed. The Collection offered in blue, charcoal or gray textured fabric."}
{"title":"9205DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDadeville Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211129/24/9205DG_seating__l.jpg","description":"Transforming to provide comfort and convenience, the Dadeville Collection will be the ultimate addition to your casual living room. Wide-profile track arms are paired with plush seating, the transitional profile a versatile look that is furthered by the dark gray chenille cover. The right-side two-seater features a pull-out bed that expands your seating into a bed, while the right-side arm shelters two stools which serve as convenient additional seating. Rounding out the multi-functional design of the Dadeville Collection, the seat of the left-side chaise raises to expose hidden storage perfect for the extra blankets you’ll need while relaxing."}
{"title":"9405GY-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/e37f9c85f91b46008161ea86aa3a93b9.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The Putnam Collection is offered in gray polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"9428NV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAdelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/429/9428NV_seating__l.jpg","description":"With versatility of function, the Adelia Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. The seatback cushions are removable as well as reversible. Offered in cobblestone velvet cover for neutral decorative placement and soft touch, the classic profile furthers the placement ability within a number of home environments."}
{"title":"8480BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/33/8480BRW_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Dark brown premium faux leather covered."}
{"title":"9427DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nStrader Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/444/9427DG_seating__l.jpg","description":"With versatility of function, the Strader Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this convertible studio sofa engage to create a platform for sleeping or relaxing. Offered in a dove gray, dark gray or navy color fabric cover for decorative neutrality, the classic design is further enhanced with the tufted fronts of the seat, back and pop-up trundle."}
{"title":"9208GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBeven Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211215/55/9208GY_seating__l.jpg","description":"The retro profile of the Beven Collection utilizes clean lines and a neutral palette to effectively reflect on the popular Mid-Century Modern style that inspired its design. Gray velvet upholstery covers the streamlined group, with welt-defined track arms solidifying the classic look."}
{"title":"9419BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMatteo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/78/9419BU_seating__l.jpg","description":"Sleek styling gives way to subtle curves creating the bold contemporary styling of the Matteo Collection. Color blocked blue and black faux leather covers the ultra-low-profile sofa, love seat and chair while chrome legs provide support. Perfect complement to the collection comes in the form of the coordinating glass-topped cocktail table."}
{"title":"9636CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaurelton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201011/60/9636CC_seating__l.jpg","description":"Generous seating combined with functional touches makes the Laurelton Collection the perfect addition to your living room. The double glider reclining love seat’s center console features dual cup holders and hidden storage. Charcoal textured plush microfiber fabric are available as cover options for this amply appointed seating group."}
{"title":"9338GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTolley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/0e4af6281dc14c41a3114e962793cf33.jpg","description":"Created for a modern space, the Tolley Collection’s vibrant hue and streamlined profile will perfectly accent your home’s living room. The seating group is supported by dark brown finished wood legs that complement the gray velvet upholstered cover."}
{"title":"8403 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCassville Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/26/8403_seating__l.jpg","description":"Uniquely appointed for ultimate relaxation, the Cassville Collection will provide your living room with a comfortable place to spend your downtime. Dark brown faux leather covers the plush seating of this motion seating group. The sofa features a unique drop down back center console and dual reclining ends. The accompanying chair completes the arrangement with a reclining mechanism."}
{"title":"9313GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSolomon Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200820/183/9313GY_sectional3__l.jpg","description":"Configurable to your living room’s available space, the Solomon Collection provided a unique solution for your seating, storage, and sleep needs. The sectional is available in either a two-piece or four-piece configuration. When styled as two pieces the unit features seating for three with a pop-up hidden storage ottoman. The 4 piece unit is comprised of a two-seat segment, a corner unit, armless two-seat – with pull-out bed- and a pop-up hidden storage ottoman. Gray fabric covers the collection resulting in a neutral palette for your home’s transitional décor."}
{"title":"8329BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJarita Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200922/151/8329BLK_seating__l.jpg","description":"The classic transitional styling of the Jarita Collection creates a look that is perfect for your casual living space. Offered in black faux leather, each piece in the collection offers plush seats, backs and arms. With the pull of the manual reclining mechanism, you are taken from a seated to prone position in an easy motion."}
{"title":"8329BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJarita Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/425/8329BRW_seating__l.jpg","description":"The classic transitional styling of the Jarita Collection creates a look that is perfect for your casual living space. Offered in brown faux leather, each piece in the collection offers plush seats, backs and arms. With the pull of the manual reclining mechanism, you are taken from a seated to prone position in an easy motion."}
{"title":"9409BUE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMedora Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210805/9/9409BUE_seating__l.jpg","description":"The low profile and sleek styling of the Medora Collection lend modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa. The modified chaise provides ample space for relaxation. The optional gray or blue microfiber coverings and black finished metal legs complete the look of this sectional seating group."}
{"title":"9309GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHinsall Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211205/f73fb087af134493bc6aa4a5ea333c3a.jpg","description":"With a profile that hints at modern design and a color palette that serves as a neutral accent to your home, the Hinsall Collection will be a welcome and comfortable addition to your living room. Gray premium faux leather upholstery covers this seating group allowing for versatile decorative styling. Track arms and contour stitch tufting further lend to the modern look."}
{"title":"8480GRY-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/95/8480GRY_sectional__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Gray premium faux leather covered."}
{"title":"8401GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSlater Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/628/8401GY-3SC__l.jpg","description":"Customizable for your modest space, the Slater Collection features an end chaise that allows you to stretch out. Covered in gray fabric seating and gray faux leather accent, the modern lines of this seating group are further enhanced by track arms. The chaise can be configured as right or left side placement based on the needs of your space."}
{"title":"8490 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nColumbus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/b47090c84ab2450d8d831250016418e6.jpg","description":"With a configuration options that allow for placement that is perfect for your space, the Columbus Collection will be a welcome addition to your living room. Dark brown breathable faux leather resulting in a pleasurable seating experience. Contrast stitching furthers the transitional look. Bookending this substantially sized seating group are the left or right end units that are offered as reclining chair or push back chaise. Armless chair, console unit, corner seat, and armless reclining chair make up the middle part of this sectional offering."}
{"title":"9411NV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMonty Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/598/9411NV_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Monty Collection. The reversible configuration of the three-seat sectional comes in the form of the ottoman that is utilized as the base for the reversible end chaise cushion, creating the option of a left or right extension of the sofa seating. The optional black, navy or gray velvet cover paired with the streamlined profile of the sofa lend to the modern look of the collection."}
{"title":"8480RED-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/153/8480RED_sectional__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Red premium faux leather covered."}
{"title":"8378GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBarrington Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/13/8378GRY_seating__l.jpg","description":"Soft Contemporary styling lends a cool, classic look to your modern living space in the Barrington Collection. Stitch tufting provides soft contrast to the cleanly designed lines of this seating arrangement. The attached chaise lounge and accompanying ottoman provide the opportunity for putting your feet up while you enjoy your downtime. The seating group is offered in gray, black and brown faux leather."}
{"title":"8511BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTalon Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210723/29/8511BK_seating__l.jpg","description":"Designed with numerous room decors in mind, the transitional Talon Collection will be the perfect option for your living room. This stationary group features amply stuffed seating. Offered in black faux leather."}
{"title":"9427DV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nStrader Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/452/9427DV_seating__l.jpg","description":"With versatility of function, the Strader Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this convertible studio sofa engage to create a platform for sleeping or relaxing. Offered in a dove gray, dark gray or navy color fabric cover for decorative neutrality, the classic design is further enhanced with the tufted fronts of the seat, back and pop-up trundle."}
{"title":"9427NV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nStrader Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/458/9427NV_seating__l.jpg","description":"With versatility of function, the Strader Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this convertible studio sofa engage to create a platform for sleeping or relaxing. Offered in a dove gray, dark gray or navy color fabric cover for decorative neutrality, the classic design is further enhanced with the tufted fronts of the seat, back and pop-up trundle."}
{"title":"9405GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/2dcc317553144e98955f3f771bbe7198.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The available sofa, love seat and chair, feature manual reclining mechanisms and USB port, allowing for perfect placement within your available space. The glider love seat’s console and the sofa’s drop-down center seatback table feature cupholders and power receptacles. Expanding the options of the collection is the swivel glider reclining chair. The Putnam Collection is offered in gray polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"8401 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSlater Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/627/8401-3SC_2015S-__l.jpg","description":"Customizable for your modest space, the Slater Collection features an end chaise that allows you to stretch out. Covered in grayish-brown fabric seating and dark brown faux leather accent, the modern lines of this seating group are further enhanced by track arms. The chaise can be configured as right or left side placement based on the needs of your space."}
{"title":"9407DG-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMichigan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201104/6/9407DG_sectional__l.jpg","description":"Comfort and versatility merge with the addition of the Michigan Collection, its functionality going beyond that of a traditional sofa. Covered in dark gray polished microfiber, the transitional profile of this seating group is complemented by plush, contoured tufting and pillowtop arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise and 3-seater are available in both right and left side configurations based on the needs of your space."}
{"title":"9329GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRand Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/6ad95d4bcf704476b4c2a10c72d7d11a.jpg","description":"The refined profile of Mid-Century inspired design gets a modern update in the Rand Collection. Velvet covers this stylish seating group, its vibrant gray perfectly complementing your modern decorative environment. Track arms flow to meet the base rails of the sofa, love and chair while back cushions are fronted by coordinating toss pillows, a bold monochromatic statement solidifying the classic look. Brown-finished wood legs provide support as well as subtle complementing contrast to the vibrant color of the group."}
{"title":"9326GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWelwyn Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/340/9326GY_seating__l.jpg","description":"The iconic style of the Welwyn Collection exemplifies the timeless look of traditional design. This Chesterfield-style seating group is comprised of a sofa, love seat and chair, each covered in gray velvet and features the classic accenting of button tufting, heavily rolled arms and nailhead accent. Cherry finished wood legs provide support while complementing the velvet’s neutral tone."}
{"title":"9327BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nElmont Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/457/9327BK_seating__l.jpg","description":"Designed for perfect placement in myriad decorative home settings, the Elmont Collection pairs clean lines with plush seating to create a versatile option for your living room. The transitional styling of the sofa, love seat and chaise features a black textured fabric covering, track arms and loose back cushions. The chaise features a coordinating toss pillow."}
{"title":"9329CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRand Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/489/9329CH_seating__l.jpg","description":"The refined profile of Mid-Century inspired design gets a modern update in the Rand Collection. Velvet covers this stylish seating group, its vibrant chocolate perfectly complementing your modern decorative environment. Track arms flow to meet the base rails of the sofa, love and chair while back cushions are fronted by coordinating toss pillows, a bold monochromatic statement solidifying the classic look. Brown-finished wood legs provide support as well as subtle complementing contrast to the vibrant color of the group."}
{"title":"8480GRY-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/104/8480GRYPW_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Gray premium faux leather covered."}
{"title":"9580TN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLongvale Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200121/8b1d4d7587cf43e8ace8c567ee696ff1.jpg","description":"The Longvale Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and glider chair, feature manual reclining mechanisms, taking you from seated to prone with ease. The Longvale Collection is offered in tan polished microfiber, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9405GY-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/d2c9fefb0b5f4e02b98f3142f1d14f37.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The available sofa, love seat and chair, feature power reclining mechanisms and USB port, allowing for perfect placement within your available space. The love seat’s console and the sofa’s drop-down center seatback table feature cupholders and power receptacles. Expanding the options of the collection is the power reclining chair. The Putnam Collection is offered in gray polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"9333GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolleman Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201026/36/9333GY_seating__l.jpg","description":"A modern profile serves to lend visual contrast and support to the plush seating and pillow-top arms of the Holleman Collection. The gray textured fabric cover acts as a neutral palette for your decorative preferences. Channel tufting accents the lower seatbacks of the sofa, love seat and chair providing subtle accent to the collection."}
{"title":"9789TL Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPhelps Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/141/9789TL_seating__l.jpg","description":"Not every home is created the same and the unique design of the Phelps Collection allows for maximum flexibility with its reversible chaise. With 5 available coverings - coffee microfiber and 4 linen-like fabric options, teal, brown-gray, dark gray and blue - refined track arm, and comfortable seating, the collection's style is compatible in a number of settings. The matching ottoman provides additional comfort and function to your living area."}
{"title":"9789DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPhelps Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/138/9789DG_seating__l.jpg","description":"Not every home is created the same and the unique design of the Phelps Collection allows for maximum flexibility with its reversible chaise. With 5 available coverings - coffee microfiber and 4 linen-like fabric options, teal, brown-gray, dark gray and blue-refined track arm, and comfortable seating, the collection's style is compatible in a number of settings. The matching ottoman provides additional comfort and function to your living area."}
{"title":"8329CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJarita Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200910/22/8329CH_seating__l.jpg","description":"The classic transitional styling of the Jarita Collection creates a look that is perfect for your casual living space. Offered in chocolate microfiber, each piece in the collection offers plush seats, backs and arms. With the pull of the manual reclining mechanism, you are taken from a seated to prone position in an easy motion."}
{"title":"9479BRG-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenteroak Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211026/18/9479BRG-SC_seat__l.jpg","description":""}
{"title":"9499BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArgonne Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/665/9499BLK_seating__l.jpg","description":"Contemporary design is utilized to create the look of the Argonne Collection. The two-piece sectional features left-side two-seat configuration paired with a right-side chaise. Metal legs features a matte black finish, providing support and accent to the black leather with faux leather match covering."}
{"title":"9507CHC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaston Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/107/9507CHC_seating__l.jpg","description":"Providing a multitude of functional aspects, the Maston Collection will be the perfect addition to your modernly\nstyled living room. With a design that allows for this sectional to be configured as either a right or left side chaise,\nthe versatility will make placement within your space a breeze. The ottoman and opens to reveal additional storage\nfor your space, while the dropdown seatback provides dual cupholders and flat surface for secure placement of\nyour beverages and snacks. The collection is offered in three distinct colors – light gray, chocolate and dark gray –\nfor neutral decorative accent within your living room."}
{"title":"9347GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmberley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/263/9347GY_seating__l.jpg","description":"Contoured continuous framing surrounds the plush seats of the Amberley Collection, drawing inspiration from classic mid-century design, creating a sophisticated accent to your home’s living room. Coordinated toss pillows, walnut finished wood legs and the gray fabric that covers the seating group all work together to achieve the intended classic look."}
{"title":"9525GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPrice Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/399/9525GRY-3CL__l.jpg","description":"With functionality beyond the expected, the Price Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. Offered in a gray fabric cover for decorative neutrality, the classic design furthers the placement ability within a number of home environments."}
{"title":"9347BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmberley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/274/9347BU_seating__l.jpg","description":"Contoured continuous framing surrounds the plush seats of the Amberley Collection, drawing inspiration from classic mid-century design, creating a sophisticated accent to your home’s living room. Coordinated toss pillows, walnut finished wood legs and the blue fabric that covers the seating group all work together to achieve the intended classic look."}
{"title":"9346GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHinshaw Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210127/95/9346GY_seating__l.jpg","description":"The refined elegance of the Hinshaw Collection’s design presents as modern offering for your living room. Gray fabric lends neutral accent to your space, while contour stitching, subtly flared track arms and contrasting wood support legs all lend to the classic style."}
{"title":"9349DBU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOrina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210218/101/9349DBU20seating__l.jpg","description":"Glamorous from top to bottom, the Orina Collection exemplifies the radiant styling that defines your personal style. From the nailhead accent, dark blue velvet button-tufted cover, down to the acrylic legs that support the sofa, love seat and chair, each classic accent culminates to achieve the elegant aesthetic you desire for your home’s décor."}
{"title":"9734BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRubin Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/109/9734BK_seating__l.jpg","description":"With base design elements that touch retro styling, the Rubin Collection is a perfect option for your modern home. Black faux leather covering options to suit your personal needs and style, the collection allows for versatile placement in a number of living room decor themes."}
{"title":"9801GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAcadia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200520/407/9801GY3209801GY2209801GY1__l.jpg","description":"Subtle contemporary styling combines with plush seating making the Acadia Collection a comfortable addition to your home’s living room. Gray microfiber with gray faux leather accent, that are suitable for a number of home decorative environments. Plush seating and arm rests are framed by the sleek curve of the arm and defining stitch pattern. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat. The available chair fully reclines and is perfect as an accompaniment to the collection or as a stand-alone addition to your living room."}
{"title":"8427 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSavonburg Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/29/8427_seating__l.jpg","description":"With a design that is driven by trend and style, the classic look of the Savonburg Collection blends with a number of modern and traditional settings. This Chesterfield style seating group is offered in neutral tone fabric and features button tufting and a heavily rolled arm that transitions to encompass the entire back of each piece in the collection. The substantial size of this offering allows for maximum comfort that is enhanced by the accompanying toss pillows."}
{"title":"8327GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20181119/6718db560f5041718677a6504f1f015c.jpg","description":"Mid-Century modern design is the inspiration for the Deryn Collection. Wide, dramatically curved arms rise to the straight back that is synonymous with this classic style. Contrast toss pillows and an additional chair option are featured in a modern gray herringbone pattern to complement the gray fabric seating body covers. Tailored stitch tufting lends further accent to this thoroughly modern collection."}
{"title":"8367TP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEmilio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210728/50/8367TP_seating__l.jpg","description":"Subtle texture lends visual and tactile interest in the Emilio Collection. The set-up process allows you to configure the 3-seat unit to accommodate the chaise on either the left or right side, providing for perfect placement within your living space. The collection is offered in either taupe or chocolate, furthering the versatility of the sectional seating group."}
{"title":"9309BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHinsall Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211205/ea4694b8d31a42d9904f01fe0117030f.jpg","description":"With a profile that hints at modern design and a color palette that serves as a neutral accent to your home, the Hinsall Collection will be a welcome and comfortable addition to your living room. Premium faux leather upholstery covers the seating group and is available in black for versatile decorative styling. Track arms and contour stitch tufting further lend to the modern look."}
{"title":"9433GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFitch Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201026/93/9433GY_seating__l.jpg","description":"Mid-Century modern design is the inspiration for the Fitch Collection. Track arms rise to the straight back that is synonymous with this classic style. Contoured stitching on the seatback lends further accent to the modern profile. The Fitch Collection is offered in gray fabric, creating a neutral palette to inspire your decorative whim."}
{"title":"9300GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlexia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200820/140/9300GY_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Alexia Collection. The three-seat sectional features a right-side chaise that extends your seated position. The coordinating chair provides additional seating within your living space. The gray textured fabric cover of the collection offers a neutral palette for your home’s decor."}
{"title":"9340GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDorelle Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201217/443/9340GY_seating__l.jpg","description":"The modern style of the Dorelle Collection is a timeless pairing of clean lines and neutral color resulting in a seating collection that will pair with your home’s chic aesthetic. Segmented stitch tufting provides visual contrast to the plush, subtly contoured framing of the sofa, love seat and chair’s fronts. Gray fabric upholstery serves as the versatile palette to your decorative preferences."}
{"title":"8480BRW-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/32/8480BRWPW_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Dark brown premium faux leather covered."}
{"title":"9406BRG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreenway Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/473/9406BRG_seating__l.jpg","description":"With versatility of function, the Greenway Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. Offered in a velvet cover for decorative neutrality and soft touch, the classic design furthers the placement ability within a number of home environments."}
{"title":"9789CF Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPhelps Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/135/9789CF_seating__l.jpg","description":"Not every home is created the same and the unique design of the Phelps Collection allows for maximum flexibility with its reversible chaise. With 5 available coverings - coffee microfiber and 4 linen-like fabric options, teal, brown-gray, dark gray and blue - refined track arm, and comfortable seating, the collection’s style is compatible in a number of settings. The matching ottoman provides additional comfort and function to your living area."}
{"title":"9428RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAdelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/437/9428RN_seating__l.jpg","description":"With versatility of function, the Adelia Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. The seatback cushions are removable as well as reversible. Offered in cobblestone velvet cover for neutral decorative placement and soft touch, the classic profile furthers the placement ability within a number of home environments."}
{"title":"9433RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFitch Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201111/12/9433RN_seating__l.jpg","description":"Mid-Century modern design is the inspiration for the Fitch Collection. Track arms rise to the straight back that is synonymous with this classic style. Contoured stitching on the seatback lends further accent to the modern profile. The Fitch Collection is offered in orange fabric, creating a neutral palette to inspire your decorative whim."}
{"title":"9329RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRand Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201130/a70d488de90c48c7803b19477ef2f333.jpg","description":"The refined profile of Mid-Century inspired design gets a modern update in the Rand Collection. Velvet covers this stylish seating group, its vibrant orange perfectly complementing your modern decorative environment. Track arms flow to meet the base rails of the sofa, love and chair while back cushions are fronted by coordinating toss pillows, a bold monochromatic statement solidifying the classic look. Brown-finished wood legs provide support as well as subtle complementing contrast to the vibrant color of the group."}
{"title":"9338YW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTolley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210419/17/9338YW_seating__l.jpg","description":"Created for a modern space, the Tolley Collection’s vibrant hue and streamlined profile will perfectly accent your home’s living room. The seating group is supported by dark brown finished wood legs that complement the yellow velvet upholstered cover."}
{"title":"9411BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMonty Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/581/9411BK_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Monty Collection. The reversible configuration of the three-seat sectional comes in the form of the ottoman that is utilized as the base for the reversible end chaise cushion, creating the option of a left or right extension of the sofa seating. The optional black, navy or gray velvet cover paired with the streamlined profile of the sofa lend to the modern look of the collection."}
{"title":"9412GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCruz Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/383/9412GY_seating__l.jpg","description":"The low profile and sleek styling of the Cruz Collection lends modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa while the chaise of the sectional allows for extension and comfort while seated with the pull-out pop-up bed turning your sectional into a larger platform for maximum relaxation. The gray velvet covering pairs with the nickel finished metal legs and two matching toss pillows to complete the look of this sectional seating group."}
{"title":"8378BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBarrington Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/11/8378BRW_seating__l.jpg","description":"Soft Contemporary styling lends a cool, classic look to your modern living space in the Barrington Collection. Stitch tufting provides soft contrast to the cleanly designed lines of this seating arrangement. The attached chaise lounge and accompanying ottoman provide the opportunity for putting your feet up while you enjoy your downtime. The seating group is offered in gray, black and brown faux leather."}
{"title":"9700BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCranley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201001/226/9700BLK_seating__l.jpg","description":"The reclining Cranley Collection utilizes a release mechanism that with a gentle pull sends you straight into your ultimate comfort zone. This collection is offered in black faux leather."}
{"title":"8490GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nColumbus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200622/47/8490GRY_LCACCRARCNRR__l.jpg","description":"The Columbus Collection is perfect for your space with a configuration options that allow for placement. Gray premium faux leather resulting in a pleasurable seating experience. Bookending this substantially sized seating group are the left or right end units that are offered as reclining chair or push back chaise. Armless chair, console unit, corner seat, and armless reclining chair make up the middle part of this sectional offering."}
{"title":"9314CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCornish Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/196/9314CC_seating__l.jpg","description":"Casual contemporary styling creates a modern look for your living room in the Cornish Collection. The two-seat section of the sofa features a pull-out bed that, when extended, pairs to the chaise to create a bed. The Collection offered in blue, charcoal or gray textured fabric."}
{"title":"9406NBU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreenway Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/474/9406NBU_seating__l.jpg","description":"With versatility of function, the Greenway Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. Offered in a velvet cover for decorative neutrality and soft touch, the classic design furthers the placement ability within a number of home environments."}
{"title":"9636 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaurelton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20190919/436/96363209636220358130__l.jpg","description":"Generous seating combined with functional touches makes the Laurelton Collection the perfect addition to your living room. The double glider reclining love seat’s center console features dual cup holders and hidden storage. Chocolate textured plush microfiber fabric is available as cover options for this amply appointed seating group."}
{"title":"9337GB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConrad Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/264/9337GB_seating__l.jpg","description":"The streamlined design of the Conrad Collection pairs clean lines, gentle curves and neutral tone to create a fashionable modern look for your home’s living room. Grayish-brown hued top grain leather upholstery with faux leather match presents as the perfect accent to your decorative preferences, while the subtly flared arms and contoured stitch tufting accent lend to your comfort. The power reclining mechanisms of the sofa, love seat and chair are engaged with the touch of a side mounted button, taking you from seated to reclined with ease."}
{"title":"9317GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDesboro Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211214/15/9317GY_seating__l.jpg","description":"Classic lines create a transitional profile in the design of the Desboro Collection. The sofa-chaise can be configured to meet the needs of your space with the ability for left or right chaise placement. The gray chenille fabric upholstery, plush seating, rolled arms and contrasting toss pillows complete the versatile aesthetic."}
{"title":"9333DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHolleman Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201026/49/9333DG_seating__l.jpg","description":"A modern profile serves to lend visual contrast and support to the plush seating and pillow-top arms of the Holleman Collection. The dark gray textured fabric cover acts as a neutral palette for your decorative preferences. Channel tufting accents the lower seatbacks of the sofa, love seat and chair providing subtle accent to the collection."}
{"title":"8367CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEmilio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210728/38/8367CH_seating__l.jpg","description":"Subtle texture lends visual and tactile interest in the Emilio Collection. The set-up process allows you to configure the 3-seat unit to accommodate the chaise on either the left or right side, providing for perfect placement within your living space. The collection is offered in either taupe or chocolate, furthering the versatility of the sectional seating group."}
{"title":"9335GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTiverton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201221/0/9335GRY_seating__l.jpg","description":"With a look that would be at home in the poshest of lounges, the Tiverton’s traditional design and classic accenting will be a grand addition to your classically styled living room. The Chesterfield-style seating group is offered in gray breathable faux leather upholstery and features the classic accenting of button tufting, defining welt and heavily rolled arms."}
{"title":"9734CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRubin Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210817/19/9734CH_seating__l.jpg","description":"With base design elements that touch retro styling, the Rubin Collection is a perfect option for your modern home. Chocolate textured plush microfiber covering options to suit your personal needs and style, the collection allows for versatile placement in a number of living room decor themes."}
{"title":"9358SD Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDelara Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/320/9358SD_seating__l.jpg","description":"Beyond the comfort of a traditional sofa is the Delara Collection. The sofa-chaise’s configuration is reversible, allowing for the two-seat unit, with pop-up sleeper, to have a left or right-side placement alongside the chaise. The chaise unit opens to reveal additional storage space furthering the multi-functional use of the collection. The brown saddle hued breathable faux leather cover of the collection lends neutral accent to your space."}
{"title":"8233TT Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nThibodaux Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201018/0/8233TT_seating__l.jpg","description":"Classically styled for the most traditional of homes, the Thibodaux Collection will complete the vision you have for your elegant living room. Offered in brown fabric with faux leather accent, the collection combines these covers with a dramatic show wood frame that features carvings and scrolled arms. Contrast toss pillows complete the look."}
{"title":"9529DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLambent Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/164/9529DGY_seating__l.jpg","description":"With a hint of glam the Lambent Collection was designed for placement in your modern living room. Dark gray top-grain leather-match coverings - lend elegant accent to the decorative preferences that fill your space. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab."}
{"title":"9806GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBlue Lake Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210421/382/9806GRY3209806GRY220360230__l.jpg","description":"Inspired by classic frames of the past, the Blue Lake Collection is a study in casual sophistication. The sofa and love seat are covered in gray fabric that is enhanced by the modern geometric cresent pattern of the toss pillows and chair. An exposed wood base rail, welting and flared arm lend considerable style to the tailored profile of this classic collection. Reversible seat and back cushions further enhance the functionality of this seating group."}
{"title":"9468CC-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210422/496/9468CC_sectional__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s functionality goes beyond that of a traditional sofa. Covered in charcoal-hued chenille, the modern profile of this seating group is defined by its nailhead trim, loose back cushions and track-style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise and paired two-seater can be configured as right or left side placement based on the needs of your space. A coordinating swivel chair lends complementing decorative accent with its barrel shape and loose back cushion."}
{"title":"9355BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBerel Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/522/9355BR_seating__l.jpg","description":"Designed for the maximum utilization of function and an eye for modern styling, the Berel Collection is the perfect platform for you to indulge in comfort. The sectional’s configuration pairs the following components to create two versatile seating and sleeping options for your living room. The first option pairs the left-side two-seater featuring a pull-out bed, corner seating unit, armless two-seater, and right-side chaise with hidden storage. The second pairs the left-side two-seater, featuring a pull-out bed, with the right-side chaise featuring hidden storage. Contoured pillow-top arms and adjustable headrests lend to the comfortable seating arrangement. The brown chenille upholstered cover furthers your plush seating experience."}
{"title":"9815 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCroydon Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200823/99/9815_seating__l.jpg","description":"Elegantly designed for the traditional home, the Croydon Collection masterfully blends classic touches to create a seating offering that will be the perfect fit for your living room. Carvings are finished in a dark cherry and feature gold tipping for an added touch of elegance. The show wood frame defines the profile of the Collection while contrast toss pillows complete the look. Matching occasional options are available in the collection."}
{"title":"1032RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarlson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/151/1032RN_seating__l.jpg","description":"The frame of the Carlson Collection recalls a time when simplicity of profile was the height of style. The streamlined design of the subtly sloped wood arms and legs is finished in dark walnut which serves to highlight the orange velvet covering."}
{"title":"9348BUE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunleith Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210127/12/9348BUE_seating__l.jpg","description":"With a tailored look that is achieved with flared arms, clean lines, and a blue velvet cover, the sofa and love seat of the Dunleith Collection provide bold accent and soft touch to your living room’s décor. The modern profile of the seating group supports plush seatbacks that are fronted with stich-tufting each design element lending to your ultimate comfort."}
{"title":"9330BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosalie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/175/9330BU_seating__l.jpg","description":"The exquisite glamour that accents your home will pair perfectly with the Rosalie Collection. The dramatic curves of the sofa, love seat and chaise give way to traditional accent in the form of rolled arms, button-tufting, turned legs -with black finish- and nailhead trim. The velvet covering of the collection is offered in navy to perfectly complement your living space."}
{"title":"9403BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCadence Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/339/9403BU_seating__l.jpg","description":"The low profile and sleek styling of the Cadence Collection lends modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa while the chaise can be configured for right or left side placement, allowing for perfect placement within your living room. The pop-up chaise provides ample space for relaxation as well as provides storage within the unit, and the pull-out pop up ottoman extends your sectional into a larger platform. The optional gray, beige or blue microfiber coverings pair with black finished metal legs complete the look of this sectional seating group."}
{"title":"9349GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOrina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210218/102/9349GRY20seating__l.jpg","description":"Glamorous from top to bottom, the Orina Collection exemplifies the radiant styling that defines your personal style. From the nailhead accent, gray velvet button-tufted cover, down to the acrylic legs that support the sofa, love seat and chair, each classic accent culminates to achieve the elegant aesthetic you desire for your home’s décor."}
{"title":"9355GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBerel Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/576/9355GY_seating__l.jpg","description":"Designed for the maximum utilization of function and an eye for modern styling, the Berel Collection is the perfect platform for you to indulge in comfort. The sectional’s configuration pairs the following components to create two versatile seating and sleeping options for your living room: the first, a left-side two-seater (with pull-out bed), corner seating unit, armless two-seater, and right-side chaise (with hidden storage) – or the second option pairing the left side two-seater (with pull-out bed) and right side chaise (with hidden storage). Contoured pillow-top arms and adjustable headrests lend to the comfortable seating arrangement. The gray chenille upholstered cover furthers your plush seating experience."}
{"title":"9434GM Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBrimmer Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/499/9434GM_seating__l.jpg","description":"Turning your seating area into a platform for lounging is the versatile Brimmer Collection. Click-clack mechanisms allow for the multi-directional lounger back to go from upright to flat with little effort. The split-back end allows for the first adjustment from flat surface of the sleeper into a lounge position. The second adjusted position modifies the unit into a sofa. The Brimmer Collection is offered in gunmetal gray as a neutral canvas for your personal decorative preference."}
{"title":"9348BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunleith Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210127/85/9348BRW_seating__l.jpg","description":"With a tailored look that is achieved with flared arms, clean lines, and a brown velvet cover, the sofa and love seat of the Dunleith Collection provide bold accent and soft touch to your living room’s décor. The modern profile of the seating group supports plush seatbacks that are fronted with stich-tufting each design element lending to your ultimate comfort."}
{"title":"9470BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBriscoe Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/100/9470BR_seating__l.jpg","description":"With well-appointed features that create not only a comfortable seating experience but a functional one as well, the Briscoe Collection will be a welcome addition to your home. The brown premium faux leather covering creates a style that will blend effortlessly with your transitional decorative preference. The sofa features dual glider reclining ends and a drop down center seat back with cup-holders and tabletop, the dual glider reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9514SVE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMischa Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201112/11/9514SVE_seating__l.jpg","description":"Styled for the modern home, the Mischa Collection blends the luxurious feel of leather with the comfort of plush seating. The optional silver or dark gray top grain leather cover, with faux leather, enhances the sleek profile of the collection. Contoured pillow-top arms and black metal legs further enhance the modern stance."}
{"title":"8202GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSinclair Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201213/7e3df04542654d9f906ae9eefe9daa7b.jpg","description":"A hint of retro styling provides a clean and classic look for your contemporary home in the Sinclair Collection. Offered in a traditional seating or sectional configuration, the options allow for the perfect placement within your living room. Gray fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"9488BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranville Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/489/9488BR_seating__l.jpg","description":"The transitional styling of the Granville Collection pairs classic accent with versatile aesthetics, making the seating group a perfect addition to your home.  Offered in brown polished microfiber upholstery, each piece in the collection features manual reclining motion mechanisms for easy transition – going from seated to prone with a pull of a side mounted tab. The sofa and love seat feature dual reclining ends with the love seat featuring a console with cup holders and hidden storage space. The reclining chair also features a glider mechanism for a soothing rocking motion, sure to bring calm. Plush rolled arms, contoured seats and backs lend to your comfortable seating experience, while nailhead accent lends to the timeless look of the Granville Collection."}
{"title":"8206NF Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAram Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210512/153/8206NF203587__l.jpg","description":"With amply appointed offerings that create not only a comfortable seating experience but a functional one as well, the Aram Collection will be a welcome addition to your home. The seating group is offered in a brown polished microfiber or dark brown breathable faux leather for comfort and style that will blend effortlessly with your transitional decorative preference. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. Each piece in the collection has an individual function allowing for convenience and comfort. The sofa features dual reclining ends and a drop down center seat back with cup-holders, electric receptacles, USB port and tabletop space, the dual glider reclining ends of the love seat flank a center mounted console with storage, electric receptacles and cup-holders, and the reclining chair features a glider mechanism that allows for easy back and forth motion."}
{"title":"9544GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHowerton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/187/9544GY_seating__l.jpg","description":"Enveloping your body as you relax into its ample seating, the Howerton Collection provides an inviting platform for your downtime. Neutral gray fabric covers this sectional seating option, allowing for decorative flexibility within your environment. Loose back cushions and toss pillows lend to your ultimate comfort. The sloped arms create subtle contrast to the straight lines of the sectional’s profile."}
{"title":"9468DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/124/9468DG_seating__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s decoratively flexible style allows for placement in myriad living room settings. Covered in dark gray chenille, the profile of the sofa, love seat and chair are defined by nailhead trim, loose back cushions and track-style arms, creating a look that is perfect for your home’s living room."}
{"title":"9355CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBerel Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/560/9355CC_seating__l.jpg","description":"Designed for the maximum utilization of function and an eye for modern styling, the Berel Collection is the perfect platform for you to indulge in comfort. The sectional’s configuration pairs the following components to create two versatile seating and sleeping options for your living room: the first, a left-side two-seater (with pull-out bed), corner seating unit, armless two-seater, and right-side chaise (with hidden storage) – or the second option pairing the left side two-seater (with pull-out bed) and right side chaise (with hidden storage). Contoured pillow-top arms and adjustable headrests lend to the comfortable seating arrangement. The charcoal-hued chenille upholstered cover furthers your plush seating experience."}
{"title":"9514DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMischa Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201112/9/9514DGY_seating__l.jpg","description":"Styled for the modern home, the Mischa Collection blends the luxurious feel of leather with the comfort of plush seating. The optional silver or dark gray top grain leather cover, with faux leather, enhances the sleek profile of the collection. Contoured pillow-top arms and black metal legs further enhance the modern stance."}
{"title":"9479SDB-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenteroak Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211026/27/9479SDB-SC_seat__l.jpg","description":""}
{"title":"9479SDB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenteroak Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210426/33/9479SDB3209479SDB220368130__l.jpg","description":"The design of the Centeroak Collection provides a platform for your relaxing downtime. From the classic transitional style to the versatile neutral color of the optional sandy brown or brown-ish gray polished microfiber fabric coverings, this collection is the perfect addition to your living room. Plush seating features vertical tufting, pillow-top arms, each enhanced by the dual end recliners of the sofa and love seat, and the reclining chair. Creating additional function is the console of the love seat providing secure placement of beverages and lift top hidden storage. The reclining mechanism is engaged with a pull of the side mounted tabs, taking you from seated to prone in an easy motion."}
{"title":"9507GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaston Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/120/9507GRY_seating__l.jpg","description":"Providing a multitude of functional aspects, the Maston Collection will be the perfect addition to your modernly\nstyled living room. With a design that allows for this sectional to be configured as either a right or left side chaise,\nthe versatility will make placement within your space a breeze. The ottoman and opens to reveal additional storage\nfor your space, while the dropdown seatback provides dual cupholders and flat surface for secure placement of\nyour beverages and snacks. The collection is offered in three distinct colors – light gray, chocolate and dark gray –\nfor neutral decorative accent within your living room."}
{"title":"9488BR-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGranville Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201115/473/9488BRPW_seating__l.jpg","description":"The transitional styling of the Granville Collection pairs classic accent with versatile aesthetics, making the seating group a perfect addition to your home.  Offered in brown polished microfiber upholstery, each piece in the collection features power reclining motion mechanisms for easy transition – going from seated to prone in one smooth move. The sofa and love seat feature dual reclining ends with the love seat featuring a console with cup holders and hidden storage space. Plush rolled arms, contoured seats and backs lend to your comfortable seating experience, while nailhead accent lends to the timeless look of the Granville Collection."}
{"title":"8219 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVeloce Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/102/82193208219220821930__l.jpg","description":"Bringing to mind the sleek styling of an Italian race car, bold contemporary styling creates eye-catching drama for your living room with the Veloce Collection. Color blocked black and white faux leather covers the ultra-low profile seating and accompanying glass-topped cocktail table, while chrome legs provide support."}
{"title":"9479BRG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCenteroak Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200218/97/9479BRG3209479BRG2205627GY30__l.jpg","description":"The design of the Centeroak Collection provides a platform for your relaxing downtime. From the classic transitional style to the versatile neutral color of the brown-ish gray or sandy brown polished microfiber fabric covering, this collection is the perfect addition to your living room. Plush seating features vertical tufting, pillow-top arms, each enhanced by the dual end recliners of the sofa and love seat, and the reclining chair. Creating additional function is the console of the love seat providing secure placement of beverages and lift top hidden storage. The reclining mechanism is engaged with a pull of the side mounted tabs, taking you from seated to prone in an easy motion."}
{"title":"9336DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSloane Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/700/9336DG_seating__l.jpg","description":"Poised as a sophisticated and functional accent to your home, the Sloane Collection blends effortlessly into the modern aesthetic that permeates your personal style. The gray velvet that covers the sofa provides exquisite touch while the defining channel tufting lends visual contrast. Elegant tuxedo arms follow the contour of the sofa’s seating profile creating a tailored look perfect for your living space."}
{"title":"9808BUE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlfio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/168/9808BUE_sectional__l.jpg","description":"The contemporary look of the Alfio Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features pull-out ottoman. The available fabrics – blue or two-tone grey - adjustable headrests and the silver-colored feet complete the modern look and functionality of this unique seating collection."}
{"title":"9413CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDickinson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/294/9413CC3209413CC2209413CC1__l.jpg","description":"The unfettered design of the Dickinson Collection allows for perfect placement in homes with decorative themes that range from modern to transitional. Offered in charcoal chenille, each piece in the collection is featured with either manual motion reclining mechanisms. The manual motion mechanism is engaged with a pull of the side mounted tab, taking you from seated to reclined in an easy motion. The love seat features a console with cup holders and hidden storage space. The expanse of the streamlined pillow-top arms furthers the comfort level of your downtime."}
{"title":"9808STP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlfio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/183/9808STP_sectional__l.jpg","description":"The contemporary look of the Alfio Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features pull-out ottoman. The taupe fabric combined with adjustable headrests and the silver-colored feet further the modern look and functionality of this unique seating collection."}
{"title":"9360BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAntonio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/317/9360BLK_seating__l.jpg","description":"Easing you into plush relaxation, with just the push of a button, is the Antonio Collection. The sleek profile of the ultra-modern design transforms bringing you from your seated position to reclined via the power motion mechanism. The sofa, love seat and chair are supported by chrome finished metal legs and covered in black top grain leather match upholstery that further lends to the modern styling."}
{"title":"9208BK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBeven Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211215/54/9208BK_seating__l.jpg","description":"The retro profile of the Beven Collection utilizes clean lines and a neutral palette to effectively reflect on the popular Mid-Century Modern style that inspired its design. Black velvet upholstery covers the streamlined group, with welt-defined track arms solidifying the classic look."}
{"title":"9413IN-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDickinson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/308/9413IN3PWH209413IN2PWH209413IN1PWH__l.jpg","description":"The unfettered design of the Dickinson Collection allows for perfect placement in homes with decorative themes that range from modern to transitional. Offered in indigo chenille, each piece in the collection features power motion reclining mechanisms. The power enhanced units feature adjustable headrests and electronically assisted recline. The love seat features a console with cup holders and hidden storage space. The expanse of the streamlined pillow-top arms furthers the comfort level of your downtime."}
{"title":"9344BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOlcott Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210127/89/9344BR_seating__l.jpg","description":"The modern profile of the Olcott Collection has a hint of retro styling, creating a unique addition to your casual living room. The brown fabric upholstery that covers the collection provides a neutral palette for your decorative preferences to reign. Rounded flare arms, contour stitching and streamlined profile further the modern look."}
{"title":"8327TL Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDeryn Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210208/43/8327TL_seating__l.jpg","description":"Mid-Century modern design is the inspiration for the Deryn Collection. Wide, dramatically curved arms rise to the straight back that is synonymous with this classic style. Contrast toss pillows and an additional chair option are featured in a modern teal herringbone pattern to complement the teal fabric seating body covers. Tailored stitch tufting lends further accent to this thoroughly modern collection."}
{"title":"9339BE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHalton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210224/352/9339BE_seating__l.jpg","description":"An air of elegance surrounds the Halton Collection, from its deeply curved arms to its classic accents, this seating group will provide the traditional feel you are looking to achieve in the design of your living room. The contoured recessed arms that anchor the seating group are defined by nail head trim and supported by espresso finished legs, each element providing subtle contrast to the beige textured fabric upholstery. Further accent comes in the form of the contrast toss pillows."}
{"title":"9348GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunleith Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210127/26/9348GRY_seating__l.jpg","description":"With a tailored look that is achieved with flared arms, clean lines, and a gray velvet cover, the sofa and love seat of the Dunleith Collection provide bold accent and soft touch to your living room’s décor. The modern profile of the seating group supports plush seatbacks that are fronted with stich-tufting each design element lending to your ultimate comfort."}
{"title":"8480RED-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/149/8480REDPW_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Red premium faux leather covered."}
{"title":"9337CR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nConrad Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210504/39/9337CR_seating__l.jpg","description":"The streamlined design of the Conrad Collection pairs clean lines, gentle curves and neutral tone to create a fashionable modern look for your home’s living room. Cream-hued top grain leather upholstery with faux leather match presents as the perfect accent to your decorative preferences, while the subtly flared arms and contoured stitch tufting accent lend to your comfort. The power reclining mechanisms of the sofa, love seat and chair are engaged with the touch of a side mounted button, taking you from seated to reclined with ease."}
{"title":"9413CC-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDickinson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/279/9413CC3PWH209413CC2PWH209413CC1PWH__l.jpg","description":"The unfettered design of the Dickinson Collection allows for perfect placement in homes with decorative themes that range from modern to transitional. Offered in charcoal chenille, each piece in the collection features power motion reclining mechanisms. The power enhanced units feature adjustable headrests and electronically assisted recline. The love seat features a console with cup holders and hidden storage space. The expanse of the streamlined pillow-top arms furthers the comfort level of your downtime."}
{"title":"8378BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBarrington Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/9/8378BLK_seating__l.jpg","description":"Soft Contemporary styling lends a cool, classic look to your modern living space in the Barrington Collection. Stitch tufting provides soft contrast to the cleanly designed lines of this seating arrangement. The attached chaise lounge and accompanying ottoman provide the opportunity for putting your feet up while you enjoy your downtime. The seating group is offered in gray, black and brown faux leather."}
{"title":"9460AQ Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSpivey Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200319/59bbf6b319994085ad9bed3e67d3018d.jpg","description":"The subtle retro look of the Spivey Collection will pair with modern aesthetic of your home’s décor, creating a classically cool look that is sure to turn heads. The streamlined profile of the sofa, love seat, chair and coordinating ottoman are covered in aqua hued top grain leather. Contour stitching defines the seats of the collection, as does the cushioned wrap of the seating groups’ arms."}
{"title":"1032BGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarlson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/148/1032BGY_seating__l.jpg","description":"The frame of the Carlson Collection recalls a time when simplicity of profile was the height of style. The streamlined design of the subtly sloped wood arms and legs is finished in dark walnut which serves to highlight the blue-gray velvet covering."}
{"title":"9460DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSpivey Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200319/9b48c3a602da456bacb54c55e40a4743.jpg","description":"The subtle retro look of the Spivey Collection will pair with modern aesthetic of your home’s décor, creating a classically cool look that is sure to turn heads. The streamlined profile of the sofa, love seat, chair and coordinating ottoman are covered in dark dray hued top grain leather. Contour stitching defines the seats of the collection, as does the cushioned wrap of the seating groups’ arms."}
{"title":"9301BUE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nClifton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201012/101/9301BUE3209301BUE220350830__l.jpg","description":"The modern profile of the Clifton Collection serves to provide comfort, function and style to your home’s casual living room. The blue polished microfiber that covers the plush arms and seating of the sofa, love seat and chair lends to the decorative versatility of the collection. The sofa features dual reclining ends and a drop down center seat back with cup-holders and tabletop, the dual glider reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9422FS Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSherbrook Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/395/9422FS3209422FS2209422FS1__l.jpg","description":"The Sherbrook Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The available sofa, love seat and chair, feature manual reclining mechanisms. The Sherbrook Collection is offered in smoke chenille, allowing for maximum versatility of placement within your living room’s decorative environment."}
{"title":"9914CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRosnay Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/726d6a8462f148e0a7b2ddc7d7890486.jpg","description":"Plush seating creates the perfect platform for comfort in the Rosnay Collection. Manual motion mechanisms, when engaged with the pull of a side\nmounted tab, ease you from seated to reclined. Providing additional function to the collection is the center mounted console that features cupholders and lift-top storage."}
{"title":"9724BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMarille Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210727/57/9724BRW_seating__l.jpg","description":"With either the extended stretch of the reclining sofa or soothing rock of the reclining chair, your comfort is taken care of in the Marille Collection. Drop-down cup holders add additional function to the collection."}
{"title":"8480GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/102/8480GRY_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Gray premium faux leather covered."}
{"title":"8230FBR-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210627/19/8230FBR_seating__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. The collection is offered in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. The three optional coverings – black, brown and brown fabric. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"9724BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMarille Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210727/81/9724BLK_seating__l.jpg","description":"With either the extended stretch of the reclining sofa or soothing rock of the reclining chair, your comfort is taken care of in the Marille Collection. Drop-down cup holders add additional function to the collection."}
{"title":"9429TP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLeGrande Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200916/f815e9a6e35c492dbcc1a7b899d0af00.jpg","description":"Ample seating is available for your home with the addition of the LeGrande Collection. The sectional is comprised of the optional end recliners or chaise units which bookend the available corner unit, armless chair, power armless chair and console, each configuration allowing for perfect placement within your available space. The power mechanisms featured on the end units and armless power chair are engaged with the push of a button, taking you from seated to prone in one gentle motion while also providing custom head support by way of the power headrest. Further functionality comes in the form of the console with hidden storage and cupholders, as well as the side-mounted USB ports of the reclining chaises, end recliners and stand-alone chair."}
{"title":"8230BLK-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210627/0/8230BLK_seating__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. The collection is offered in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. The three optional coverings– black, brown and brown fabric. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"9879GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBonita Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/646/9879GY__l.jpg","description":"The transition of clean, straight lines to the rounded end of the Bonita Collection creates stunning visual impact for your contemporary living room. Gray fabric, paired with chrome finished legs, lends decorative neutrality with a decidedly modern profile. Plush, rounded backs and stitch tufted seating lend comfort to the seating of the Bonita Collection."}
{"title":"9569GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMagnus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/e64b75e1593647a18b31dc7bf8fb997f.jpg","description":"Your comfort is elevated to the next level with the addition of the Magnus\nCollection. The sofa-chaise features a convenient pop-up sleeper that provides the extra sleep space that so many homes need. The chaise unit opens to reveal additional storage space furthering the multi-functional use of the collection."}
{"title":"8230FBR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201006/38/8230FBR_seating3__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. Brown fabric in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"8228GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFerriday Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/0/8228GY_seating__l.jpg","description":"Providing a flexible option for relaxation, sleep and storage, the Ferriday Collection will be a stylish and functional addition to your living room. Under seat storage is revealed with the pull of a tab on the end chaise while the lower portion of the seating configuration pulls out to reveal a pop-up trundle that creates a bed space creating a relaxing environment with minimal effort. The coordinating chair also features a pop-up ottoman, providing extended support for your legs.  The collection is covered in gray microfiber, presenting as a neutral accent to your casual living room."}
{"title":"9435SV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDriggs Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/507/9435SV_seating__l.jpg","description":"Turning your seating area into a platform for lounging is the versatile Driggs Collection. Click-motion mechanisms allow for the lounger back to go from upright to flat with little effort. The side arms are also adjustable, allowing for an even surface with the flat-adjusted back. The Driggs Collection is offered in gunmetal gray and silver-gray chenille, each a neutral canvas for your personal decorative preference."}
{"title":"8480RED Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201019/151/8480RED_seating__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Red premium faux leather covered."}
{"title":"8325BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreeley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/20171106/8325BRW-3_1315_l.jpg","description":"Designed to be the comfortable spot that you nestle into after a long day, the Greeley Collection will be a welcome addition to your home's living room. Plush seating and backs extend from seated to prone with a pull of the manual reclining mechanism on each piece in the collection – dual reclining sofa, love seat and chair. The top and front bodies is covered in brown top grain leather, with leather match covering those areas beyond your initial reach."}
{"title":"8277CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPlatina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/680/8277CH_Sectiona__l.jpg","description":"The contemporary look of the Platina Collection is enhanced with unexpected function creating storage and sleep space within your living room. Conveniently stored beneath the main seating is pull out trundle that rises to create a bed. The plush top of the attached ottoman lifts, via hinge, to reveal ample storage space. The chocolate colored fabric of the collection features contrast stitching."}
{"title":"9890GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreerman Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/640/9890GY__l.jpg","description":"With a design that lends to home decors ranging from transitional to modern, the versatile styling of the Greerman Collection will fit perfectly in your casual living room. This sofa-chaise features a left side two-seat\nconfiguration that is punctuated with right side end chaise. The brown finished wood base rail and support legs lend considerable accent to the neutral gray textured fabric that covers the collection. Kidney pillows offer additional support to the seat back of the sofa."}
{"title":"8230BRW-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210627/11/8230BRW_seating__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. The collection is offered in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. The three optional coverings– black, brown and brown fabric. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"8325GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreeley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20180710/cab825cf928a44a69e8fadeb28a417c4.jpg","description":"Designed to be the comfortable spot that you nestle into after a long day, the Greeley Collection will be a welcome addition to your home's living room. Plush seating and backs extend from seated to prone with a pull of the manual reclining mechanism on each piece in the collection – dual reclining sofa, love seat and chair. The top and front bodies is covered in gray top grain leather, with leather match covering those areas beyond your initial reach."}
{"title":"9849MC-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBorneo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200702/66/9849MC3PWH209849MC2PWH20363431__l.jpg","description":"Styled for the modern-transitional home, the Borneo Collection is a comfortable and functional addition to your living room. Mocha fabric with subtle contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage."}
{"title":"1032BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarlson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/149/1032BR_seating__l.jpg","description":"The frame of the Carlson Collection recalls a time when simplicity of profile was the height of style. The streamlined design of the subtly sloped wood arms and legs is finished in dark walnut which serves to highlight the light brown velvet covering."}
{"title":"8289GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBedos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210421/379/8289GY3208289GY2__l.jpg","description":"The sleek styling of Mid-Century modern design was utilized to create the Bedos Collection. Offered in gray fabric, the neutral tones don't over power the look of the collection. The wood base rail that trims each piece in the collection is supported by wood legs. Rectangular bolster style pillows create a comfortable buffer between you and the arm of the sofa."}
{"title":"8206GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAram Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/25/8206GRY_seating__l.jpg","description":"Plush seating, functional accessories and versatile styling blend effortlessly to create the look of the Aram Collection. The gray breathable faux leather upholstery covering will pair perfectly with your transitional decorative preference. The sofa features dual reclining ends, a drop-down center seat back with cup-holders and both electric and USB receptacles, and a hidden storage drawer located below the center seat. The dual glider reclining ends of the love seat flank the center console which features cupholders, as well as electric and USB receptacles that are located within the storage compartment. A glider reclining chair is also available. The manual motion reclining mechanisms of each piece in the collection operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9468DG-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210422/514/9468DG1209468DG_LC2R__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s functionality goes beyond that of a traditional sofa. Covered with dark gray chenille, the modern profile of this seating group is defined by its nailhead trim, loose back cushions and track-style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise and paired two-seater can be configured as right or left side placement based on the needs of your space. A coordinating swivel chair lends complementing decorative accent with its barrel shape and loose back cushion."}
{"title":"9468CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/156/9468CC_seating__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s decoratively flexible style allows for placement in myriad living room settings. Covered in charcoal-hued chenille, the profile of the sofa, love seat and chair are defined by nailhead trim, loose back cushions and track-style arms, creating a look that is perfect for your home’s living room."}
{"title":"8206BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAram Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210512/116/8206BRW203588__l.jpg","description":"With amply appointed offerings that create not only a comfortable seating experience but a functional one as well, the Aram Collection will be a welcome addition to your home. Dark brown breathable faux leather covering for comfort and style that will blend effortlessly with your transitional decorative preference. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. Each piece in the collection has an individual function allowing for convenience and comfort. The sofa features dual reclining ends and a drop down center seat back with cup-holders, electric receptacles, USB port and tabletop space, the dual glider reclining ends of the love seat flank a center mounted console with storage, electric receptacles and cup-holders, and the reclining chair features a glider mechanism that allows for easy back and forth motion."}
{"title":"9509DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTesoro Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/121/9509DG_seating__l.jpg","description":"Providing ample seating in modern form the Tesoro Collection. The classic\nsectional shape is book-ended by optional USB port enhanced end power\nrecliners or end chaise units – allowing for maximum versatility when\nplanning the layout of your living room. The power reclining mechanism of\nthe reclining ends and armless chair brings you to your comfort experience."}
{"title":"8203GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nIniko Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/d802dea02ea04f739143aa66df680bdf.jpg","description":"Contemporary styling is exemplified in the design of the Iniko Collection. Offered in gray leather gel match coverings, the cleanly designed seating group will fit perfectly in your modern home. Chrome legs support and provide decorative accent that is in line with the sleek look of the collection."}
{"title":"9468BE-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210422/495/9468BE_sectional__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s functionality goes beyond that of a traditional sofa. Covered in beige chenille, the modern profile of this seating group is defined by its nailhead trim, loose back cushions and track-style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise and paired two-seater can be configured as right or left side placement based on the needs of your space. A coordinating swivel chair lends complementing decorative accent with its barrel shape and loose back cushion."}
{"title":"9849MC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBorneo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211011/381a242138c844dc873b4330697fbb3d.jpg","description":"Styled for the modern-transitional home, the Borneo Collection is a comfortable and functional addition to your living room. Mocha fabric with subtle contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage."}
{"title":"4829DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCaffery Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/554/4829DB_seating__l.jpg","description":"In creating the perfect recreational room, you need functional pieces that provide comfort to your friends and family. The Caffery Collection, with a quick adjustment to the click mechanism, turns from a casual sofa into a flat platform perfect for sleeping or just hanging out. Offered in a dark brown bi-cast vinyl with white contrast stitching or dark gray fabric, the collection also features cup holders at arms for added convenience."}
{"title":"8259DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaroni Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/566/8259DG_LRPWHCNARPWCRACRRPWH203608SV_HP__l.jpg","description":"Providing ample seating for your friends and family is the Maroni Collection. The classic sectional shape is book-ended by USB port enhanced end power recliners. Gray fabric provides a gentle touch while lighter tone fabric lends stark contrast. The power reclining mechanism bring you to your desired position with a touch of the button. Providing additional support is the power operated headrest that allows you to further customize your comfort experience."}
{"title":"8219BEG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVeloce Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/95/8219BEG_seating__l.jpg","description":"Bringing to mind the sleek styling of an Italian race car, bold contemporary styling creates eye-catching drama for your living room with the Veloce Collection. Color blocked beige and gray faux leather covers the ultra-low profile seating and accompanying glass-topped cocktail table, while chrome legs provide support."}
{"title":"9459GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHelix Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/48/9459GYsc_seating__l.jpg","description":"Providing ample seating in modern form the Helix Collection. The corner unit and armless chairs are book-ended by power recliners, creating a classic sectional. Two-tone gray velvet is pair to provide a neutral palette for your decorative preferences. The power reclining mechanism of the reclining end chairs brings you to your desired position with a touch of the button. The wide profile of the sectional’s arms features tufted accenting while lumbar cushions provide comfortable support for your seated experience."}
{"title":"9357GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJayne Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210218/36/93571SW209357GY_CRACCRAC4__l.jpg","description":"The modular design of the Jayne Collection provides a versatile seating experience configurable to your modern living room’s available space. Pair multiple armless chairs with the coordinating corner unit to create plush sectional seating or without the corner unit to create a love seat or sofa. Your preferred seating arrangement can be enhanced with the addition of an ottoman, providing seated leg extension. The gray textured fabric of the collection features profile-defining contrast welt while the chenille multi-toned geometric print that covers the toss pillows and coordinating swivel chair provide complementing contrast."}
{"title":"9509MGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nTesoro Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210224/208/9509MGY_seating__l.jpg","description":"Providing ample seating in modern form the Tesoro Collection. The classic sectional shape is book-ended by optional USB port enhanced end power recliners or end chaise units – allowing for maximum versatility\nwhen planning the layout of your living room. Mist gray fabric provides a neutral palette for your decorative preferences. The power reclining mechanism of the reclining ends and armless chair brings you to your\ndesired position with a touch of the button. Providing additional support is the USB enhanced ports, console unit - with storage and stainless steel cupholders - and the power operated headrest that allows you to further customize your comfort experience."}
{"title":"9579BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDyersburg Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200909/28/9579BRW_seating3__l.jpg","description":"The versatility of the Dyersburg Collection allows for perfect placement within your space, creating a comfortable spot to unwind. The transitional styling of the sectional features plush pillow-back seating, contoured shape and brown premium faux leather. The right and left side end units are available as power reclining chair or chaise, each allowing for seated extension. Expanding the length of the sectional are the available console unit – with cup holders and storage space – armless chair and power motion armless chair."}
{"title":"9355BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBerel Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/540/9355BU_seating__l.jpg","description":"Designed for the maximum utilization of function and an eye for modern styling, the Berel Collection is the perfect platform for you to indulge in comfort. The sectional’s configuration pairs your chosen components to create two versatile seating and sleeping options for your living room. The first option pairs the left-side two-seater featuring a pull-out bed, corner seating unit, armless two-seater, and right-side chaise with hidden storage. The second pairs the left-side two-seater, featuring a pull-out bed, with the right-side chaise featuring hidden storage. Contoured pillow-top arms and adjustable headrests lend to the comfortable seating arrangement. The blue chenille upholstered cover furthers your plush seating experience."}
{"title":"9469NVB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAvenue Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/73/9469NVB_seating__l.jpg","description":"The Avenue Collection created a comfortable spot to unwind. The modern styling of the sectional features plush pillow-back seating, contoured shape and dark navy blue premium faux leather. The right and left side end units are available as either reclining chair or push-back chaise, each\nallowing for seated extension."}
{"title":"9405BR-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/cf832008e14b40d9afd73e5d68c48f8b.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The available sofa, love seat and chair, feature power reclining mechanisms and USB port, allowing for perfect placement within your available space. The love seat’s console and the sofa’s drop-down center seatback table feature cupholders and power receptacles. Expanding the options of the collection is the power reclining chair. The Putnam Collection is offered in brown polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"9469DBR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAvenue Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/429/9469DBR_seating__l.jpg","description":"The bold selection of the Avenue Collection will be certain to make a statement in your casual living room, creating a comfortable spot to unwind. The modern styling of the sectional features plush pillow-back seating, contoured shape and dark brown textured faux leather. The right and left side end units are available as either reclining chair or push-back chaise, each allowing for seated extension. Expanding the length of the sectional are the available console unit – with cup holders and storage space – armless chair and reclining armless chair."}
{"title":"9401GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLogansport Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/8/9401GRY_seating__l.jpg","description":"With ample space to stretch out or snuggle up with the one you love, the Logansport Collection is the perfect platform for you to indulge in comfort. Configurable to a large-scale space, the left-side two-seat base with pull-out ottoman, accommodates the addition of the corner unit, armless two-seater with pull-out bed, and right-side cuddler. The sofa can also be scaled for a smaller space with the left-side two-seat base with pull-out ottoman, paired with the right-side cuddler unit. Coordinating toss pillows are included with the left two-seater, corner and cuddler. The Logansport Collection features a gray chenille cover furthering your plush seating experience."}
{"title":"9367GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunstan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210226/184/9367GY_seating__l.jpg","description":"The convenience of being able to configure your chosen sofa to your available space is a reality with the Dunstan Collection. The reversible 3-seat unit is paired with a chaise unit, each featuring the flexibility of design to reverse the arm configuration, allowing for right or left side placement of the chaise. The 3-seat unit features a centrally located drop-down sofa back which when opened reveals two cup holders. The Dunstan Collection is covered in gray upholstered fabric, a perfect accent to your home’s transitional aesthetic. The available ottoman features hidden storage, perfect for discretely storing decorative blankets or pillows within your living room."}
{"title":"9849CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBorneo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210120/573/9849CH_seating__l.jpg","description":"Styled for the modern-transitional home, the Borneo Collection is a comfortable and functional addition to your living room. Chocolate fabric, with subtle contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage."}
{"title":"8225 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlain Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201220/60/82253208225220357930__l.jpg","description":"The perfect addition to your casual transitional living room is the Alain Collection. Amply appointed back and seat cushions provide the ultimate in comfort, while matching toss pillows lend a decorative touch. Brownish gray fabric provides visual and tactile interest."}
{"title":"9857DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nWorchester Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/143/9857DG_seating__l.jpg","description":"Plush memory foam seating provides an enveloping experience for your relaxation time with the addition of the Worchester Collection to your living room. Available in multiple configurations - right or left chaise or 2-seater ends - this stationary sectional will be a versatile addition to your home. The dark gray fabric covering and classic profile lend to a transitional style that will be a perfect fit to your home's décor."}
{"title":"9507DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaston Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201227/73/9507DGY_seating__l.jpg","description":"Providing a multitude of functional aspects, the Maston Collection will be the perfect addition to your modernly styled living room. With a design that allows for this sectional to be configured as either a right or left side chaise, the versatility will make placement within your space a breeze. The ottoman and opens to reveal additional storage for your space, while the dropdown seatback provides dual cupholders and flat surface for secure placement of your beverages and snacks. The collection is offered in three distinct colors – light gray, chocolate and dark gray – for neutral decorative accent within your living room."}
{"title":"9367DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunstan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210226/168/9367DG_seating__l.jpg","description":"The convenience of being able to configure your chosen sofa to your available space is a reality with the Dunstan Collection. The reversible 3-seat unit is paired with a chaise unit, each featuring the flexibility of design to reverse the arm configuration, allowing for right or left side placement of the chaise. The 3-seat unit features a centrally located drop-down sofa back which when opened reveals two cup holders. The Dunstan Collection is covered in dark gray upholstered fabric, a perfect accent to your home’s transitional aesthetic. The available ottoman features hidden storage, perfect for discretely storing decorative blankets or pillows within your living room."}
{"title":"8201BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJude Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210705/43/8201BLK3533__l.jpg","description":"Plush seating with well-appointed features makes the Jude Collection a comfortable and functional addition to your living room. Black premium faux leather coverings for a bold, yet, neutral statement. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. Each piece in the collection has an individual function allowing for convenience and comfort. The sofa features dual reclining ends and a drop down center seat back with cup-holders and tabletop space, the dual glider reclining ends of the love seat flank a center mounted console with storage and cup-holders, and the chair features a glider mechanism that allows for easy back and forth motion."}
{"title":"9445BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nArmando Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200820/229/9445BR_seating__l.jpg","description":"The Armando Collection’s transitional styling will serve as a functional and comfortable seating group for your living room. The sofa, love seat and chair each feature power reclining mechanisms, power headrests and USB ports, allowing for maximum comfort and quick access to your electronic devices as they charge. The Armando Collection is offered in brown leather with faux leather match, creating a look that pairs perfectly with your living room’s decorative environment."}
{"title":"9525RF Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPrice Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211004/68043ea9fc574fdf9e809e000f7890cc.jpg","description":"With functionality beyond the expected, the Price Collection presents as a unique seating option for your household. The pop-up ottoman and click-mechanism seat back of this sofa engage to create a platform for sleeping or relaxing. Offered in a gray fabric cover for decorative neutrality, the classic design furthers the placement ability within a number of home environments."}
{"title":"9405BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/5d79f35250534193b860a448d983561c.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The available sofa, love seat and chair, feature manual reclining mechanisms and USB port, allowing for perfect placement within your available space. The glider love seat’s console and the sofa’s drop-down center seatback table feature cupholders and power receptacles. Expanding the options of the collection is the swivel glider reclining chair. The Putnam Collection is offered in brown polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"1138GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDamala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200817/134/1138GY_seating__l.jpg","description":"The retro-inspired wood framing of the Damala Collection will perfectly accent your modern home décor. Subtle contouring to the seating collection’s wood frame is finished in walnut, presenting as a classic complement to the gray fabric that covers the padded seats and backs of the sofa, love seat and chair."}
{"title":"9468BE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMorelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/115/9468BE_seating__l.jpg","description":"A perfect addition to your casual living room, the Morelia Collection’s decoratively flexible style allows for placement in myriad living room settings. Covered in beige chenille, the profile of the sofa, love seat and chair are defined by nailhead trim, loose back cushions and track-style arms, creating a look that is perfect for your home’s living room."}
{"title":"9404DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOrofino Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/30/9404DG_seating__l.jpg","description":"The modern low profile of the Orofino Collection is combined with the plush texture microfiber in a remarkable pairing of style and comfort. Offered in two colors – gray or dark gray – the textured fabric offers a visually versatile pallet and a luxurious texture that enhances your seating experience. Contrast comes in the form of the geometric print toss pillows that accompany the sofa and love seat."}
{"title":"9460BE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSpivey Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20191224/261/9460BE3209460BE220164930__l.jpg","description":"The subtle retro look of the Spivey Collection will pair with modern aesthetic of your home’s décor, creating a classically cool look that is sure to turn heads. The streamlined profile of the sofa, love seat, chair and coordinating ottoman are covered in beige hued top grain leather. Contour stitching defines the seats of the collection, as does the cushioned wrap of the seating groups’ arms."}
{"title":"1032DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarlson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/150/1032DG_seating__l.jpg","description":"The frame of the Carlson Collection recalls a time when simplicity of profile was the height of style. The streamlined design of the subtly sloped wood arms and legs is finished in dark walnut which serves to highlight the dark gray velvet covering."}
{"title":"8219BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nVeloce Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/98/8219BLK_seating__l.jpg","description":"Bringing to mind the sleek styling of an Italian race car, bold contemporary styling creates eye-catching drama for your living room with the Veloce Collection. Color blocked black and gray faux leather covers the ultra-low profile seating and accompanying glass-topped cocktail table, while chrome legs provide support."}
{"title":"9470GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBriscoe Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201012/41/9470GY_seating__l.jpg","description":"With well-appointed features that create not only a comfortable seating experience but a functional one as well, the Briscoe Collection will be a welcome addition to your home. The gray premium faux leather covering creates a style that will blend effortlessly with your transitional decorative preference. The sofa features dual glider reclining ends and a drop down center seat back with cup-holders and tabletop, the dual glider reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"1138BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDamala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200817/109/1138BR_seating__l.jpg","description":"The retro-inspired wood framing of the Damala Collection will perfectly accent your modern home décor. Subtle contouring to the seating collection’s wood frame is finished in walnut, presenting as a classic complement to the brown fabric that covers the padded seats and backs of the sofa, love seat and chair."}
{"title":"4829LN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCaffery Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/555/4829LN_seating__l.jpg","description":"In creating the perfect recreational room, you need functional pieces that provide comfort to your friends and family. The Caffery Collection, with a quick adjustment to the click mechanism, turns from a casual sofa into a flat platform perfect for sleeping or just hanging out. Offered in a dark brown bi-cast vinyl with white contrast stitching or dark gray fabric, the collection also features cup holders at arms for added convenience."}
{"title":"9367BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDunstan Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210226/152/9367BU_seating__l.jpg","description":"The convenience of being able to configure your chosen sofa to your available space is a reality with the Dunstan Collection. The reversible 3-seat unit is paired with a chaise unit, each featuring the flexibility of design to reverse the arm configuration, allowing for right or left side placement of the chaise. The 3-seat unit features a centrally located drop-down sofa back which when opened reveals two cup holders. The Dunstan Collection is covered in blue upholstered fabric, a perfect accent to your home’s transitional aesthetic. The available ottoman features hidden storage, perfect for discretely storing decorative blankets or pillows within your living room."}
{"title":"9401BEG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLogansport Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/0/9401BEG_seating__l.jpg","description":"With ample space to stretch out or snuggle up with the one you love, the Logansport Collection is the perfect platform for you to indulge in comfort. Configurable to a large-scale space, the left-side two-seat base with pull-out ottoman, accommodates the addition of the corner unit, armless two-seater with pull-out bed, and right-side cuddler. The sofa can also be scaled for a smaller space with the left-side two-seat base with pull-out ottoman, paired with the right-side cuddler unit. Coordinating toss pillows are included with the left two-seater, corner and cuddler. The Logansport Collection features a beige chenille cover furthering your plush seating experience."}
{"title":"1104BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLewiston Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210110/0/1104BR_seating__l.jpg","description":"Designed with inspiration from the Arts & Crafts movement, the Lewiston Collection will be a classic addition to your home’s décor. The sofa, love seat and chair's transitionally styled legs and vertical slat-supported wood arms are finished in an antique gray, providing complementing contrast to the brown linen-like fabric covering."}
{"title":"1138DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDamala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200817/122/1138DG_seating__l.jpg","description":"The retro-inspired wood framing of the Damala Collection will perfectly accent your modern home décor. Subtle contouring to the seating collection’s wood frame is finished in walnut, presenting as a classic complement to the dark gray fabric that covers the padded seats and backs of the sofa, love seat and chair."}
{"title":"9467BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCreighton Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201111/6/9467BR_seating__l.jpg","description":"The plush seating that is contoured for your comfort is paired with transitional styling resulting in the classic look of the Creighton Collection. The available brown polished microfiber covering that covers the seating group creates a style that will blend effortlessly with your transitional decorative preference. The sofa features dual reclining ends, the dual glider reclining ends of the love seat – with center console featuring cupholders and storage – and the glider reclining chair all feature manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9404GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOrofino Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201021/32/9404GY_seating__l.jpg","description":"The modern low profile of the Orofino Collection is combined with the plush texture of fabric in a remarkable pairing of style and comfort. Offered in two colors – gray or dark gray – the textured plush microfiber offers a visually versatile pallet and a luxurious texture that enhances your seating experience. Contrast comes in the form of the geometric print toss pillows that accompany the sofa and love seat."}
{"title":"8200BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMahala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/160527f77d434e07b4a072e9433863a0.jpg","description":"Plush seating is paired with a brown top grain leather and faux leather in the Mahala Collection to create the ultimate platform for relaxation. Offered with two reclining options – a manual or power engaged - the motion mechanisms allow for quick transition from seated to prone with either the quick pull of the manual tab or the push of the power button."}
{"title":"8225NGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlain Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201220/39/8225NGY3208225NGY220357930__l.jpg","description":"The perfect addition to your casual transitional living room is the Alain Collection. Amply appointed back and seat cushions provide the ultimate in comfort, while matching toss pillows lend a decorative touch. Lightly textured Gray fabric provides visual and tactile interest."}
{"title":"4823BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCallie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/558/4823BR_seating__l.jpg","description":"Supported by column legs and featuring a streamlined design, the Callie Collection adjusts with an easy motion of click-clack mechanism. Offered in Brown or Gray microfiber."}
{"title":"9848BR-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShola Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/565/9848BR3PWH209848BR2PWH209848BR1PWH__l.jpg","description":"Styled for the transitional home, the Shola Collection is a comfortable and functional addition to your living room. Brown polished microfiber with contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The sofa has a drop-down center back that reveals cupholders, flat surface, USB port and power supply. The love seat features a center console with cupholders and lift-top storage. The collection is also available in manual pull version."}
{"title":"9327BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nElmont Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201213/cedfd7938b7148d2b27515844509a963.jpg","description":"Designed for perfect placement in myriad decorative home settings, the Elmont Collection pairs clean lines with plush seating to create a versatile option for your living room. The transitional styling of the sofa, love seat and chaise features a blue textured fabric covering, track arms and loose back cushions. The chaise features a coordinating toss pillow."}
{"title":"9402GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarolina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/262/9402GRY_seating__l.jpg","description":"Customizable for your casual living room’s available space, the Carolina Collection’s functionality goes beyond that of a traditional sofa. Covered in dark gray or gray chenille, the transitional profile of this seating group is complemented by stitch tufted and track style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise can be configured as right or left side placement based on the needs of your space."}
{"title":"8228TP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFerriday Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/d2fe14034f834f379f46d8643c05eb46.jpg","description":"Providing a flexible option for relaxation, sleep and storage, the Ferriday Collection will be a stylish and functional addition to your living room. Under seat storage is revealed with the pull of a tab on the end chaise while the lower portion of the seating configuration pulls out to reveal a pop-up trundle that creates a bed space making for a relaxing environment with minimal effort. The coordinating chair also features a pop-up ottoman, providing extended support for your legs.  The collection is covered in taupe microfiber, presenting as a neutral accent to your casual living room."}
{"title":"9858GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAndes Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/138/9858GY_seating__l.jpg","description":"The transitional look of the Andes Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features a pull-out ottoman. The collection is offered in either taupe or gray textured plush microfiber – each with contrast stitching."}
{"title":"9789BRG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPhelps Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/132/9789BRG_seating__l.jpg","description":"Not every home is created the same and the unique design of the Phelps Collection allows for maximum flexibility with its reversible chaise. With 5 available coverings - coffee microfiber and 4 linen-like fabric options, teal, brown-gray, dark gray and blue - refined track arm, and comfortable seating, the collection’s style is compatible in a number of settings. The matching ottoman provides additional comfort and function to your living area."}
{"title":"9340TP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDorelle Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201217/444/9340TP_seating__l.jpg","description":"The modern style of the Dorelle Collection is a timeless pairing of clean lines and neutral color resulting in a seating collection that will pair with your home’s chic aesthetic. Segmented stitch tufting provides visual contrast to the plush, subtly contoured framing of the sofa, love seat and chair’s fronts. Taupe fabric upholstery serves as the versatile palette to your decorative preferences."}
{"title":"8228BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFerriday Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/b6538e44cd2549bcabfa11d44d99b8ed.jpg","description":"Providing a flexible option for relaxation, sleep and storage, the Ferriday Collection will be a stylish and functional addition to your living room. Under seat storage is revealed with the pull of a tab on the end chaise while the lower portion of the seating configuration pulls out to reveal a pop-up trundle that creates a bed space making for a relaxing environment with minimal effort. The coordinating chair also features a pop-up ottoman, providing extended support for your legs.  The collection is covered in blue microfiber, adding a pop of color to your casual living room."}
{"title":"4838 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMarcelo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/550/4838_seating__l.jpg","description":"The multi-functional Marcelo Collection will provide your home with the seating and sleep space you require. When the click-clack mechanism sofa is\nadjusted to a fully reclined position, it is met with the pull-out trundle that extends this multi-functional sofa into a bed. Other features include cup holders and the black faux leather with white contrast stitching cover."}
{"title":"9359GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBrandolyn Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/299/9359GRY_seating__l.jpg","description":"Comfort comes in the form of fully extended relaxation and a soft touch in the design of the Brandolyn Collection. The sofa-chaise’s configuration is reversible, allowing for the two-seat unit, with pop-up sleeper, to have a left or right-side placement alongside the chaise. The chaise unit opens to reveal additional storage space furthering the multi-functional use of the collection. The light gray textured upholstered cover of the collection is as versatile as the Brandolyn’s design."}
{"title":"8202CH-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSinclair Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211004/afa739d24187454e8f58f4bc9fb03dcf.jpg","description":"A hint of retro styling provides a clean and classic look for your contemporary home in the Sinclair Collection. Offered in a traditional seating or sectional configuration, the options allow for the perfect placement within your living room. The collection is available in either chocolate or gray fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"9901CC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nNutmeg Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201029/0/9901CC_seating__l.jpg","description":"Designed for maximum comfort and styled for the transitional home, the Nutmeg Collection is a study in comfort. Contoured seating cradles you as you relax into the plush seatbacks. Charcoal gray textured fabric is highlighted by nailhead accent and contrast contour welt, defining the profile of the collection. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. The sofa features dual reclining ends, as does the love seat."}
{"title":"9848GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShola Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/230/9848GY_seating__l.jpg","description":"Styled for the transitional home, the Shola Collection is a comfortable and functional addition to your living room. Gray polished microfiber with contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The sofa has a drop-down center back that reveals cupholders, flat surface, USB port and power supply. The love seat features a center console with cupholders and lift-top storage. The collection is also available in manual pull version."}
{"title":"8200BRW-PW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMahala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/8b74461dfd8d4f7a9b1a67c161583baa.jpg","description":"Plush seating is paired with a brown top grain leather and faux leather in the Mahala Collection to create the ultimate platform for relaxation. Offered with two reclining options – a manual or power engaged - the motion mechanisms allow for quick transition from seated to prone with either the quick pull of the manual tab or the push of the power button."}
{"title":"9848BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShola Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200701/582/9848BR3209848BR2209848BR1__l.jpg","description":"Styled for the transitional home, the Shola Collection is a comfortable and functional addition to your living room. Brown polished microfiber with contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The sofa has a drop-down center back that reveals cupholders, flat surface, USB port and power supply. The love seat features a center console with cupholders and lift-top storage. The collection is also available in manual pull version."}
{"title":"9368BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDawson Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210421/88/9368BRW_seating__l.jpg","description":"The Dawson Collection’s plush seating, pillow-top \narms and versatile look make for the perfect addition \nto your home’s casual living space. Brown faux leather \nupholstery covers the sofa, love seat and chair."}
{"title":"9360BEG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAntonio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/301/9360BEG_seating__l.jpg","description":"Easing you into plush relaxation, with just the push of a button, is the Antonio Collection. The sleek profile of the ultra-modern design transforms bringing you from your seated position to reclined via the power motion mechanism. The sofa, love seat and chair are supported by chrome finished metal legs and covered in beige top grain leather match upholstery that further lends to the modern styling."}
{"title":"9402DGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCarolina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/251/9402DGY_seating__l.jpg","description":"Customizable for your casual living room’s available space, the Carolina Collection’s functionality goes beyond that of a traditional sofa. Covered in dark gray or gray chenille, the transitional profile of this seating group is complemented by stitch tufted and track style arms. Conveniently stored beneath the sofa is a pull-out trundle that rises to create a bed while the top of the attached chaise opens to reveal under-seat storage. The chaise can be configured as right or left side placement based on the needs of your space."}
{"title":"9390DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBrooklyn Park Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20211017/76/9390DG_seating__l.jpg","description":"Your home’s living room serves as a hub of activity which is deserving of a seating arrangement that presents functional and decorative versatility, the Brooklyn Park Collection fits that bill. Transitional styling with textured dark gray fabric upholstery creates the classic look while the function of the collection comes in the form of the pull-out bed and two hidden lift-top storage compartments located under the end chaise and sectional arm. The collection is offered in either right or left side chaise configuration."}
{"title":"8216DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCornelia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210607/136/8216DG_seating__l.jpg","description":"Casual traditional styling creates the look of the Cornelia Collection.  Dark gray microfiber covering for neutral complement to your home’s décor. Nailhead trim along with rolled arms lend to the soft traditional style."}
{"title":"9403BE Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCadence Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/338/9403BE_R__l.jpg","description":"The low profile and sleek styling of the Cadence Collection lends modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa while the chaise can be configured for right or left side placement, allowing for perfect placement within your living room. The pop-up chaise provides ample space for relaxation as well as provides storage within the unit, and the pull-out pop up ottoman extends your sectional into a larger platform. The optional gray, beige or blue microfiber coverings pair with black finished metal legs complete the look of this sectional seating group."}
{"title":"9700FCP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCranley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201001/161/9700FCP_seating__l.jpg","description":"The reclining Cranley Collection utilizes a release mechanism that with a gentle pull sends you straight into your ultimate comfort zone. This collection is offered in chocolate textured plush microfiber with faux leather."}
{"title":"9808 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlfio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/173/9808_sectional__l.jpg","description":"The contemporary look of the Alfio Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features pull-out ottoman. The two-tone fabrics, adjustable headrests and the silver-colored feet further the modern look and functionality of this unique seating collection."}
{"title":"8202CH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSinclair Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/8faa8aa7f09848358ed065a8ee94d9e3.jpg","description":"A hint of retro styling provides a clean and classic look for your contemporary home in the Sinclair Collection. Offered in a traditional seating or sectional configuration, the options allow for the perfect placement within your living room. Chocolate fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"4823GP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCallie Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/565/4823GP_seating__l.jpg","description":"Supported by column legs and featuring a streamlined design, the Callie Collection adjusts with an easy motion of click-clack mechanism. Offered in Brown or Gray microfiber."}
{"title":"8245BR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKenner Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201018/30/8245BR_seating__l.jpg","description":"A classic and functional option for your living room is the Kenner Collection. Unfettered design allows for your individual decorative aspirations to soar. The sofa and love seat are paired with contrast pillows. Brown fabric for versatile placement in a number of environments."}
{"title":"8230BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201006/10/8230BLK_seating4__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. Black premium faux leather in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"9446CB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBurwell Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201012/229/9446CB_seating__l.jpg","description":"The unfettered modern design of the Burwell Collection presents as a statement of your preference for contemporary design. The sofa, love seat and chair are featured with power motion reclining mechanisms, taking you from seated to reclined in an easy motion. The love seat features a console with cup holders and hidden storage space. The streamlined track-style arms, clean lines and solid front design of the seats further lends to the modern look. The collection is offered in cobblestone premium faux leather."}
{"title":"9808SGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAlfio Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/178/9808SGY_sectional__l.jpg","description":"The contemporary look of the Alfio Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features pull-out ottoman. The gray fabric combined with adjustable headrests and the silver-colored feet further the modern look and functionality of this unique seating collection."}
{"title":"16829 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nHeath Court Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210504/31/16829_seating__l.jpg","description":"The elegant profile of the Heath Court Collection is comprised of classic elements that have been combined to create the perfect addition to your home’s traditional décor. The neutral hued brown fabric sets the tone for the refined presentation with chenille seat tops, coordinating toss pillows, button tufting and welting lending complementing accent to the set. The show-wood frame features white oak veneer with a brown finish that complements the fabric cover. The dramatic camelback profile is enhanced by the rolled arms and turned pilaster fronts."}
{"title":"9858TP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAndes Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/142/9858TP_LR__l.jpg","description":"The transitional look of the Andes Collection is enhanced with extraordinary function creating storage and sleep space within your living room. Conveniently stored beneath the sofa is a pull out trundle that rises to create a bed while the top of the attached chaise opens to reveal ample storage space. The available coordinating chair features a pull-out ottoman. The collection is offered in either taupe or gray textured plush microfiber– each with contrast stitching."}
{"title":"8256 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCinque Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/25e1d9a55a62405cacb069d8231f4a5f.jpg","description":"The ultra-low profile of the Cinque Collection is the epitome of clean Italian design. Headrests are adjustable to create a break in the profile of the sofa, while the end chair utilizes power reclining to provide additional support. The modified chaise provides ample space for relaxation whether seated or prone. Chrome finished legs complete the look of this sectional seating group. Available in taupe or light gray all leather."}
{"title":"9569NFGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMagnus Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/102/9569NFGY_seatin__l.jpg","description":"Your comfort is elevated to the next level with the addition of the Magnus\nCollection. The sofa-chaise features a convenient pop-up sleeper that provides the extra sleep space that so many homes need. The chaise unit opens to reveal additional storage space furthering the multi-functional use of the collection."}
{"title":"9913 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMuirfield Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/533/9913_seating__l.jpg","description":"With a versatile style that is perfect for your casual living room, the Muirfield Collection’s plush seating and modern aesthetic create a platform for your relaxation. The plush pillow-top arms and seating of the sofa, love seat and chair are covered in gray textured microfiber upholstery for neutral accent to your home’s decor.  Manual reclining mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion."}
{"title":"9848GY-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShola Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/229/9848GYPWH_seating__l.jpg","description":"Styled for the transitional home, the Shola Collection is a comfortable and functional addition to your living room. Gray polished microfiber with contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The sofa has a drop-down center back that reveals cupholders, flat surface, USB port and power supply. The love seat features a center console with cupholders and lift-top storage. The collection is also available in manual pull version."}
{"title":"9403GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCadence Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210725/59/9403GY_seating__l.jpg","description":"The low profile and sleek styling of the Cadence Collection lends modern accent to your living room space. Headrests are adjustable to create a break in the profile of the sofa while the chaise can be configured for right or left side placement, allowing for perfect placement within your living room. The pop-up chaise provides ample space for relaxation as well as provides storage within the unit, and the pull-out pop up ottoman extends your sectional into a larger platform. The optional gray, beige or blue microfiber coverings pair with black finished metal legs complete the look of this sectional seating group."}
{"title":"9804DV Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nEdition Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20190919/276/9804DV3PWH209804DV2PWH209804DV1PWH__l.jpg","description":"Creating an environment conducive to your ultimate comfort is one step closer with the addition of the Edition Collection to your living room. Styled in the modern contemporary aesthetic that you prefer and offered in a neutral dove grey, this seating collection is as versatile as it is comfortable. The power motion lay-flat mechanism, once engaged, operates to take you from seated to fully reclined in an easy motion. Providing additional function is the power headrest, allowing for a customized fit for your ultimate comfort."}
{"title":"9446GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBurwell Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210301/396/9446GY3PW209446GY2PW20362130__l.jpg","description":"The unfettered modern design of the Burwell Collection presents as a statement of your preference for contemporary design. The sofa, love seat and chair are featured with power motion reclining mechanisms, taking you from seated to reclined in an easy motion. The love seat features a console with cup holders and hidden storage space. The streamlined track-style arms, clean lines and solid front design of the seats further lends to the modern look. The collection is offered in gray premium faux leather upholstery."}
{"title":"9849CH-PWH Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBorneo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210830/1/9849CH-PWH_seat__l.jpg","description":"Styled for the modern-transitional home, the Borneo Collection is a comfortable and functional addition to your living room. Chocolate fabric, with subtle contrast stitching, making it a neutral decorative choice for a number of home environments. The power motion reclining and headrest mechanism, once engaged, operates to take you from seated to reclined in an easy motion with personalized head support. The sofa features dual reclining ends, as does the love seat. The center console of the love seat provides functional use with the convenience of cupholders and lift-top storage."}
{"title":"8277NGY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPlatina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/691/8277NGY_section__l.jpg","description":"The contemporary look of the Platina Collection is enhanced with unexpected function creating storage and sleep space within your living room. Conveniently stored beneath the main seating is pull out trundle that rises to create a bed. The plush top of the attached ottoman lifts, via hinge, to reveal ample storage space. The gray colored fabric of the collection features contrast stitching."}
{"title":"9789BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPhelps Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/134/9789BU_seating__l.jpg","description":"Not every home is created the same and the unique design of the Phelps Collection allows for maximum flexibility with its reversible chaise. With 5 available coverings - coffee microfiber and 4 linen-like fabric options, teal, brown-gray, dark gray and blue-refined track arm, and comfortable seating, the collection's style is compatible in a number of settings. The matching ottoman provides additional comfort and function to your living area."}
{"title":"9734DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRubin Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201022/103/9734DB_seating__l.jpg","description":"With base design elements that touch retro styling, the Rubin Collection is a perfect option for your modern home. Dark brown faux leather covering options to suit your personal needs and style, the collection allows for versatile placement in a number of living room decor themes."}
{"title":"8256M-GRY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCinque Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210817/76/8256M-GRY_2RLPW__l.jpg","description":"The ultra-low profile of the Cinque Collection is the epitome of clean Italian design. Headrests are adjustable to create a break in the profile of the sofa, while the end chair utilizes power reclining to provide additional support. The modified chaise provides ample space for relaxation whether seated or prone. Opposite configuration of left and right side end and chaise units are available. The dark gray top grain leather upholstered cover and chrome finished legs complete the look of this sectional seating group while USB charging port lends functional convenience the group's design."}
{"title":"8318-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaertes Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201112/7/8318_sectional__l.jpg","description":"Providing ample seating for your friends and family is the Laertes Collection. The classic sectional shape is book-ended by stationary chaise options or USB port enhanced end power recliners. Taupe gray top grain leather provides a gentle touch while darker tone fabric lends stark contrast. The power reclining mechanism bring you to your desired position with a touch of the button. The collection is available in several different configurations to choose from to complete your seating arrangement."}
{"title":"9405BR-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPutnam Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200806/330/9405BR_sectional__l.jpg","description":"The Putnam Collection will serve as a functional, stylish, and comfortable seating group for your living room. The Putnam Collection is offered in brown polished microfiber with diamond pattern stitching with nailhead-adorned arms for classic decorative effect."}
{"title":"8259RFDB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaroni Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/249/8259RFDB_sectional__l.jpg","description":"Providing ample seating for your friends and family is the Maroni Collection. The classic sectional shape is book-ended by USB port enhanced end power recliners. The power reclining mechanism bring you to your desired position with a touch of the button. Providing additional support is the power operated headrest that allows you to further customize your comfort experience."}
{"title":"1138RN Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDamala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200817/147/1138RN_seating__l.jpg","description":"The retro-inspired wood framing of the Damala Collection will perfectly accent your modern home décor. Subtle contouring to the seating collection’s wood frame is finished in walnut, presenting as a classic complement to the orange fabric that covers the padded seats and backs of the sofa, love seat and chair."}
{"title":"1138BU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nDamala Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200817/111/1138BU_seating__l.jpg","description":"The retro-inspired wood framing of the Damala Collection will perfectly accent your modern home décor. Subtle contouring to the seating collection’s wood frame is finished in walnut, presenting as a classic complement to the blue fabric that covers the padded seats and backs of the sofa, love seat and chair."}
{"title":"8326BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPendu Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201011/141/8326BRW_seating__l.jpg","description":"Contoured for your ultimate comfort and designed for placement in homes with transitional or contemporary style, the Pendu Collection will provide the relaxing platform you need for your downtime. Plush seating and backs extend from seated to prone with a pull of the manual reclining mechanism on each piece in the collection – dual reclining sofa, love seat and chair. The top and front bodies is covered in brown top grain leather, with leather match covering those areas beyond your initial reach."}
{"title":"8202GRY-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSinclair Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210621/5/8202GRY_section__l.jpg","description":"A hint of retro styling provides a clean and classic look for your contemporary home in the Sinclair Collection. Offered in a traditional seating or sectional configuration, the options allow for the perfect placement within your living room. The collection is available in either chocolate or gray fabric with contrast pillows that furthers the look and versatility for placement within a number of home decors."}
{"title":"9510 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nKnoxville Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210805/0/9510_seating__l.jpg","description":"There will be plenty of seats with the addition of the Knoxville Collection in your living room, as it will serve as a functional, stylish, and comfortable platform for your ultimate downtime. Flanking the center corner unit, both the left-side and right-side two-seater feature manual reclining\nmechanisms. The left side unit features a functional console – featuring cup holders and lift-top storage. Plush seating and pillow top arms enhance the seating experience."}
{"title":"8201BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nJude Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210720/35/8201BRW3533__l.jpg","description":"Plush seating with well-appointed features makes the Jude Collection a comfortable and functional addition to your living room. Brown premium faux leather coverings for a bold, yet, neutral statement. Manual motion mechanisms operate with the pull of a side-mounted tab, that once engaged, take you from seated to reclined in an easy motion. Each piece in the collection has an individual function allowing for convenience and comfort. The sofa features dual reclining ends and a drop down center seat back with cup-holders and tabletop space, the dual glider reclining ends of the love seat flank a center mounted console with storage and cup-holders, and the chair features a glider mechanism that allows for easy back and forth motion."}
{"title":"8277NBU Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPlatina Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/682/8277NBU_section__l.jpg","description":"The contemporary look of the Platina Collection is enhanced with unexpected function creating storage and sleep space within your living room. Conveniently stored beneath the main seating is pull out trundle that rises to create a bed. The plush top of the attached ottoman lifts, via hinge, to reveal ample storage space. The blue colored fabric of the collection features contrast stitching."}
{"title":"8256GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCinque Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/55/8256GY_Sectiona__l.jpg","description":"The ultra-low profile of the Cinque Collection is the epitome of clean Italian design. Headrests are adjustable to create a break in the profile of the sofa, while the end chair utilizes power reclining to provide additional support. The modified chaise provides ample space for relaxation whether seated or prone. Opposite configuration of the left and right side end and chaise units are available. The light gray top grain leather upholstered cover and chrome finished legs complete the look of this sectional seating group while USB charging port lends functional convenience the group's design."}
{"title":"8260GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFalun Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20180626/dc44f8981e2140fe8cc42691b1dbaf34.jpg","description":"Modern convenience paired with comfort and style create the perfect seating option for your home with the Falun Collection. Gray faux leather cover. Power reclining mechanisms are engaged with the push of a button, taking you from seated to prone in one gentle motion. Further functionality comes in the form of the side-mounted USB port and cup holder console."}
{"title":"8318 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLaertes Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201112/8/8318_seating__l.jpg","description":"Providing ample seating for your friends and family is the Laertes Collection. The classic sectional shape is book-ended by stationary chaise options or USB port enhanced end power recliners. Taupe gray top grain leather provides a gentle touch while darker tone fabric lends stark contrast. The power reclining mechanism bring you to your desired position with a touch of the button. The collection is available in several different configurations to choose from to complete your seating arrangement."}
{"title":"8260DB Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFalun Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200621/72134b301a6a432cbd6142565b62f0b8.jpg","description":"Modern convenience paired with comfort and style create the perfect seating option for your home with the Falun Collection. Dark brown faux leather cover.  Power reclining mechanisms are engaged with the push of a button, taking you from seated to prone in one gentle motion. Further functionality comes in the form of the side-mounted USB port and cup holder console."}
{"title":"8308 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOlympia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200805/d8f61a35e10344998d915ef41a2db1bd.jpg","description":"There is no mistaking the Olympia Collection for anything but a bold study on contemporary design. Sleek lines extend with the push of a button on taking you from a seated to prone position with amazing ease, whether you are on the dual reclining sofa, dual reclining love seat, or reclining chair. The raisin tone top grain leather covers the seats, top part of the arms and front part of the backs, while leather match covers those areas beyond your initial reach. White contrast stitching further accents the design. The collection is available in several different configurations to choose from to complete your seating arrangement."}
{"title":"8230BRW Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nBastrop Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201006/26/8230BRW_seating3__l.jpg","description":"Comfort is the name of the game in the Bastrop Collection. Brown premium faux leather in several configurations – traditional sofa, love seat and chair, and sectional – for versatile placement in your living room maximum relaxation potential in your downtime. Manually engaged motion mechanisms allow for quick transition from seated to prone with the quick pull of a tab. Each piece in the collection has an individual function allowing for convenience and comfort."}
{"title":"8259 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaroni Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201018/44/8259_sectional__l.jpg","description":"Providing ample seating for your friends and family is the Maroni Collection. The classic sectional shape is book-ended by USB port enhanced end power recliners. Taupe gray fabric provides a gentle touch while darker tone fabric lends stark contrast. The power reclining mechanism bring you to your desired position with a touch of the button. Providing additional support is the power operated headrest that allows you to further customize your comfort experience."}
{"title":"8256FBR Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nCinque Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210616/61/8256FBR_SC_HP__l.jpg","description":"The ultra-low profile of the Cinque Collection is the epitome of clean Italian design. Headrests are adjustable to create a break in the profile of the sofa, while the end chair utilizes power reclining to provide additional support. The modified chaise provides ample space for relaxation whether seated or prone. Chrome finished legs complete the look of this sectional seating group."}
{"title":"8259RFTP Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nMaroni Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210225/93/8259RFTP_sectional__l.jpg","description":"Providing ample seating for your friends and family is the Maroni Collection. The classic sectional shape is book-ended by USB port enhanced end power recliners. The power reclining mechanism bring you to your desired position with a touch of the button. Providing additional support is the power operated headrest that allows you to further customize your comfort experience."}
{"title":"8229DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmite Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/126/8229DG_LRPWCNACCRACRRPW__l.jpg","description":"Ultra-modern design combined with convenient function makes the Amite Collection a stylish addition to your contemporary home. Dark gray premium faux leather match is perfectly complemented by gray accenting on the seatbacks, seats and arms, providing contrast and definition to the profile of the collection. With the push of the power reclining mechanism, the end and armless reclining chairs recline to the prone position. The console unit features hidden storage as well as cup holders for convenient functional use. The corner center unit and stationary armless chair do not recline."}
{"title":"8238 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nShreveport Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201018/29/8238_seating3__l.jpg","description":"The substantial size and customizable configuration of the Shreveport Collection creates the perfect platform for relaxation in your living space. Bookending this seating group are the left or right end units that are offered as reclining chair or push back reclining chaise. An armless chair, console unit, corner seat, and armless reclining chair make up the middle part of this sectional offering."}
{"title":"1104GY Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nLewiston Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210110/28/1104GY_seating__l.jpg","description":"Designed with inspiration from the Arts & Crafts movement, the Lewiston Collection will be a classic addition to your home’s décor. The sofa, love seat and chair's transitionally styled legs and vertical slat-supported wood arms are finished in an antique gray, providing complementing contrast to the gray linen-like fabric covering."}
{"title":"8229 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nAmite Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201201/130/8229_LRPWACCRARPWCNRRPW__l.jpg","description":"Ultra-modern design combined with convenient function makes the Amite Collection a stylish addition to your contemporary home. Beige premium faux leather match is perfectly complemented by dark brown accenting on the seatbacks, seats and arms, providing contrast and definition to the profile of the collection. With the push of the power reclining mechanism, the end and armless reclining chairs recline to the prone position. The console unit features hidden storage as well as cup holders for convenient functional use. The corner center unit and stationary armless chair do not recline."}
{"title":"8308-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nOlympia Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200805/3c56793972874db493069d689b687a47.jpg","description":"There is no mistaking the Olympia Collection for anything but a bold study on contemporary design. Sleek lines extend with the push of a button on taking you from a seated to prone position with amazing ease, whether you are on the dual reclining sofa, dual reclining love seat, or reclining chair. The raisin tone top grain leather covers the seats, top part of the arms and front part of the backs, while leather match covers those areas beyond your initial reach. White contrast stitching further accents the design. The collection is available in several different configurations to choose from to complete your seating arrangement."}
{"title":"8469 Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nSt. Claire Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200216/348/8469_a__l.jpg","description":"Graceful curves are elegantly appointed in the St. Claire Collection. Delicate herringbone style fabric presents as the initial look into the traditional style of this seating group with prevalent button-tufted accenting that is hard to overlook. The rolled arms and bowed seatbacks present an air of femininity while lending curvaceous inspiration to the traditional chaise lounge. Cherry finished turn legs provide support and complement the brown tone of the fabric."}
{"title":"8480BRW-SC Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPecos Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20200630/34/8480BRW_LED_2LCNPDCRARPD2RPD20361231__l.jpg","description":"The Pecos Collection blends style and function to create a platform for relaxation. Modernizing the look of the ample seating is an inset contrast welt. Chair, love seat, sofa and sectional are available in both manual and power version. With the reclining mechanism, the user is changed from a seated position to a reclined position smoothly. Dark brown premium faux leather covered."}
{"title":"9805DG Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nRenzo Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20210207/189/9805DG3PW209805DG2PW20174401__l.jpg","description":"Styled for the modern transitional home, the Renzo Collection provides a welcoming spot for your relaxing downtime. This seating group is offered in a dark gray top grain leather match making it a neutral decorative choice for a number of home environments. The power motion mechanism, once engaged, operates to take you from seated to reclined in an easy motion. Providing additional function is the USB port, a convenient power supply, keeping your electronic device within reach. The sofa features dual reclining ends, as does the love seat.  Wood legs support the frame, lending accent to the modern transitional profile of the collection."}
{"title":"8325BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nGreeley Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/20171106/8325BLK-3_1316_l.jpg","description":"Designed to be the comfortable spot that you nestle into after a long day, the Greeley Collection will be a welcome addition to your home's living room. Plush seating and backs extend from seated to prone with a pull of the manual reclining mechanism on each piece in the collection – dual reclining sofa, love seat and chair. The top and front bodies is covered in black top grain leather, with leather match covering those areas beyond your initial reach."}
{"title":"8326BLK Seating\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPendu Collection","main category":"Seating","sub category":"Seating Collections","img":"https://www.homelegance.com/u/HMLG/20201011/194/8326BLK_seating__l.jpg","description":"Contoured for your ultimate comfort and designed for placement in homes with transitional or contemporary style, the Pendu Collection will provide the relaxing platform you need for your downtime. Plush seating and backs extend from seated to prone with a pull of the manual reclining mechanism on each piece in the collection – dual reclining sofa, love seat and chair. The top and front bodies is covered in black top grain leather, with leather match covering those areas beyond your initial reach."}
